VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
<?xml version="1.0" encoding="UTF-8"?>
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.3" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
	<name>EFR32FG1V131F256GM48</name>
	<version>3.0.0</version>
	<description>Silicon Labs EFR32FG1V131F256GM48 Cortex-M MCU</description>
	<licenseText>
		    *******************************************************************************\n
		    * # License                                                                    \n
		    * Copyright 2020 Silicon Laboratories Inc. www.silabs.com                      \n
		    *******************************************************************************\n
		    *                                                                              \n
		    * SPDX-License-Identifier: Zlib                                                \n
		    *                                                                              \n
		    * The licensor of this software is Silicon Laboratories Inc.                   \n
		    *                                                                              \n
		    * This software is provided 'as-is', without any express or implied            \n
		    * warranty. In no event will the authors be held liable for any damages        \n
		    * arising from the use of this software.                                       \n
		    *                                                                              \n
		    * Permission is granted to anyone to use this software for any purpose,        \n
		    * including commercial applications, and to alter it and redistribute it       \n
		    * freely, subject to the following restrictions:                               \n
		    *                                                                              \n
		    * 1. The origin of this software must not be misrepresented; you must not      \n
		    *    claim that you wrote the original software. If you use this software      \n
		    *    in a product, an acknowledgment in the product documentation would be     \n
		    *    appreciated but is not required.                                          \n
		    * 2. Altered source versions must be plainly marked as such, and must not be   \n
		    *    misrepresented as being the original software.                            \n
		    * 3. This notice may not be removed or altered from any source distribution.   \n
		    *                                                                              \n
		    *******************************************************************************
	</licenseText>
	<cpu>
		<name>CM4</name>
		<revision>r0p1</revision>
		<endian>little</endian>
		<mpuPresent>true</mpuPresent>
		<fpuPresent>true</fpuPresent>
		<nvicPrioBits>3</nvicPrioBits>
		<vendorSystickConfig>false</vendorSystickConfig>
	</cpu>
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<peripherals>
		<peripheral>
			<name>MSC</name>
			<description>MSC</description>
			<baseAddress>0x400E0000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x00000800</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>MSC</name>
				<value>24</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>Memory System Control Register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0x0000000F</resetMask>
					<fields>
						<field>
							<name>ADDRFAULTEN</name>
							<description>Invalid Address Bus Fault Response Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKDISFAULTEN</name>
							<description>Clock-disabled Bus Fault Response Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PWRUPONDEMAND</name>
							<description>Power Up on Demand During Wake Up</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IFCREADCLEAR</name>
							<description>IFC Read Clears IF</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>READCTRL</name>
					<description>Read Control Register</description>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x01000100</resetValue>
					<resetMask>0x13000338</resetMask>
					<fields>
						<field>
							<name>IFCDIS</name>
							<description>Internal Flash Cache Disable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIDIS</name>
							<description>Automatic Invalidate Disable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ICCDIS</name>
							<description>Interrupt Context Cache Disable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PREFETCH</name>
							<description>Prefetch Mode</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>USEHPROT</name>
							<description>AHB_HPROT Mode</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE</name>
							<description>Read Mode</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>WS0</name>
									<description>Zero wait-states inserted in fetch or read transfers</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WS1</name>
									<description>One wait-state inserted for each fetch or read transfer. See Flash Wait-States table for details</description>
									<value>0x00000001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCBTP</name>
							<description>Suppress Conditional Branch Target Perfetch</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WRITECTRL</name>
					<description>Write Control Register</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>WREN</name>
							<description>Enable Write/Erase Controller</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IRQERASEABORT</name>
							<description>Abort Page Erase on Interrupt</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WRITECMD</name>
					<description>Write Command Register</description>
					<addressOffset>0x00C</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000113F</resetMask>
					<fields>
						<field>
							<name>LADDRIM</name>
							<description>Load MSC_ADDRB Into ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ERASEPAGE</name>
							<description>Erase Page</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>WRITEEND</name>
							<description>End Write Mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>WRITEONCE</name>
							<description>Word Write-Once Trigger</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>WRITETRIG</name>
							<description>Word Write Sequence Trigger</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ERASEABORT</name>
							<description>Abort Erase Sequence</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ERASEMAIN0</name>
							<description>Mass Erase Region 0</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CLEARWDATA</name>
							<description>Clear WDATA State</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ADDRB</name>
					<description>Page Erase/Write Address Buffer</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADDRB</name>
							<description>Page Erase or Write Address Buffer</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WDATA</name>
					<description>Write Data Register</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WDATA</name>
							<description>Write Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Status Register</description>
					<addressOffset>0x01C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000008</resetValue>
					<resetMask>0x0000007F</resetMask>
					<fields>
						<field>
							<name>BUSY</name>
							<description>Erase/Write Busy</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LOCKED</name>
							<description>Access Locked</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INVADDR</name>
							<description>Invalid Write Address or Erase Page</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WDATAREADY</name>
							<description>WDATA Write Ready</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WORDTIMEOUT</name>
							<description>Flash Write Word Timeout</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERASEABORTED</name>
							<description>The Current Flash Erase Operation Aborted</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PCRUNNING</name>
							<description>Performance Counters Running</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IF</name>
					<description>Interrupt Flag Register</description>
					<addressOffset>0x030</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>ERASE</name>
							<description>Erase Done Interrupt Read Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WRITE</name>
							<description>Write Done Interrupt Read Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHOF</name>
							<description>Cache Hits Overflow Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CMOF</name>
							<description>Cache Misses Overflow Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PWRUPF</name>
							<description>Flash Power Up Sequence Complete Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICACHERR</name>
							<description>ICache RAM Parity Error Flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFS</name>
					<description>Interrupt Flag Set Register</description>
					<addressOffset>0x034</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>ERASE</name>
							<description>Set ERASE Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>WRITE</name>
							<description>Set WRITE Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CHOF</name>
							<description>Set CHOF Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CMOF</name>
							<description>Set CMOF Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PWRUPF</name>
							<description>Set PWRUPF Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ICACHERR</name>
							<description>Set ICACHERR Interrupt Flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFC</name>
					<description>Interrupt Flag Clear Register</description>
					<addressOffset>0x038</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>ERASE</name>
							<description>Clear ERASE Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>WRITE</name>
							<description>Clear WRITE Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CHOF</name>
							<description>Clear CHOF Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CMOF</name>
							<description>Clear CMOF Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PWRUPF</name>
							<description>Clear PWRUPF Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ICACHERR</name>
							<description>Clear ICACHERR Interrupt Flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IEN</name>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x03C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>ERASE</name>
							<description>ERASE Interrupt Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WRITE</name>
							<description>WRITE Interrupt Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHOF</name>
							<description>CHOF Interrupt Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CMOF</name>
							<description>CMOF Interrupt Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PWRUPF</name>
							<description>PWRUPF Interrupt Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ICACHERR</name>
							<description>ICACHERR Interrupt Enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LOCK</name>
					<description>Configuration Lock Register</description>
					<addressOffset>0x040</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>LOCKKEY</name>
							<description>Configuration Lock</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<value>0x00000001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CACHECMD</name>
					<description>Flash Cache Command Register</description>
					<addressOffset>0x044</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>INVCACHE</name>
							<description>Invalidate Instruction Cache</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>STARTPC</name>
							<description>Start Performance Counters</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>STOPPC</name>
							<description>Stop Performance Counters</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CACHEHITS</name>
					<description>Cache Hits Performance Counter</description>
					<addressOffset>0x048</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000FFFFF</resetMask>
					<fields>
						<field>
							<name>CACHEHITS</name>
							<description>Cache Hits Since Last Performance Counter Start Command</description>
							<bitOffset>0</bitOffset>
							<bitWidth>20</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CACHEMISSES</name>
					<description>Cache Misses Performance Counter</description>
					<addressOffset>0x04C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000FFFFF</resetMask>
					<fields>
						<field>
							<name>CACHEMISSES</name>
							<description>Cache Misses Since Last Performance Counter Start Command</description>
							<bitOffset>0</bitOffset>
							<bitWidth>20</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MASSLOCK</name>
					<description>Mass Erase Lock Register</description>
					<addressOffset>0x054</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>LOCKKEY</name>
							<description>Mass Erase Lock</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<value>0x00000001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
