VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>STARTUP</name>
					<description>Startup Control</description>
					<addressOffset>0x05C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1300104D</resetValue>
					<resetMask>0x773FF3FF</resetMask>
					<fields>
						<field>
							<name>STDLY0</name>
							<description>Startup Delay 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STDLY1</name>
							<description>Startup Delay 0</description>
							<bitOffset>12</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ASTWAIT</name>
							<description>Active Startup Wait</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STWSEN</name>
							<description>Startup Waitstates Enable</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STWSAEN</name>
							<description>Startup Waitstates Always Enable</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STWS</name>
							<description>Startup Waitstates</description>
							<bitOffset>28</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMD</name>
					<description>Command Register</description>
					<addressOffset>0x074</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>PWRUP</name>
							<description>Flash Power Up Command</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>EMU</name>
			<description>EMU</description>
			<baseAddress>0x400E3000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x00000400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>EMU</name>
				<value>0</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>Control Register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000002</resetMask>
					<fields>
						<field>
							<name>EM2BLOCK</name>
							<description>Energy Mode 2 Block</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Status Register</description>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0010011F</resetMask>
					<fields>
						<field>
							<name>VMONRDY</name>
							<description>VMON Ready</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VMONAVDD</name>
							<description>VMON AVDD Channel</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VMONALTAVDD</name>
							<description>Alternate VMON AVDD Channel</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VMONDVDD</name>
							<description>VMON DVDD Channel</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VMONIO0</name>
							<description>VMON IOVDD0 Channel</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VMONFVDD</name>
							<description>VMON VDDFLASH Channel</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EM4IORET</name>
							<description>IO Retention Status</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LOCK</name>
					<description>Configuration Lock Register</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>LOCKKEY</name>
							<description>Configuration Lock Key</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<value>0x00000001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM0CTRL</name>
					<description>Memory Control Register</description>
					<addressOffset>0x00C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000000F</resetMask>
					<fields>
						<field>
							<name>RAMPOWERDOWN</name>
							<description>RAM0 Blockset Power-down</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>None of the RAM blocks powered down</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BLK4</name>
									<description>Power down RAM blocks 4 and above</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BLK3TO4</name>
									<description>Power down RAM blocks 3 and above</description>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BLK2TO4</name>
									<description>Power down RAM blocks 2 and above</description>
									<value>0x0000000E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BLK1TO4</name>
									<description>Power down RAM blocks 1 and above</description>
									<value>0x0000000F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CMD</name>
					<description>Command Register</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>EM4UNLATCH</name>
							<description>EM4 Unlatch</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EM4CTRL</name>
					<description>EM4 Control Register</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0003003F</resetMask>
					<fields>
						<field>
							<name>EM4STATE</name>
							<description>Energy Mode 4 State</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RETAINLFRCO</name>
							<description>LFRCO Retain During EM4</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RETAINLFXO</name>
							<description>LFXO Retain During EM4</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RETAINULFRCO</name>
							<description>ULFRCO Retain During EM4S</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EM4IORETMODE</name>
							<description>EM4 IO Retention Disable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>No Retention: Pads enter reset state when entering EM4</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EM4EXIT</name>
									<description>Retention through EM4: Pads enter reset state when exiting EM4</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SWUNLATCH</name>
									<description>Retention through EM4 and Wakeup: software writes UNLATCH register to remove retention</description>
									<value>0x00000002</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EM4ENTRY</name>
							<description>Energy Mode 4 Entry</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TEMPLIMITS</name>
					<description>Temperature Limits for Interrupt Generation</description>
					<addressOffset>0x01C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0000FF00</resetValue>
					<resetMask>0x0001FFFF</resetMask>
					<fields>
						<field>
							<name>TEMPLOW</name>
							<description>Temperature Low Limit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEMPHIGH</name>
							<description>Temperature High Limit</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EM4WUEN</name>
							<description>Enable EM4 Wakeup Due to Low/high Temperature</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TEMP</name>
					<description>Value of Last Temperature Measurement</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>TEMP</name>
							<description>Temperature Measurement</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IF</name>
					<description>Interrupt Flag Register</description>
					<addressOffset>0x024</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xE11FC0FF</resetMask>
					<fields>
						<field>
							<name>VMONAVDDFALL</name>
							<description>VMON AVDD Channel Fall</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VMONAVDDRISE</name>
							<description>VMON AVDD Channel Rise</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VMONALTAVDDFALL</name>
							<description>Alternate VMON AVDD Channel Fall</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VMONALTAVDDRISE</name>
							<description>Alternate VMON AVDD Channel Rise</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VMONDVDDFALL</name>
							<description>VMON DVDD Channel Fall</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VMONDVDDRISE</name>
							<description>VMON DVDD Channel Rise</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VMONIO0FALL</name>
							<description>VMON IOVDD0 Channel Fall</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VMONIO0RISE</name>
							<description>VMON IOVDD0 Channel Rise</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VMONFVDDFALL</name>
							<description>VMON VDDFLASH Channel Fall</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VMONFVDDRISE</name>
							<description>VMON VDDFLASH Channel Rise</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PFETOVERCURRENTLIMIT</name>
							<description>PFET Current Limit Hit</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>NFETOVERCURRENTLIMIT</name>
							<description>NFET Current Limit Hit</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DCDCLPRUNNING</name>
							<description>LP Mode is Running</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DCDCLNRUNNING</name>
							<description>LN Mode is Running</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DCDCINBYPASS</name>
							<description>DCDC is in Bypass</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EM23WAKEUP</name>
							<description>Wakeup IRQ From EM2 and EM3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TEMP</name>
							<description>New Temperature Measurement Valid</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TEMPLOW</name>
							<description>Temperature Low Limit Reached</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TEMPHIGH</name>
							<description>Temperature High Limit Reached</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFS</name>
					<description>Interrupt Flag Set Register</description>
					<addressOffset>0x028</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xE11FC0FF</resetMask>
					<fields>
						<field>
							<name>VMONAVDDFALL</name>
							<description>Set VMONAVDDFALL Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VMONAVDDRISE</name>
							<description>Set VMONAVDDRISE Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VMONALTAVDDFALL</name>
							<description>Set VMONALTAVDDFALL Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VMONALTAVDDRISE</name>
							<description>Set VMONALTAVDDRISE Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VMONDVDDFALL</name>
							<description>Set VMONDVDDFALL Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VMONDVDDRISE</name>
							<description>Set VMONDVDDRISE Interrupt Flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VMONIO0FALL</name>
							<description>Set VMONIO0FALL Interrupt Flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VMONIO0RISE</name>
							<description>Set VMONIO0RISE Interrupt Flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VMONFVDDFALL</name>
							<description>Set VMONFVDDFALL Interrupt Flag</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VMONFVDDRISE</name>
							<description>Set VMONFVDDRISE Interrupt Flag</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PFETOVERCURRENTLIMIT</name>
							<description>Set PFETOVERCURRENTLIMIT Interrupt Flag</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>NFETOVERCURRENTLIMIT</name>
							<description>Set NFETOVERCURRENTLIMIT Interrupt Flag</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCDCLPRUNNING</name>
							<description>Set DCDCLPRUNNING Interrupt Flag</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCDCLNRUNNING</name>
							<description>Set DCDCLNRUNNING Interrupt Flag</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCDCINBYPASS</name>
							<description>Set DCDCINBYPASS Interrupt Flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EM23WAKEUP</name>
							<description>Set EM23WAKEUP Interrupt Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TEMP</name>
							<description>Set TEMP Interrupt Flag</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TEMPLOW</name>
							<description>Set TEMPLOW Interrupt Flag</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TEMPHIGH</name>
							<description>Set TEMPHIGH Interrupt Flag</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
