VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>IFC</name>
					<description>Interrupt Flag Clear Register</description>
					<addressOffset>0x02C</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xE11FC0FF</resetMask>
					<fields>
						<field>
							<name>VMONAVDDFALL</name>
							<description>Clear VMONAVDDFALL Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VMONAVDDRISE</name>
							<description>Clear VMONAVDDRISE Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VMONALTAVDDFALL</name>
							<description>Clear VMONALTAVDDFALL Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VMONALTAVDDRISE</name>
							<description>Clear VMONALTAVDDRISE Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VMONDVDDFALL</name>
							<description>Clear VMONDVDDFALL Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VMONDVDDRISE</name>
							<description>Clear VMONDVDDRISE Interrupt Flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VMONIO0FALL</name>
							<description>Clear VMONIO0FALL Interrupt Flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VMONIO0RISE</name>
							<description>Clear VMONIO0RISE Interrupt Flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VMONFVDDFALL</name>
							<description>Clear VMONFVDDFALL Interrupt Flag</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VMONFVDDRISE</name>
							<description>Clear VMONFVDDRISE Interrupt Flag</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PFETOVERCURRENTLIMIT</name>
							<description>Clear PFETOVERCURRENTLIMIT Interrupt Flag</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>NFETOVERCURRENTLIMIT</name>
							<description>Clear NFETOVERCURRENTLIMIT Interrupt Flag</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCDCLPRUNNING</name>
							<description>Clear DCDCLPRUNNING Interrupt Flag</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCDCLNRUNNING</name>
							<description>Clear DCDCLNRUNNING Interrupt Flag</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCDCINBYPASS</name>
							<description>Clear DCDCINBYPASS Interrupt Flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EM23WAKEUP</name>
							<description>Clear EM23WAKEUP Interrupt Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TEMP</name>
							<description>Clear TEMP Interrupt Flag</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TEMPLOW</name>
							<description>Clear TEMPLOW Interrupt Flag</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TEMPHIGH</name>
							<description>Clear TEMPHIGH Interrupt Flag</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IEN</name>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x030</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xE11FC0FF</resetMask>
					<fields>
						<field>
							<name>VMONAVDDFALL</name>
							<description>VMONAVDDFALL Interrupt Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VMONAVDDRISE</name>
							<description>VMONAVDDRISE Interrupt Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VMONALTAVDDFALL</name>
							<description>VMONALTAVDDFALL Interrupt Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VMONALTAVDDRISE</name>
							<description>VMONALTAVDDRISE Interrupt Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VMONDVDDFALL</name>
							<description>VMONDVDDFALL Interrupt Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VMONDVDDRISE</name>
							<description>VMONDVDDRISE Interrupt Enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VMONIO0FALL</name>
							<description>VMONIO0FALL Interrupt Enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VMONIO0RISE</name>
							<description>VMONIO0RISE Interrupt Enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VMONFVDDFALL</name>
							<description>VMONFVDDFALL Interrupt Enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VMONFVDDRISE</name>
							<description>VMONFVDDRISE Interrupt Enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PFETOVERCURRENTLIMIT</name>
							<description>PFETOVERCURRENTLIMIT Interrupt Enable</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NFETOVERCURRENTLIMIT</name>
							<description>NFETOVERCURRENTLIMIT Interrupt Enable</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DCDCLPRUNNING</name>
							<description>DCDCLPRUNNING Interrupt Enable</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DCDCLNRUNNING</name>
							<description>DCDCLNRUNNING Interrupt Enable</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DCDCINBYPASS</name>
							<description>DCDCINBYPASS Interrupt Enable</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EM23WAKEUP</name>
							<description>EM23WAKEUP Interrupt Enable</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEMP</name>
							<description>TEMP Interrupt Enable</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEMPLOW</name>
							<description>TEMPLOW Interrupt Enable</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEMPHIGH</name>
							<description>TEMPHIGH Interrupt Enable</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PWRLOCK</name>
					<description>Regulator and Supply Lock Register</description>
					<addressOffset>0x034</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>LOCKKEY</name>
							<description>Regulator and Supply Configuration Lock Key</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<value>0x00000001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PWRCFG</name>
					<description>Power Configuration Register</description>
					<addressOffset>0x038</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000000F</resetMask>
					<fields>
						<field>
							<name>PWRCFG</name>
							<description>Power Configuration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>STARTUP</name>
									<description>Power up configuration. Works with any external configuration.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DCDCTODVDD</name>
									<description>Configured: DCDC control logic is enabled.</description>
									<value>0x00000002</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PWRCTRL</name>
					<description>Power Control Register</description>
					<addressOffset>0x03C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000020</resetMask>
					<fields>
						<field>
							<name>ANASW</name>
							<description>Analog Switch Selection</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCDCCTRL</name>
					<description>DCDC Control</description>
					<addressOffset>0x040</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000030</resetValue>
					<resetMask>0x00000033</resetMask>
					<fields>
						<field>
							<name>DCDCMODE</name>
							<description>Regulator Mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>BYPASS</name>
									<description>DCDC regulator is operating in bypass mode. Prior to configuring DCDCMODE=BYPASS, software must set EMU_DCDCCLIMCTRL.BYPLIMEN=1 to prevent excessive current between VREGVDD and DVDD supplies.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWNOISE</name>
									<description>DCDC regulator is operating in low noise mode.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOWPOWER</name>
									<description>DCDC regulator is operating in low power mode.</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OFF</name>
									<description>DCDC regulator is off and the bypass switch is off. Note: DVDD must be supplied externally</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DCDCMODEEM23</name>
							<description>DCDC Mode EM23</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DCDCMODEEM4</name>
							<description>DCDC Mode EM4H</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCDCMISCCTRL</name>
					<description>DCDC Miscellaneous Control Register</description>
					<addressOffset>0x04C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x33307700</resetValue>
					<resetMask>0x377FFF01</resetMask>
					<fields>
						<field>
							<name>LNFORCECCM</name>
							<description>Force DCDC Into CCM Mode in Low Noise Operation</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PFETCNT</name>
							<description>PFET Switch Number Selection</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NFETCNT</name>
							<description>NFET Switch Number Selection</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BYPLIMSEL</name>
							<description>Current Limit in Bypass Mode</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LPCLIMILIMSEL</name>
							<description>Current Limit Level Selection for Current Limiter in LP Mode</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LNCLIMILIMSEL</name>
							<description>Current Limit Level Selection for Current Limiter in LN Mode</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LPCMPBIAS</name>
							<description>LP Mode Comparator Bias Selection</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>BIAS0</name>
									<description>Maximum load current less than 75uA.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BIAS1</name>
									<description>Maximum load current less than 500uA.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BIAS2</name>
									<description>Maximum load current less than 2.5mA.</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BIAS3</name>
									<description>Maximum load current less than 10mA.</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DCDCZDETCTRL</name>
					<description>DCDC Power Train NFET Zero Current Detector Control Register</description>
					<addressOffset>0x050</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000130</resetValue>
					<resetMask>0x00000370</resetMask>
					<fields>
						<field>
							<name>ZDETILIMSEL</name>
							<description>Reverse Current Limit Level Selection for Zero Detector</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ZDETBLANKDLY</name>
							<description>Reserved for internal use. Do not change.</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCDCCLIMCTRL</name>
					<description>DCDC Power Train PFET Current Limiter Control Register</description>
					<addressOffset>0x054</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00002100</resetValue>
					<resetMask>0x00002300</resetMask>
					<fields>
						<field>
							<name>CLIMBLANKDLY</name>
							<description>Reserved for internal use. Do not change.</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BYPLIMEN</name>
							<description>Bypass Current Limit Enable</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCDCLNCOMPCTRL</name>
					<description>DCDC Low Noise Compensator Control Register</description>
					<addressOffset>0x058</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x57204077</resetValue>
					<resetMask>0xF730F1F7</resetMask>
					<fields>
						<field>
							<name>COMPENR1</name>
							<description>Low Noise Mode Compensator R1 Trim Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMPENR2</name>
							<description>Low Noise Mode Compensator R2 Trim Value</description>
							<bitOffset>4</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMPENR3</name>
							<description>Low Noise Mode Compensator R3 Trim Value</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMPENC1</name>
							<description>Low Noise Mode Compensator C1 Trim Value</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMPENC2</name>
							<description>Low Noise Mode Compensator C2 Trim Value</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMPENC3</name>
							<description>Low Noise Mode Compensator C3 Trim Value</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCDCLNVCTRL</name>
					<description>DCDC Low Noise Voltage Register</description>
					<addressOffset>0x05C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00007100</resetValue>
					<resetMask>0x00007F02</resetMask>
					<fields>
						<field>
							<name>LNATT</name>
							<description>Low Noise Mode Feedback Attenuation</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LNVREF</name>
							<description>Low Noise Mode VREF Trim</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCDCTIMING</name>
					<description>DCDC Controller Timing Value Register</description>
					<addressOffset>0x060</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0FF1F8FF</resetValue>
					<resetMask>0x6FF1F8FF</resetMask>
					<fields>
						<field>
							<name>LPINITWAIT</name>
							<description>Low Power Initialization Wait Time</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMPENPRCHGEN</name>
							<description>LN Mode Precharge Enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LNWAIT</name>
							<description>Low Noise Controller Initialization Wait Time</description>
							<bitOffset>12</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BYPWAIT</name>
							<description>Bypass Mode Transition From Low Power or Low Noise Modes Wait Wait</description>
							<bitOffset>20</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DUTYSCALE</name>
							<description>Select Bias Duty Cycle Clock</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCDCLPVCTRL</name>
					<description>DCDC Low Power Voltage Register</description>
					<addressOffset>0x064</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000168</resetValue>
					<resetMask>0x000001FF</resetMask>
					<fields>
						<field>
							<name>LPATT</name>
							<description>Low Power Feedback Attenuation</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LPVREF</name>
							<description>LP Mode Reference Selection for EM23 and EM4H</description>
							<bitOffset>1</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCDCLPCTRL</name>
					<description>DCDC Low Power Control Register</description>
					<addressOffset>0x06C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00007000</resetValue>
					<resetMask>0x0700F000</resetMask>
					<fields>
						<field>
							<name>LPCMPHYSSEL</name>
							<description>LP Mode Hysteresis Selection</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LPVREFDUTYEN</name>
							<description>LP Mode Duty Cycling Enable</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LPBLANK</name>
							<description>Reserved for internal use. Do not change.</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
