VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>RMU</name>
			<description>RMU</description>
			<baseAddress>0x400E5000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x00000400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CTRL</name>
					<description>Control Register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00004224</resetValue>
					<resetMask>0x03007777</resetMask>
					<fields>
						<field>
							<name>WDOGRMODE</name>
							<description>WDOG Reset Mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Reset request is blocked. This disable bit is redundant with enable/disable bit in WDOG</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIMITED</name>
									<description>The CRYOTIMER, DEBUGGER, RTCC, are not reset.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTENDED</name>
									<description>The CRYOTIMER, DEBUGGER are not reset. RTCC is reset.</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULL</name>
									<description>The entire device is reset except some EMU and RMU registers.</description>
									<value>0x00000004</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOCKUPRMODE</name>
							<description>Core LOCKUP Reset Mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Reset request is blocked.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIMITED</name>
									<description>The CRYOTIMER, DEBUGGER, RTCC, are not reset.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTENDED</name>
									<description>The CRYOTIMER, DEBUGGER are not reset. RTCC is reset.</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULL</name>
									<description>The entire device is reset except some EMU and RMU registers.</description>
									<value>0x00000004</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYSRMODE</name>
							<description>Core Sysreset Reset Mode</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Reset request is blocked.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIMITED</name>
									<description>The CRYOTIMER, DEBUGGER, RTCC, are not reset.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTENDED</name>
									<description>The CRYOTIMER, DEBUGGER are not reset. RTCC is reset.</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULL</name>
									<description>The entire device is reset except some EMU and RMU registers.</description>
									<value>0x00000004</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PINRMODE</name>
							<description>PIN Reset Mode</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Reset request is blocked.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIMITED</name>
									<description>The CRYOTIMER, DEBUGGER, RTCC, are not reset.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTENDED</name>
									<description>The CRYOTIMER, DEBUGGER are not reset. RTCC is reset.</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULL</name>
									<description>The entire device is reset except some EMU and RMU registers.</description>
									<value>0x00000004</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESETSTATE</name>
							<description>System Software Reset State</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RSTCAUSE</name>
					<description>Reset Cause Register</description>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00010F1D</resetMask>
					<fields>
						<field>
							<name>PORST</name>
							<description>Power on Reset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AVDDBOD</name>
							<description>Brown Out Detector AVDD Reset</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DVDDBOD</name>
							<description>Brown Out Detector DVDD Reset</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DECBOD</name>
							<description>Brown Out Detector Decouple Domain Reset</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EXTRST</name>
							<description>External Pin Reset</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LOCKUPRST</name>
							<description>LOCKUP Reset</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SYSREQRST</name>
							<description>System Request Reset</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WDOGRST</name>
							<description>Watchdog Reset</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EM4RST</name>
							<description>EM4 Reset</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMD</name>
					<description>Command Register</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>RCCLR</name>
							<description>Reset Cause Clear</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RST</name>
					<description>Reset Control Register</description>
					<addressOffset>0x00C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
				</register>
				<register>
					<name>LOCK</name>
					<description>Configuration Lock Register</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>LOCKKEY</name>
							<description>Configuration Lock Key</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<value>0x00000001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
