VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>LFBCLKENMASK0</name>
					<description/>
					<addressOffset>0x1BC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LFBCLKENMASK0</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LFECLKENMASK0</name>
					<description/>
					<addressOffset>0x1C4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LFECLKENMASK0</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PCNTCLKENMASK</name>
					<description/>
					<addressOffset>0x1CC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PCNTCLKENMASK</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TEST</name>
					<description/>
					<addressOffset>0x1D0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TEST</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TESTHFRCOCTRL</name>
					<description/>
					<addressOffset>0x1D4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TESTHFRCOCTRL</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TESTAUXHFRCOCTRL</name>
					<description/>
					<addressOffset>0x1D8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TESTAUXHFRCOCTRL</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TESTLFRCOCTRL</name>
					<description/>
					<addressOffset>0x1DC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TESTLFRCOCTRL</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TESTHFXOCTRL</name>
					<description/>
					<addressOffset>0x1E0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TESTHFXOCTRL</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TESTLFXOCTRL</name>
					<description/>
					<addressOffset>0x1E4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TESTLFXOCTRL</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>CRYPTO</name>
			<description>CRYPTO</description>
			<baseAddress>0x400F0000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x00000400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CRYPTO</name>
				<value>25</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>Control Register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xB333C407</resetMask>
					<fields>
						<field>
							<name>AES</name>
							<description>AES Mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>KEYBUFDIS</name>
							<description>Key Buffer Disable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SHA</name>
							<description>SHA Mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NOBUSYSTALL</name>
							<description>No Stalling of Bus When Busy</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INCWIDTH</name>
							<description>Increment Width</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INCWIDTH1</name>
									<description>Byte 15 in DATA1 is used for the increment function.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INCWIDTH2</name>
									<description>Bytes 14 and 15 in DATA1 are used for the increment function.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INCWIDTH3</name>
									<description>Bytes 13 to 15 in DATA1 are used for the increment function.</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INCWIDTH4</name>
									<description>Bytes 12 to 15 in DATA1 are used for the increment function.</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMA0MODE</name>
							<description>DMA0 Read Mode</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>FULL</name>
									<description>Target register is fully read/written during every DMA transaction</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LENLIMIT</name>
									<description>Length Limited. When the current length, i.e. LENGTHA or LENGTHB indicates that there are less bytes available than the register size, only length + necessary zero padding is read. Zero padding is automatically added when writing.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULLBYTE</name>
									<description>Target register is fully read/written during every DMA transaction. Bytewise DMA.</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LENLIMITBYTE</name>
									<description>Length Limited. When the current length, i.e. LENGTHA or LENGTHB indicates that there are less bytes available than the register size, only length + necessary zero padding is read. Bytewise DMA. Zero padding is automatically added when writing.</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMA0RSEL</name>
							<description>DMA0 Read Register Select</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DATA0</name>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DDATA0</name>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DDATA0BIG</name>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>QDATA0</name>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMA1MODE</name>
							<description>DMA1 Read Mode</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>FULL</name>
									<description>Target register is fully read/written during every DMA transaction</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LENLIMIT</name>
									<description>Length Limited. When the current length, i.e. LENGTHA or LENGTHB indicates that there are less bytes available than the register size, only length + 1 bytes + necessary zero padding is read. Zero padding is automatically added when writing.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULLBYTE</name>
									<description>Target register is fully read/written during every DMA transaction. Bytewise DMA.</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LENLIMITBYTE</name>
									<description>Length Limited. When the current length, i.e. LENGTHA or LENGTHB indicates that there are less bytes available than the register size, only length + 1 bytes + necessary zero padding is read. Bytewise DMA. Zero padding is automatically added when writing.</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMA1RSEL</name>
							<description>DATA0 DMA Unaligned Read Register Select</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DATA1</name>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DDATA1</name>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>QDATA1</name>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>QDATA1BIG</name>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COMBDMA0WEREQ</name>
							<description>Combined Data0 Write DMA Request</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WAC</name>
					<description>Wide Arithmetic Configuration</description>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000F1F</resetMask>
					<fields>
						<field>
							<name>MODULUS</name>
							<description>Modular Operation Modulus</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>BIN256</name>
									<description>Generic modulus. p = 2^256</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BIN128</name>
									<description>Generic modulus. p = 2^128</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ECCBIN233P</name>
									<description>Modulus for B-233 and K-233 ECC curves. p(t) = t^233 + t^74 + 1</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ECCBIN163P</name>
									<description>Modulus for B-163 and K-163 ECC curves. p(t) = t^163 + t^7 + t^6 + t^3 + 1</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GCMBIN128</name>
									<description>Modulus for GCM. P(t) = t^128 + t^7 + t^2 + t + 1</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ECCPRIME256P</name>
									<description>Modulus for P-256 ECC curve. p = 2^256 - 2^224 + 2^192 + 2^96 - 1</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ECCPRIME224P</name>
									<description>Modulus for P-224 ECC curve. p = 2^224 - 2^96 - 1</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ECCPRIME192P</name>
									<description>Modulus for P-192 ECC curve. p = 2^192 - 2^64 - 1</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ECCBIN233N</name>
									<description>P modulus for B-233 ECC curve</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ECCBIN233KN</name>
									<description>P modulus for K-233 ECC curve</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ECCBIN163N</name>
									<description>P modulus for B-163 ECC curve</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ECCBIN163KN</name>
									<description>P modulus for K-163 ECC curve</description>
									<value>0x0000000B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ECCPRIME256N</name>
									<description>P modulus for P-256 ECC curve</description>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ECCPRIME224N</name>
									<description>P modulus for P-224 ECC curve</description>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ECCPRIME192N</name>
									<description>P modulus for P-192 ECC curve</description>
									<value>0x0000000E</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODOP</name>
							<description>Modular Operation Field Type</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MULWIDTH</name>
							<description>Multiply Width</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MUL256</name>
									<description>Multiply 256 bits</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MUL128</name>
									<description>Multiply 128 bits</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MULMOD</name>
									<description>Same number of bits as specified by MODULUS</description>
									<value>0x00000002</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESULTWIDTH</name>
							<description>Result Width</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>256BIT</name>
									<description>Results have 256 bits</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>128BIT</name>
									<description>Results have 128 bits</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>260BIT</name>
									<description>Results have 260 bits. Upper bits of result can be read through DDATA0MSBS in CRYPTO_STATUS</description>
									<value>0x00000002</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CMD</name>
					<description>Command Register</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000EFF</resetMask>
					<fields>
						<field>
							<name>INSTR</name>
							<description>Execute Instruction</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SEQSTART</name>
							<description>Encryption/Decryption SEQUENCE Start</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SEQSTOP</name>
							<description>Sequence Stop</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SEQSTEP</name>
							<description>Sequence Step</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Status Register</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>SEQRUNNING</name>
							<description>AES SEQUENCE Running</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INSTRRUNNING</name>
							<description>Action is Active</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DMAACTIVE</name>
							<description>DMA Action is Active</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DSTATUS</name>
					<description>Data Status Register</description>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x011F0F0F</resetMask>
					<fields>
						<field>
							<name>DATA0ZERO</name>
							<description>Data 0 Zero</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ZERO0TO31</name>
									<description>In DATA0 bits 0 to 31 are all zero.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ZERO32TO63</name>
									<description>In DATA0 bits 32 to 63 are all zero.</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ZERO64TO95</name>
									<description>In DATA0 bits 64 to 95 are all zero.</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ZERO96TO127</name>
									<description>In DATA0 bits 96 to 127 are all zero.</description>
									<value>0x00000008</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DDATA0LSBS</name>
							<description>LSBs in DDATA0</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DDATA0MSBS</name>
							<description>MSB in DDATA0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DDATA1MSB</name>
							<description>MSB in DDATA1</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CARRY</name>
							<description>Carry From Arithmetic Operation</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
