VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>CSTATUS</name>
					<description>Control Status Register</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000201</resetValue>
					<resetMask>0x01F30707</resetMask>
					<fields>
						<field>
							<name>V0</name>
							<description>Selected ALU Operand 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DDATA0</name>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DDATA1</name>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DDATA2</name>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DDATA3</name>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DDATA4</name>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DATA0</name>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DATA1</name>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DATA2</name>
									<value>0x00000007</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>V1</name>
							<description>Selected ALU Operand 1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DDATA0</name>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DDATA1</name>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DDATA2</name>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DDATA3</name>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DDATA4</name>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DATA0</name>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DATA1</name>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DATA2</name>
									<value>0x00000007</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEQPART</name>
							<description>Sequence Part</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SEQSKIP</name>
							<description>Sequence Skip Next Instruction</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SEQIP</name>
							<description>Sequence Next Instruction Pointer</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KEY</name>
					<description>KEY Register Access</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>KEY</name>
							<description>Key Access</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KEYBUF</name>
					<description>KEY Buffer Register Access</description>
					<addressOffset>0x024</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>KEYBUF</name>
							<description>Key Buffer Access</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SEQCTRL</name>
					<description>Sequence Control</description>
					<addressOffset>0x030</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xBF303FFF</resetMask>
					<fields>
						<field>
							<name>LENGTHA</name>
							<description>Buffer Length a in Bytes</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BLOCKSIZE</name>
							<description>Size of Data Blocks</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>16BYTES</name>
									<description>A block is 16 bytes long</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32BYTES</name>
									<description>A block is 32 bytes long</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>64BYTES</name>
									<description>A block is 64 bytes long</description>
									<value>0x00000002</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMA0SKIP</name>
							<description>DMA0 Skip</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMA1SKIP</name>
							<description>DMA1 Skip</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMA0PRESA</name>
							<description>DMA0 Preserve a</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMA1PRESA</name>
							<description>DMA1 Preserve a</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HALT</name>
							<description>Halt Sequence</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SEQCTRLB</name>
					<description>Sequence Control B</description>
					<addressOffset>0x034</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x30003FFF</resetMask>
					<fields>
						<field>
							<name>LENGTHB</name>
							<description>Buffer Length B in Bytes</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMA0PRESB</name>
							<description>DMA0 Preserve B</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMA1PRESB</name>
							<description>DMA1 Preserve B</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IF</name>
					<description>AES Interrupt Flags</description>
					<addressOffset>0x040</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>INSTRDONE</name>
							<description>Instruction Done</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SEQDONE</name>
							<description>Sequence Done</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFS</name>
					<description>Interrupt Flag Set Register</description>
					<addressOffset>0x044</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>INSTRDONE</name>
							<description>Set INSTRDONE Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SEQDONE</name>
							<description>Set SEQDONE Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFC</name>
					<description>Interrupt Flag Clear Register</description>
					<addressOffset>0x048</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>INSTRDONE</name>
							<description>Clear INSTRDONE Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SEQDONE</name>
							<description>Clear SEQDONE Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IEN</name>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x04C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>INSTRDONE</name>
							<description>INSTRDONE Interrupt Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SEQDONE</name>
							<description>SEQDONE Interrupt Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SEQ0</name>
					<description>Sequence Register 0</description>
					<addressOffset>0x050</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INSTR0</name>
							<description>Sequence Instruction 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INSTR1</name>
							<description>Sequence Instruction 1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INSTR2</name>
							<description>Sequence Instruction 2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INSTR3</name>
							<description>Sequence Instruction 3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SEQ1</name>
					<description>Sequence Register 1</description>
					<addressOffset>0x054</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INSTR4</name>
							<description>Sequence Instruction 4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INSTR5</name>
							<description>Sequence Instruction 5</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INSTR6</name>
							<description>Sequence Instruction 6</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INSTR7</name>
							<description>Sequence Instruction 7</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SEQ2</name>
					<description>Sequence Register 2</description>
					<addressOffset>0x058</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INSTR8</name>
							<description>Sequence Instruction 8</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INSTR9</name>
							<description>Sequence Instruction 9</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INSTR10</name>
							<description>Sequence Instruction 10</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INSTR11</name>
							<description>Sequence Instruction 11</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SEQ3</name>
					<description>Sequence Register 3</description>
					<addressOffset>0x05C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INSTR12</name>
							<description>Sequence Instruction 12</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INSTR13</name>
							<description>Sequence Instruction 13</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INSTR14</name>
							<description>Sequence Instruction 14</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INSTR15</name>
							<description>Sequence Instruction 15</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SEQ4</name>
					<description>Sequence Register 4</description>
					<addressOffset>0x060</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INSTR16</name>
							<description>Sequence Instruction 16</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INSTR17</name>
							<description>Sequence Instruction 17</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INSTR18</name>
							<description>Sequence Instruction 18</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INSTR19</name>
							<description>Sequence Instruction 19</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA0</name>
					<description>DATA0 Register Access</description>
					<addressOffset>0x080</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DATA0</name>
							<description>Data 0 Access</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA1</name>
					<description>DATA1 Register Access</description>
					<addressOffset>0x084</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DATA1</name>
							<description>Data 1 Access</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA2</name>
					<description>DATA2 Register Access</description>
					<addressOffset>0x088</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DATA2</name>
							<description>Data 2 Access</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA3</name>
					<description>DATA3 Register Access</description>
					<addressOffset>0x08C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DATA3</name>
							<description>Data 3 Access</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA0XOR</name>
					<description>DATA0XOR Register Access</description>
					<addressOffset>0x0A0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DATA0XOR</name>
							<description>XOR Data 0 Access</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA0BYTE</name>
					<description>DATA0 Register Byte Access</description>
					<addressOffset>0x0B0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DATA0BYTE</name>
							<description>Data 0 Byte Access</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA1BYTE</name>
					<description>DATA1 Register Byte Access</description>
					<addressOffset>0x0B4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DATA1BYTE</name>
							<description>Data 1 Byte Access</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA0XORBYTE</name>
					<description>DATA0 Register Byte XOR Access</description>
					<addressOffset>0x0BC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DATA0XORBYTE</name>
							<description>Data 0 XOR Byte Access</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA0BYTE12</name>
					<description>DATA0 Register Byte 12 Access</description>
					<addressOffset>0x0C0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA0BYTE12</name>
							<description>Data 0 Byte 12 Access</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA0BYTE13</name>
					<description>DATA0 Register Byte 13 Access</description>
					<addressOffset>0x0C4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA0BYTE13</name>
							<description>Data 0 Byte 13 Access</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA0BYTE14</name>
					<description>DATA0 Register Byte 14 Access</description>
					<addressOffset>0x0C8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA0BYTE14</name>
							<description>Data 0 Byte 14 Access</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA0BYTE15</name>
					<description>DATA0 Register Byte 15 Access</description>
					<addressOffset>0x0CC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA0BYTE15</name>
							<description>Data 0 Byte 15 Access</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DDATA0</name>
					<description>DDATA0 Register Access</description>
					<addressOffset>0x100</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DDATA0</name>
							<description>Double Data 0 Access</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
