VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDANDALTPULLUP</name>
									<description>Open-drain output using alternate control with pullup</description>
									<value>0x0000000E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDANDALTPULLUPFILTER</name>
									<description>Open-drain output using alternate control with filter and pullup</description>
									<value>0x0000000F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE14</name>
							<description>Pin 14 Mode</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Input disabled. Pullup if DOUT is set.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT</name>
									<description>Input enabled. Filter if DOUT is set</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUTPULL</name>
									<description>Input enabled. DOUT determines pull direction</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUTPULLFILTER</name>
									<description>Input enabled with filter. DOUT determines pull direction</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PUSHPULL</name>
									<description>Push-pull output</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PUSHPULLALT</name>
									<description>Push-pull using alternate control</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDOR</name>
									<description>Wired-or output</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDORPULLDOWN</name>
									<description>Wired-or output with pull-down</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDAND</name>
									<description>Open-drain output</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDANDFILTER</name>
									<description>Open-drain output with filter</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDANDPULLUP</name>
									<description>Open-drain output with pullup</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDANDPULLUPFILTER</name>
									<description>Open-drain output with filter and pullup</description>
									<value>0x0000000B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDANDALT</name>
									<description>Open-drain output using alternate control</description>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDANDALTFILTER</name>
									<description>Open-drain output using alternate control with filter</description>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDANDALTPULLUP</name>
									<description>Open-drain output using alternate control with pullup</description>
									<value>0x0000000E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDANDALTPULLUPFILTER</name>
									<description>Open-drain output using alternate control with filter and pullup</description>
									<value>0x0000000F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE15</name>
							<description>Pin 15 Mode</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Input disabled. Pullup if DOUT is set.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT</name>
									<description>Input enabled. Filter if DOUT is set</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUTPULL</name>
									<description>Input enabled. DOUT determines pull direction</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUTPULLFILTER</name>
									<description>Input enabled with filter. DOUT determines pull direction</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PUSHPULL</name>
									<description>Push-pull output</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PUSHPULLALT</name>
									<description>Push-pull using alternate control</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDOR</name>
									<description>Wired-or output</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDORPULLDOWN</name>
									<description>Wired-or output with pull-down</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDAND</name>
									<description>Open-drain output</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDANDFILTER</name>
									<description>Open-drain output with filter</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDANDPULLUP</name>
									<description>Open-drain output with pullup</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDANDPULLUPFILTER</name>
									<description>Open-drain output with filter and pullup</description>
									<value>0x0000000B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDANDALT</name>
									<description>Open-drain output using alternate control</description>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDANDALTFILTER</name>
									<description>Open-drain output using alternate control with filter</description>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDANDALTPULLUP</name>
									<description>Open-drain output using alternate control with pullup</description>
									<value>0x0000000E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WIREDANDALTPULLUPFILTER</name>
									<description>Open-drain output using alternate control with filter and pullup</description>
									<value>0x0000000F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PE_DOUT</name>
					<description>Port Data Out Register</description>
					<addressOffset>0x0CC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>DOUT</name>
							<description>Data Out</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PE_DOUTTGL</name>
					<description>Port Data Out Toggle Register</description>
					<addressOffset>0x0D8</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>DOUTTGL</name>
							<description>Data Out Toggle</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PE_DIN</name>
					<description>Port Data in Register</description>
					<addressOffset>0x0DC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>DIN</name>
							<description>Data in</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PE_PINLOCKN</name>
					<description>Port Unlocked Pins Register</description>
					<addressOffset>0x0E0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0000FFFF</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>PINLOCKN</name>
							<description>Unlocked Pins</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PE_OVTDIS</name>
					<description>Over Voltage Disable for All Modes</description>
					<addressOffset>0x0E8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>OVTDIS</name>
							<description>Disable Over Voltage Capability</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PF_CTRL</name>
					<description>Port Control Register</description>
					<addressOffset>0x0F0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00500050</resetValue>
					<resetMask>0x10711071</resetMask>
					<fields>
						<field>
							<name>DRIVESTRENGTH</name>
							<description>Drive Strength for Port</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SLEWRATE</name>
							<description>Slewrate Limit for Port</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DINDIS</name>
							<description>Data in Disable</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRIVESTRENGTHALT</name>
							<description>Alternate Drive Strength for Port</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SLEWRATEALT</name>
							<description>Alternate Slewrate Limit for Port</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DINDISALT</name>
							<description>Alternate Data in Disable</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
