VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>EXTIPSELH</name>
					<description>External Interrupt Port Select High Register</description>
					<addressOffset>0x404</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EXTIPSEL8</name>
							<description>External Interrupt 8 Port Select</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PORTA</name>
									<description>Port A group selected for external interrupt 8</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTB</name>
									<description>Port B group selected for external interrupt 8</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTC</name>
									<description>Port C group selected for external interrupt 8</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTD</name>
									<description>Port D group selected for external interrupt 8</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTF</name>
									<description>Port F group selected for external interrupt 8</description>
									<value>0x00000005</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPSEL9</name>
							<description>External Interrupt 9 Port Select</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PORTA</name>
									<description>Port A group selected for external interrupt 9</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTB</name>
									<description>Port B group selected for external interrupt 9</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTC</name>
									<description>Port C group selected for external interrupt 9</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTD</name>
									<description>Port D group selected for external interrupt 9</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTF</name>
									<description>Port F group selected for external interrupt 9</description>
									<value>0x00000005</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPSEL10</name>
							<description>External Interrupt 10 Port Select</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PORTA</name>
									<description>Port A group selected for external interrupt 10</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTB</name>
									<description>Port B group selected for external interrupt 10</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTC</name>
									<description>Port C group selected for external interrupt 10</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTD</name>
									<description>Port D group selected for external interrupt 10</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTF</name>
									<description>Port F group selected for external interrupt 10</description>
									<value>0x00000005</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPSEL11</name>
							<description>External Interrupt 11 Port Select</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PORTA</name>
									<description>Port A group selected for external interrupt 11</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTB</name>
									<description>Port B group selected for external interrupt 11</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTC</name>
									<description>Port C group selected for external interrupt 11</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTD</name>
									<description>Port D group selected for external interrupt 11</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTF</name>
									<description>Port F group selected for external interrupt 11</description>
									<value>0x00000005</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPSEL12</name>
							<description>External Interrupt 12 Port Select</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PORTA</name>
									<description>Port A group selected for external interrupt 12</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTB</name>
									<description>Port B group selected for external interrupt 12</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTC</name>
									<description>Port C group selected for external interrupt 12</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTD</name>
									<description>Port D group selected for external interrupt 12</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTF</name>
									<description>Port F group selected for external interrupt 12</description>
									<value>0x00000005</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPSEL13</name>
							<description>External Interrupt 13 Port Select</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PORTA</name>
									<description>Port A group selected for external interrupt 13</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTB</name>
									<description>Port B group selected for external interrupt 13</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTC</name>
									<description>Port C group selected for external interrupt 13</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTD</name>
									<description>Port D group selected for external interrupt 13</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTF</name>
									<description>Port F group selected for external interrupt 13</description>
									<value>0x00000005</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPSEL14</name>
							<description>External Interrupt 14 Port Select</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PORTA</name>
									<description>Port A group selected for external interrupt 14</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTB</name>
									<description>Port B group selected for external interrupt 14</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTC</name>
									<description>Port C group selected for external interrupt 14</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTD</name>
									<description>Port D group selected for external interrupt 14</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTF</name>
									<description>Port F group selected for external interrupt 14</description>
									<value>0x00000005</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPSEL15</name>
							<description>External Interrupt 15 Port Select</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PORTA</name>
									<description>Port A group selected for external interrupt 15</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTB</name>
									<description>Port B group selected for external interrupt 15</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTC</name>
									<description>Port C group selected for external interrupt 15</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTD</name>
									<description>Port D group selected for external interrupt 15</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORTF</name>
									<description>Port F group selected for external interrupt 15</description>
									<value>0x00000005</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTIPINSELL</name>
					<description>External Interrupt Pin Select Low Register</description>
					<addressOffset>0x408</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x32103210</resetValue>
					<resetMask>0x33333333</resetMask>
					<fields>
						<field>
							<name>EXTIPINSEL0</name>
							<description>External Interrupt 0 Pin Select</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PIN0</name>
									<description>Pin 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN1</name>
									<description>Pin 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN2</name>
									<description>Pin 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN3</name>
									<description>Pin 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPINSEL1</name>
							<description>External Interrupt 1 Pin Select</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PIN0</name>
									<description>Pin 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN1</name>
									<description>Pin 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN2</name>
									<description>Pin 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN3</name>
									<description>Pin 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPINSEL2</name>
							<description>External Interrupt 2 Pin Select</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PIN0</name>
									<description>Pin 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN1</name>
									<description>Pin 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN2</name>
									<description>Pin 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN3</name>
									<description>Pin 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPINSEL3</name>
							<description>External Interrupt 3 Pin Select</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PIN0</name>
									<description>Pin 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN1</name>
									<description>Pin 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN2</name>
									<description>Pin 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN3</name>
									<description>Pin 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPINSEL4</name>
							<description>External Interrupt 4 Pin Select</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PIN4</name>
									<description>Pin 4</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN5</name>
									<description>Pin 5</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN6</name>
									<description>Pin 6</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN7</name>
									<description>Pin 7</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPINSEL5</name>
							<description>External Interrupt 5 Pin Select</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PIN4</name>
									<description>Pin 4</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN5</name>
									<description>Pin 5</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN6</name>
									<description>Pin 6</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN7</name>
									<description>Pin 7</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPINSEL6</name>
							<description>External Interrupt 6 Pin Select</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PIN4</name>
									<description>Pin 4</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN5</name>
									<description>Pin 5</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN6</name>
									<description>Pin 6</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN7</name>
									<description>Pin 7</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPINSEL7</name>
							<description>External Interrupt 7 Pin Select</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PIN4</name>
									<description>Pin 4</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN5</name>
									<description>Pin 5</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN6</name>
									<description>Pin 6</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN7</name>
									<description>Pin 7</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
