VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>EXTIPINSELH</name>
					<description>External Interrupt Pin Select High Register</description>
					<addressOffset>0x40C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x32103210</resetValue>
					<resetMask>0x33333333</resetMask>
					<fields>
						<field>
							<name>EXTIPINSEL8</name>
							<description>External Interrupt 8 Pin Select</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PIN8</name>
									<description>Pin 8</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN9</name>
									<description>Pin 9</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN10</name>
									<description>Pin 10</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN11</name>
									<description>Pin 11</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPINSEL9</name>
							<description>External Interrupt 9 Pin Select</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PIN8</name>
									<description>Pin 8</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN9</name>
									<description>Pin 9</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN10</name>
									<description>Pin 10</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN11</name>
									<description>Pin 11</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPINSEL10</name>
							<description>External Interrupt 10 Pin Select</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PIN8</name>
									<description>Pin 8</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN9</name>
									<description>Pin 9</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN10</name>
									<description>Pin 10</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN11</name>
									<description>Pin 11</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPINSEL11</name>
							<description>External Interrupt 11 Pin Select</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PIN8</name>
									<description>Pin 8</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN9</name>
									<description>Pin 9</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN10</name>
									<description>Pin 10</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN11</name>
									<description>Pin 11</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPINSEL12</name>
							<description>External Interrupt 12 Pin Select</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PIN12</name>
									<description>Pin 12</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN13</name>
									<description>Pin 13</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN14</name>
									<description>Pin 14</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN15</name>
									<description>Pin 15</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPINSEL13</name>
							<description>External Interrupt 13 Pin Select</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PIN12</name>
									<description>Pin 12</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN13</name>
									<description>Pin 13</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN14</name>
									<description>Pin 14</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN15</name>
									<description>Pin 15</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPINSEL14</name>
							<description>External Interrupt 14 Pin Select</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PIN12</name>
									<description>Pin 12</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN13</name>
									<description>Pin 13</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN14</name>
									<description>Pin 14</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN15</name>
									<description>Pin 15</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTIPINSEL15</name>
							<description>External Interrupt 15 Pin Select</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PIN12</name>
									<description>Pin 12</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN13</name>
									<description>Pin 13</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN14</name>
									<description>Pin 14</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PIN15</name>
									<description>Pin 15</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTIRISE</name>
					<description>External Interrupt Rising Edge Trigger Register</description>
					<addressOffset>0x410</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>EXTIRISE</name>
							<description>External Interrupt N Rising Edge Trigger Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTIFALL</name>
					<description>External Interrupt Falling Edge Trigger Register</description>
					<addressOffset>0x414</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>EXTIFALL</name>
							<description>External Interrupt N Falling Edge Trigger Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTILEVEL</name>
					<description>External Interrupt Level Register</description>
					<addressOffset>0x418</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x13130000</resetMask>
					<fields>
						<field>
							<name>EM4WU0</name>
							<description>EM4 Wake Up Level for EM4WU0 Pin</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EM4WU1</name>
							<description>EM4 Wake Up Level for EM4WU1 Pin</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EM4WU4</name>
							<description>EM4 Wake Up Level for EM4WU4 Pin</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EM4WU8</name>
							<description>EM4 Wake Up Level for EM4WU8 Pin</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EM4WU9</name>
							<description>EM4 Wake Up Level for EM4WU9 Pin</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EM4WU12</name>
							<description>EM4 Wake Up Level for EM4WU12 Pin</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IF</name>
					<description>Interrupt Flag Register</description>
					<addressOffset>0x41C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EXT</name>
							<description>External Pin Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EM4WU</name>
							<description>EM4 Wake Up Pin Interrupt Flag</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFS</name>
					<description>Interrupt Flag Set Register</description>
					<addressOffset>0x420</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EXT</name>
							<description>Set EXT Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EM4WU</name>
							<description>Set EM4WU Interrupt Flag</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFC</name>
					<description>Interrupt Flag Clear Register</description>
					<addressOffset>0x424</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EXT</name>
							<description>Clear EXT Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EM4WU</name>
							<description>Clear EM4WU Interrupt Flag</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IEN</name>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x428</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EXT</name>
							<description>EXT Interrupt Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EM4WU</name>
							<description>EM4WU Interrupt Enable</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EM4WUEN</name>
					<description>EM4 Wake Up Enable Register</description>
					<addressOffset>0x42C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFF0000</resetMask>
					<fields>
						<field>
							<name>EM4WUEN</name>
							<description>EM4 Wake Up Enable</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ROUTEPEN</name>
					<description>I/O Routing Pin Enable Register</description>
					<addressOffset>0x440</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0000000F</resetValue>
					<resetMask>0x0000001F</resetMask>
					<fields>
						<field>
							<name>SWCLKTCKPEN</name>
							<description>Serial Wire Clock and JTAG Test Clock Pin Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWDIOTMSPEN</name>
							<description>Serial Wire Data and JTAG Test Mode Select Pin Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TDOPEN</name>
							<description>JTAG Test Debug Output Pin Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TDIPEN</name>
							<description>JTAG Test Debug Input Pin Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWVPEN</name>
							<description>Serial Wire Viewer Output Pin Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ROUTELOC0</name>
					<description>I/O Routing Location Register</description>
					<addressOffset>0x444</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>SWVLOC</name>
							<description>I/O Location</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOC0</name>
									<description>Location 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC1</name>
									<description>Location 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC2</name>
									<description>Location 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC3</name>
									<description>Location 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>INSENSE</name>
					<description>Input Sense Register</description>
					<addressOffset>0x450</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000003</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>INT</name>
							<description>Interrupt Sense Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EM4WU</name>
							<description>EM4WU Interrupt Sense Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LOCK</name>
					<description>Configuration Lock Register</description>
					<addressOffset>0x454</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>LOCKKEY</name>
							<description>Configuration Lock Key</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<value>0x00000001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
