VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PRS</name>
			<description>PRS</description>
			<baseAddress>0x400E6000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x00000400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>SWPULSE</name>
					<description>Software Pulse Register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000FFF</resetMask>
					<fields>
						<field>
							<name>CH0PULSE</name>
							<description>Channel 0 Pulse Generation</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CH1PULSE</name>
							<description>Channel 1 Pulse Generation</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CH2PULSE</name>
							<description>Channel 2 Pulse Generation</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CH3PULSE</name>
							<description>Channel 3 Pulse Generation</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CH4PULSE</name>
							<description>Channel 4 Pulse Generation</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CH5PULSE</name>
							<description>Channel 5 Pulse Generation</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CH6PULSE</name>
							<description>Channel 6 Pulse Generation</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CH7PULSE</name>
							<description>Channel 7 Pulse Generation</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CH8PULSE</name>
							<description>Channel 8 Pulse Generation</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CH9PULSE</name>
							<description>Channel 9 Pulse Generation</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CH10PULSE</name>
							<description>Channel 10 Pulse Generation</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CH11PULSE</name>
							<description>Channel 11 Pulse Generation</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWLEVEL</name>
					<description>Software Level Register</description>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000FFF</resetMask>
					<fields>
						<field>
							<name>CH0LEVEL</name>
							<description>Channel 0 Software Level</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH1LEVEL</name>
							<description>Channel 1 Software Level</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH2LEVEL</name>
							<description>Channel 2 Software Level</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH3LEVEL</name>
							<description>Channel 3 Software Level</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH4LEVEL</name>
							<description>Channel 4 Software Level</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH5LEVEL</name>
							<description>Channel 5 Software Level</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH6LEVEL</name>
							<description>Channel 6 Software Level</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH7LEVEL</name>
							<description>Channel 7 Software Level</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH8LEVEL</name>
							<description>Channel 8 Software Level</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH9LEVEL</name>
							<description>Channel 9 Software Level</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH10LEVEL</name>
							<description>Channel 10 Software Level</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH11LEVEL</name>
							<description>Channel 11 Software Level</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ROUTEPEN</name>
					<description>I/O Routing Pin Enable Register</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000FFF</resetMask>
					<fields>
						<field>
							<name>CH0PEN</name>
							<description>CH0 Pin Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH1PEN</name>
							<description>CH1 Pin Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH2PEN</name>
							<description>CH2 Pin Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH3PEN</name>
							<description>CH3 Pin Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH4PEN</name>
							<description>CH4 Pin Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH5PEN</name>
							<description>CH5 Pin Enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH6PEN</name>
							<description>CH6 Pin Enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH7PEN</name>
							<description>CH7 Pin Enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH8PEN</name>
							<description>CH8 Pin Enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH9PEN</name>
							<description>CH9 Pin Enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH10PEN</name>
							<description>CH10 Pin Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CH11PEN</name>
							<description>CH11 Pin Enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ROUTELOC0</name>
					<description>I/O Routing Location Register</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x3F3F3F3F</resetMask>
					<fields>
						<field>
							<name>CH0LOC</name>
							<description>I/O Location</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOC0</name>
									<description>Location 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC1</name>
									<description>Location 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC2</name>
									<description>Location 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC3</name>
									<description>Location 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC4</name>
									<description>Location 4</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC5</name>
									<description>Location 5</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC6</name>
									<description>Location 6</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC7</name>
									<description>Location 7</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC8</name>
									<description>Location 8</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC9</name>
									<description>Location 9</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC10</name>
									<description>Location 10</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC11</name>
									<description>Location 11</description>
									<value>0x0000000B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC12</name>
									<description>Location 12</description>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC13</name>
									<description>Location 13</description>
									<value>0x0000000D</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH1LOC</name>
							<description>I/O Location</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOC0</name>
									<description>Location 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC1</name>
									<description>Location 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC2</name>
									<description>Location 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC3</name>
									<description>Location 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC4</name>
									<description>Location 4</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC5</name>
									<description>Location 5</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC6</name>
									<description>Location 6</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC7</name>
									<description>Location 7</description>
									<value>0x00000007</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH2LOC</name>
							<description>I/O Location</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOC0</name>
									<description>Location 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC1</name>
									<description>Location 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC2</name>
									<description>Location 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC3</name>
									<description>Location 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC4</name>
									<description>Location 4</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC5</name>
									<description>Location 5</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC6</name>
									<description>Location 6</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC7</name>
									<description>Location 7</description>
									<value>0x00000007</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH3LOC</name>
							<description>I/O Location</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOC0</name>
									<description>Location 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC1</name>
									<description>Location 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC2</name>
									<description>Location 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC3</name>
									<description>Location 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC4</name>
									<description>Location 4</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC5</name>
									<description>Location 5</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC6</name>
									<description>Location 6</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC7</name>
									<description>Location 7</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC8</name>
									<description>Location 8</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC9</name>
									<description>Location 9</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC10</name>
									<description>Location 10</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC11</name>
									<description>Location 11</description>
									<value>0x0000000B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC12</name>
									<description>Location 12</description>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC13</name>
									<description>Location 13</description>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC14</name>
									<description>Location 14</description>
									<value>0x0000000E</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
