VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>ROUTELOC1</name>
					<description>I/O Routing Location Register</description>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x3F3F3F3F</resetMask>
					<fields>
						<field>
							<name>CH4LOC</name>
							<description>I/O Location</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOC0</name>
									<description>Location 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC1</name>
									<description>Location 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC2</name>
									<description>Location 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC3</name>
									<description>Location 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC4</name>
									<description>Location 4</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC5</name>
									<description>Location 5</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC6</name>
									<description>Location 6</description>
									<value>0x00000006</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH5LOC</name>
							<description>I/O Location</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOC0</name>
									<description>Location 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC1</name>
									<description>Location 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC2</name>
									<description>Location 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC3</name>
									<description>Location 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC4</name>
									<description>Location 4</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC5</name>
									<description>Location 5</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC6</name>
									<description>Location 6</description>
									<value>0x00000006</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH6LOC</name>
							<description>I/O Location</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOC0</name>
									<description>Location 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC1</name>
									<description>Location 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC2</name>
									<description>Location 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC3</name>
									<description>Location 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC4</name>
									<description>Location 4</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC5</name>
									<description>Location 5</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC6</name>
									<description>Location 6</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC7</name>
									<description>Location 7</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC8</name>
									<description>Location 8</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC9</name>
									<description>Location 9</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC10</name>
									<description>Location 10</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC11</name>
									<description>Location 11</description>
									<value>0x0000000B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC12</name>
									<description>Location 12</description>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC13</name>
									<description>Location 13</description>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC14</name>
									<description>Location 14</description>
									<value>0x0000000E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC15</name>
									<description>Location 15</description>
									<value>0x0000000F</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC16</name>
									<description>Location 16</description>
									<value>0x00000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC17</name>
									<description>Location 17</description>
									<value>0x00000011</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH7LOC</name>
							<description>I/O Location</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOC0</name>
									<description>Location 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC1</name>
									<description>Location 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC2</name>
									<description>Location 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC3</name>
									<description>Location 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC4</name>
									<description>Location 4</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC5</name>
									<description>Location 5</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC6</name>
									<description>Location 6</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC7</name>
									<description>Location 7</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC8</name>
									<description>Location 8</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC9</name>
									<description>Location 9</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC10</name>
									<description>Location 10</description>
									<value>0x0000000A</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ROUTELOC2</name>
					<description>I/O Routing Location Register</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x3F3F3F3F</resetMask>
					<fields>
						<field>
							<name>CH8LOC</name>
							<description>I/O Location</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOC0</name>
									<description>Location 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC1</name>
									<description>Location 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC2</name>
									<description>Location 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC3</name>
									<description>Location 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC4</name>
									<description>Location 4</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC5</name>
									<description>Location 5</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC6</name>
									<description>Location 6</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC7</name>
									<description>Location 7</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC8</name>
									<description>Location 8</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC9</name>
									<description>Location 9</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC10</name>
									<description>Location 10</description>
									<value>0x0000000A</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH9LOC</name>
							<description>I/O Location</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOC0</name>
									<description>Location 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC1</name>
									<description>Location 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC2</name>
									<description>Location 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC3</name>
									<description>Location 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC4</name>
									<description>Location 4</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC5</name>
									<description>Location 5</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC6</name>
									<description>Location 6</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC7</name>
									<description>Location 7</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC8</name>
									<description>Location 8</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC9</name>
									<description>Location 9</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC10</name>
									<description>Location 10</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC11</name>
									<description>Location 11</description>
									<value>0x0000000B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC12</name>
									<description>Location 12</description>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC13</name>
									<description>Location 13</description>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC14</name>
									<description>Location 14</description>
									<value>0x0000000E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC15</name>
									<description>Location 15</description>
									<value>0x0000000F</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC16</name>
									<description>Location 16</description>
									<value>0x00000010</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH10LOC</name>
							<description>I/O Location</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOC0</name>
									<description>Location 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC1</name>
									<description>Location 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC2</name>
									<description>Location 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC3</name>
									<description>Location 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC4</name>
									<description>Location 4</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC5</name>
									<description>Location 5</description>
									<value>0x00000005</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH11LOC</name>
							<description>I/O Location</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOC0</name>
									<description>Location 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC1</name>
									<description>Location 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC2</name>
									<description>Location 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC3</name>
									<description>Location 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC4</name>
									<description>Location 4</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC5</name>
									<description>Location 5</description>
									<value>0x00000005</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL</name>
					<description>Control Register</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000001F</resetMask>
					<fields>
						<field>
							<name>SEVONPRS</name>
							<description>Set Event on PRS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SEVONPRSSEL</name>
							<description>SEVONPRS PRS Channel Select</description>
							<bitOffset>1</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PRSCH0</name>
									<description>PRS Channel 0 selected</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH1</name>
									<description>PRS Channel 1 selected</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH2</name>
									<description>PRS Channel 2 selected</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH3</name>
									<description>PRS Channel 3 selected</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH4</name>
									<description>PRS Channel 4 selected</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH5</name>
									<description>PRS Channel 5 selected</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH6</name>
									<description>PRS Channel 6 selected</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH7</name>
									<description>PRS Channel 7 selected</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH8</name>
									<description>PRS Channel 8 selected</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH9</name>
									<description>PRS Channel 9 selected</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH10</name>
									<description>PRS Channel 10 selected</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH11</name>
									<description>PRS Channel 11 selected</description>
									<value>0x0000000B</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAREQ0</name>
					<description>DMA Request 0 Register</description>
					<addressOffset>0x024</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000003C0</resetMask>
					<fields>
						<field>
							<name>PRSSEL</name>
							<description>DMA Request 0 PRS Channel Select</description>
							<bitOffset>6</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PRSCH0</name>
									<description>PRS Channel 0 selected</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH1</name>
									<description>PRS Channel 1 selected</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH2</name>
									<description>PRS Channel 2 selected</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH3</name>
									<description>PRS Channel 3 selected</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH4</name>
									<description>PRS Channel 4 selected</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH5</name>
									<description>PRS Channel 5 selected</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH6</name>
									<description>PRS Channel 6 selected</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH7</name>
									<description>PRS Channel 7 selected</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH8</name>
									<description>PRS Channel 8 selected</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH9</name>
									<description>PRS Channel 9 selected</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH10</name>
									<description>PRS Channel 10 selected</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH11</name>
									<description>PRS Channel 11 selected</description>
									<value>0x0000000B</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
