VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>LDMA</name>
			<description>LDMA</description>
			<baseAddress>0x400E2000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x00001000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>LDMA</name>
				<value>8</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>DMA Control Register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x07000000</resetValue>
					<resetMask>0x0700FFFF</resetMask>
					<fields>
						<field>
							<name>SYNCPRSSETEN</name>
							<description>Synchronization PRS Set Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNCPRSCLREN</name>
							<description>Synchronization PRS Clear Enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NUMFIXED</name>
							<description>Number of Fixed Priority Channels</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>DMA Status Register</description>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x08100000</resetValue>
					<resetMask>0x1F1F073B</resetMask>
					<fields>
						<field>
							<name>ANYBUSY</name>
							<description>Any DMA Channel Busy</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ANYREQ</name>
							<description>Any DMA Channel Request Pending</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHGRANT</name>
							<description>Granted Channel Number</description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHERROR</name>
							<description>Errant Channel Number</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FIFOLEVEL</name>
							<description>FIFO Level</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNUM</name>
							<description>Number of Channels</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYNC</name>
					<description>DMA Synchronization Trigger Register (Single-Cycle RMW)</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>SYNCTRIG</name>
							<description>Synchronization Trigger</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHEN</name>
					<description>DMA Channel Enable Register (Single-Cycle RMW)</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>CHEN</name>
							<description>Channel Enables</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHBUSY</name>
					<description>DMA Channel Busy Register</description>
					<addressOffset>0x024</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>BUSY</name>
							<description>Channels Busy</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHDONE</name>
					<description>DMA Channel Linking Done Register (Single-Cycle RMW)</description>
					<addressOffset>0x028</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>CHDONE</name>
							<description>DMA Channel Linking or Done</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DBGHALT</name>
					<description>DMA Channel Debug Halt Register</description>
					<addressOffset>0x02C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DBGHALT</name>
							<description>DMA Debug Halt</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWREQ</name>
					<description>DMA Channel Software Transfer Request Register</description>
					<addressOffset>0x030</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>SWREQ</name>
							<description>Software Transfer Requests</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REQDIS</name>
					<description>DMA Channel Request Disable Register</description>
					<addressOffset>0x034</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>REQDIS</name>
							<description>DMA Request Disables</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REQPEND</name>
					<description>DMA Channel Requests Pending Register</description>
					<addressOffset>0x038</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>REQPEND</name>
							<description>DMA Requests Pending</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LINKLOAD</name>
					<description>DMA Channel Link Load Register</description>
					<addressOffset>0x03C</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>LINKLOAD</name>
							<description>DMA Link Loads</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REQCLEAR</name>
					<description>DMA Channel Request Clear Register</description>
					<addressOffset>0x040</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>REQCLEAR</name>
							<description>DMA Request Clear</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IF</name>
					<description>Interrupt Flag Register</description>
					<addressOffset>0x060</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x800000FF</resetMask>
					<fields>
						<field>
							<name>DONE</name>
							<description>DMA Structure Operation Done Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERROR</name>
							<description>Transfer Error Interrupt Flag</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFS</name>
					<description>Interrupt Flag Set Register</description>
					<addressOffset>0x064</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x800000FF</resetMask>
					<fields>
						<field>
							<name>DONE</name>
							<description>Set DONE Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ERROR</name>
							<description>Set ERROR Interrupt Flag</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFC</name>
					<description>Interrupt Flag Clear Register</description>
					<addressOffset>0x068</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x800000FF</resetMask>
					<fields>
						<field>
							<name>DONE</name>
							<description>Clear DONE Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ERROR</name>
							<description>Clear ERROR Interrupt Flag</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IEN</name>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x06C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x800000FF</resetMask>
					<fields>
						<field>
							<name>DONE</name>
							<description>DONE Interrupt Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ERROR</name>
							<description>ERROR Interrupt Enable</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CH0_REQSEL</name>
					<description>Channel Peripheral Request Select Register</description>
					<addressOffset>0x080</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x003F000F</resetMask>
					<fields>
						<field>
							<name>SIGSEL</name>
							<description>Signal Select</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SOURCESEL</name>
							<description>Source Select</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>No source selected</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRS</name>
									<description>Peripheral Reflex System</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC0</name>
									<description>Analog to Digital Converter 0</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USART0</name>
									<description>Universal Synchronous/Asynchronous Receiver/Transmitter 0</description>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USART1</name>
									<description>Universal Synchronous/Asynchronous Receiver/Transmitter 1</description>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEUART0</name>
									<description>Low Energy UART 0</description>
									<value>0x00000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C0</name>
									<description>I2C 0</description>
									<value>0x00000014</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER0</name>
									<description>Timer 0</description>
									<value>0x00000018</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER1</name>
									<description>Timer 1</description>
									<value>0x00000019</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MSC</name>
									<description>Memory System Controller</description>
									<value>0x00000030</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CRYPTO</name>
									<description>Advanced Encryption Standard Accelerator</description>
									<value>0x00000031</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CH0_CFG</name>
					<description>Channel Configuration Register</description>
					<addressOffset>0x084</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00330000</resetMask>
					<fields>
						<field>
							<name>ARBSLOTS</name>
							<description>Arbitration Slot Number Select</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ONE</name>
									<description>One arbitration slot selected</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWO</name>
									<description>Two arbitration slots selected</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FOUR</name>
									<description>Four arbitration slots selected</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EIGHT</name>
									<description>Eight arbitration slots selected</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRCINCSIGN</name>
							<description>Source Address Increment Sign</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DSTINCSIGN</name>
							<description>Destination Address Increment Sign</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CH0_LOOP</name>
					<description>Channel Loop Counter Register</description>
					<addressOffset>0x088</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>LOOPCNT</name>
							<description>Linked Structure Sequence Loop Counter</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
