VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>CH5_CTRL</name>
					<description>Channel Descriptor Control Word Register</description>
					<addressOffset>0x17C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFB</resetMask>
					<fields>
						<field>
							<name>STRUCTTYPE</name>
							<description>DMA Structure Type</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>TRANSFER</name>
									<description>DMA transfer structure type selected.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYNCHRONIZE</name>
									<description>Synchronization structure type selected.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WRITE</name>
									<description>Write immediate value structure type selected.</description>
									<value>0x00000002</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STRUCTREQ</name>
							<description>Structure DMA Transfer Request</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>XFERCNT</name>
							<description>DMA Unit Data Transfer Count</description>
							<bitOffset>4</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BYTESWAP</name>
							<description>Endian Byte Swap</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BLOCKSIZE</name>
							<description>Block Transfer Size</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNIT1</name>
									<description>One unit transfer per arbitration</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNIT2</name>
									<description>Two unit transfers per arbitration</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNIT3</name>
									<description>Three unit transfers per arbitration</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNIT4</name>
									<description>Four unit transfers per arbitration</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNIT6</name>
									<description>Six unit transfers per arbitration</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNIT8</name>
									<description>Eight unit transfers per arbitration</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNIT16</name>
									<description>Sixteen unit transfers per arbitration</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNIT32</name>
									<description>32 unit transfers per arbitration</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNIT64</name>
									<description>64 unit transfers per arbitration</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNIT128</name>
									<description>128 unit transfers per arbitration</description>
									<value>0x0000000B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNIT256</name>
									<description>256 unit transfers per arbitration</description>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNIT512</name>
									<description>512 unit transfers per arbitration</description>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNIT1024</name>
									<description>1024 unit transfers per arbitration</description>
									<value>0x0000000E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ALL</name>
									<description>Transfer all units as specified by the XFRCNT field</description>
									<value>0x0000000F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DONEIFSEN</name>
							<description>DMA Operation Done Interrupt Flag Set Enable</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REQMODE</name>
							<description>DMA Request Transfer Mode Select</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DECLOOPCNT</name>
							<description>Decrement Loop Count</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IGNORESREQ</name>
							<description>Ignore Sreq</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRCINC</name>
							<description>Source Address Increment Size</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ONE</name>
									<description>Increment source address by one unit data size after each read</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWO</name>
									<description>Increment source address by two unit data sizes after each read</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FOUR</name>
									<description>Increment source address by four unit data sizes after each read</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NONE</name>
									<description>Do not increment the source address. In this mode reads are made from a fixed source address, for example reading FIFO.</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SIZE</name>
							<description>Unit Data Transfer Size</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>BYTE</name>
									<description>Each unit transfer is a byte</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALFWORD</name>
									<description>Each unit transfer is a half-word</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WORD</name>
									<description>Each unit transfer is a word</description>
									<value>0x00000002</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DSTINC</name>
							<description>Destination Address Increment Size</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ONE</name>
									<description>Increment destination address by one unit data size after each write</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWO</name>
									<description>Increment destination address by two unit data sizes after each write</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FOUR</name>
									<description>Increment destination address by four unit data sizes after each write</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NONE</name>
									<description>Do not increment the destination address. Writes are made to a fixed destination address, for example writing to a FIFO.</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRCMODE</name>
							<description>Source Addressing Mode</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DSTMODE</name>
							<description>Destination Addressing Mode</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CH5_SRC</name>
					<description>Channel Descriptor Source Data Address Register</description>
					<addressOffset>0x180</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SRCADDR</name>
							<description>Source Data Address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CH5_DST</name>
					<description>Channel Descriptor Destination Data Address Register</description>
					<addressOffset>0x184</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DSTADDR</name>
							<description>Destination Data Address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CH5_LINK</name>
					<description>Channel Descriptor Link Structure Address Register</description>
					<addressOffset>0x188</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LINKMODE</name>
							<description>Link Structure Addressing Mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LINK</name>
							<description>Link Next Structure</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LINKADDR</name>
							<description>Link Structure Address</description>
							<bitOffset>2</bitOffset>
							<bitWidth>30</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CH6_REQSEL</name>
					<description>Channel Peripheral Request Select Register</description>
					<addressOffset>0x1A0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x003F000F</resetMask>
					<fields>
						<field>
							<name>SIGSEL</name>
							<description>Signal Select</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SOURCESEL</name>
							<description>Source Select</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>No source selected</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRS</name>
									<description>Peripheral Reflex System</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC0</name>
									<description>Analog to Digital Converter 0</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USART0</name>
									<description>Universal Synchronous/Asynchronous Receiver/Transmitter 0</description>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USART1</name>
									<description>Universal Synchronous/Asynchronous Receiver/Transmitter 1</description>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEUART0</name>
									<description>Low Energy UART 0</description>
									<value>0x00000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C0</name>
									<description>I2C 0</description>
									<value>0x00000014</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER0</name>
									<description>Timer 0</description>
									<value>0x00000018</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER1</name>
									<description>Timer 1</description>
									<value>0x00000019</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MSC</name>
									<description>Memory System Controller</description>
									<value>0x00000030</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CRYPTO</name>
									<description>Advanced Encryption Standard Accelerator</description>
									<value>0x00000031</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CH6_CFG</name>
					<description>Channel Configuration Register</description>
					<addressOffset>0x1A4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00330000</resetMask>
					<fields>
						<field>
							<name>ARBSLOTS</name>
							<description>Arbitration Slot Number Select</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ONE</name>
									<description>One arbitration slot selected</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWO</name>
									<description>Two arbitration slots selected</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FOUR</name>
									<description>Four arbitration slots selected</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EIGHT</name>
									<description>Eight arbitration slots selected</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRCINCSIGN</name>
							<description>Source Address Increment Sign</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DSTINCSIGN</name>
							<description>Destination Address Increment Sign</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CH6_LOOP</name>
					<description>Channel Loop Counter Register</description>
					<addressOffset>0x1A8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>LOOPCNT</name>
							<description>Linked Structure Sequence Loop Counter</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
