VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>FPUEH</name>
			<description>FPUEH</description>
			<baseAddress>0x400E1000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x00000400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>FPUEH</name>
				<value>33</value>
			</interrupt>
			<registers>
				<register>
					<name>IF</name>
					<description>Interrupt Flag Register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>FPIOC</name>
							<description>FPU invalid operation</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FPDZC</name>
							<description>FPU divide-by-zero exception</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FPUFC</name>
							<description>FPU underflow exception</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FPOFC</name>
							<description>FPU overflow exception</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FPIDC</name>
							<description>FPU input denormal exception</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FPIXC</name>
							<description>FPU inexact exception</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFS</name>
					<description>Interrupt Flag Set Register</description>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>FPIOC</name>
							<description>Set FPIOC Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FPDZC</name>
							<description>Set FPDZC Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FPUFC</name>
							<description>Set FPUFC Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FPOFC</name>
							<description>Set FPOFC Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FPIDC</name>
							<description>Set FPIDC Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FPIXC</name>
							<description>Set FPIXC Interrupt Flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFC</name>
					<description>Interrupt Flag Clear Register</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>FPIOC</name>
							<description>Clear FPIOC Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FPDZC</name>
							<description>Clear FPDZC Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FPUFC</name>
							<description>Clear FPUFC Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FPOFC</name>
							<description>Clear FPOFC Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FPIDC</name>
							<description>Clear FPIDC Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FPIXC</name>
							<description>Clear FPIXC Interrupt Flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IEN</name>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x00C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>FPIOC</name>
							<description>FPIOC Interrupt Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FPDZC</name>
							<description>FPDZC Interrupt Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FPUFC</name>
							<description>FPUFC Interrupt Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FPOFC</name>
							<description>FPOFC Interrupt Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FPIDC</name>
							<description>FPIDC Interrupt Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FPIXC</name>
							<description>FPIXC Interrupt Enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
