VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>TIMER0</name>
			<description>TIMER0</description>
			<baseAddress>0x40018000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x00000400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIMER0</name>
				<value>10</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>Control Register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x3F032FFB</resetMask>
					<fields>
						<field>
							<name>MODE</name>
							<description>Timer Mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>UP</name>
									<description>Up-count mode</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOWN</name>
									<description>Down-count mode</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UPDOWN</name>
									<description>Up/down-count mode</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>QDEC</name>
									<description>Quadrature decoder mode</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYNC</name>
							<description>Timer Start/Stop/Reload Synchronization</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OSMEN</name>
							<description>One-shot Mode Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>QDM</name>
							<description>Quadrature Decoder Mode Selection</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DEBUGRUN</name>
							<description>Debug Mode Run Enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMACLRACT</name>
							<description>DMA Request Clear on Active</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RISEA</name>
							<description>Timer Rising Input Edge Action</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>No action</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>Start counter without reload</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STOP</name>
									<description>Stop counter without reload</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RELOADSTART</name>
									<description>Reload and start counter</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FALLA</name>
							<description>Timer Falling Input Edge Action</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>No action</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>Start counter without reload</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STOP</name>
									<description>Stop counter without reload</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RELOADSTART</name>
									<description>Reload and start counter</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>X2CNT</name>
							<description>2x Count Mode</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKSEL</name>
							<description>Clock Source Select</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PRESCHFPERCLK</name>
									<description>Prescaled HFPERCLK</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC1</name>
									<description>Compare/Capture Channel 1 Input</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMEROUF</name>
									<description>Timer is clocked by underflow(down-count) or overflow(up-count) in the lower numbered neighbor Timer</description>
									<value>0x00000002</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRESC</name>
							<description>Prescaler Setting</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<description>The HFPERCLK is undivided</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<description>The HFPERCLK is divided by 2</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<description>The HFPERCLK is divided by 4</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<description>The HFPERCLK is divided by 8</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<description>The HFPERCLK is divided by 16</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
									<description>The HFPERCLK is divided by 32</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
									<description>The HFPERCLK is divided by 64</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
									<description>The HFPERCLK is divided by 128</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV256</name>
									<description>The HFPERCLK is divided by 256</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV512</name>
									<description>The HFPERCLK is divided by 512</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV1024</name>
									<description>The HFPERCLK is divided by 1024</description>
									<value>0x0000000A</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ATI</name>
							<description>Always Track Inputs</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RSSCOIST</name>
							<description>Reload-Start Sets Compare Output Initial State</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMD</name>
					<description>Command Register</description>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>START</name>
							<description>Start Timer</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>STOP</name>
							<description>Stop Timer</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Status Register</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0F0F0F07</resetMask>
					<fields>
						<field>
							<name>RUNNING</name>
							<description>Running</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DIR</name>
							<description>Direction</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TOPBV</name>
							<description>TOPB Valid</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CCVBV0</name>
							<description>CC0 CCVB Valid</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CCVBV1</name>
							<description>CC1 CCVB Valid</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CCVBV2</name>
							<description>CC2 CCVB Valid</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CCVBV3</name>
							<description>CC3 CCVB Valid</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICV0</name>
							<description>CC0 Input Capture Valid</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICV1</name>
							<description>CC1 Input Capture Valid</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICV2</name>
							<description>CC2 Input Capture Valid</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICV3</name>
							<description>CC3 Input Capture Valid</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CCPOL0</name>
							<description>CC0 Polarity</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CCPOL1</name>
							<description>CC1 Polarity</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CCPOL2</name>
							<description>CC2 Polarity</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CCPOL3</name>
							<description>CC3 Polarity</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IF</name>
					<description>Interrupt Flag Register</description>
					<addressOffset>0x00C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000FF7</resetMask>
					<fields>
						<field>
							<name>OF</name>
							<description>Overflow Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>UF</name>
							<description>Underflow Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DIRCHG</name>
							<description>Direction Change Detect Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CC0</name>
							<description>CC Channel 0 Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CC1</name>
							<description>CC Channel 1 Interrupt Flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CC2</name>
							<description>CC Channel 2 Interrupt Flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CC3</name>
							<description>CC Channel 3 Interrupt Flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICBOF0</name>
							<description>CC Channel 0 Input Capture Buffer Overflow Interrupt Flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICBOF1</name>
							<description>CC Channel 1 Input Capture Buffer Overflow Interrupt Flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICBOF2</name>
							<description>CC Channel 2 Input Capture Buffer Overflow Interrupt Flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICBOF3</name>
							<description>CC Channel 3 Input Capture Buffer Overflow Interrupt Flag</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFS</name>
					<description>Interrupt Flag Set Register</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000FF7</resetMask>
					<fields>
						<field>
							<name>OF</name>
							<description>Set OF Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>UF</name>
							<description>Set UF Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DIRCHG</name>
							<description>Set DIRCHG Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CC0</name>
							<description>Set CC0 Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CC1</name>
							<description>Set CC1 Interrupt Flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CC2</name>
							<description>Set CC2 Interrupt Flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CC3</name>
							<description>Set CC3 Interrupt Flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ICBOF0</name>
							<description>Set ICBOF0 Interrupt Flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ICBOF1</name>
							<description>Set ICBOF1 Interrupt Flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ICBOF2</name>
							<description>Set ICBOF2 Interrupt Flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ICBOF3</name>
							<description>Set ICBOF3 Interrupt Flag</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFC</name>
					<description>Interrupt Flag Clear Register</description>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000FF7</resetMask>
					<fields>
						<field>
							<name>OF</name>
							<description>Clear OF Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>UF</name>
							<description>Clear UF Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DIRCHG</name>
							<description>Clear DIRCHG Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CC0</name>
							<description>Clear CC0 Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CC1</name>
							<description>Clear CC1 Interrupt Flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CC2</name>
							<description>Clear CC2 Interrupt Flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CC3</name>
							<description>Clear CC3 Interrupt Flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ICBOF0</name>
							<description>Clear ICBOF0 Interrupt Flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ICBOF1</name>
							<description>Clear ICBOF1 Interrupt Flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ICBOF2</name>
							<description>Clear ICBOF2 Interrupt Flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ICBOF3</name>
							<description>Clear ICBOF3 Interrupt Flag</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IEN</name>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000FF7</resetMask>
					<fields>
						<field>
							<name>OF</name>
							<description>OF Interrupt Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UF</name>
							<description>UF Interrupt Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIRCHG</name>
							<description>DIRCHG Interrupt Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC0</name>
							<description>CC0 Interrupt Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1</name>
							<description>CC1 Interrupt Enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2</name>
							<description>CC2 Interrupt Enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC3</name>
							<description>CC3 Interrupt Enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ICBOF0</name>
							<description>ICBOF0 Interrupt Enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ICBOF1</name>
							<description>ICBOF1 Interrupt Enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ICBOF2</name>
							<description>ICBOF2 Interrupt Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ICBOF3</name>
							<description>ICBOF3 Interrupt Enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TOP</name>
					<description>Counter Top Value Register</description>
					<addressOffset>0x01C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0000FFFF</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>TOP</name>
							<description>Counter Top Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
