VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>DTCTRL</name>
					<description>DTI Control Register</description>
					<addressOffset>0x0A0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x010006FF</resetMask>
					<fields>
						<field>
							<name>DTEN</name>
							<description>DTI Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTDAS</name>
							<description>DTI Automatic Start-up Functionality</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTIPOL</name>
							<description>DTI Inactive Polarity</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTCINV</name>
							<description>DTI Complementary Output Invert</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTPRSSEL</name>
							<description>DTI PRS Source Channel Select</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PRSCH0</name>
									<description>PRS Channel 0 selected as input</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH1</name>
									<description>PRS Channel 1 selected as input</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH2</name>
									<description>PRS Channel 2 selected as input</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH3</name>
									<description>PRS Channel 3 selected as input</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH4</name>
									<description>PRS Channel 4 selected as input</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH5</name>
									<description>PRS Channel 5 selected as input</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH6</name>
									<description>PRS Channel 6 selected as input</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH7</name>
									<description>PRS Channel 7 selected as input</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH8</name>
									<description>PRS Channel 8 selected as input</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH9</name>
									<description>PRS Channel 9 selected as input</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH10</name>
									<description>PRS Channel 10 selected as input</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH11</name>
									<description>PRS Channel 11 selected as input</description>
									<value>0x0000000B</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTAR</name>
							<description>DTI Always Run</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTFATS</name>
							<description>DTI Fault Action on Timer Stop</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTPRSEN</name>
							<description>DTI PRS Source Enable</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DTTIME</name>
					<description>DTI Time Control Register</description>
					<addressOffset>0x0A4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x003F3F0F</resetMask>
					<fields>
						<field>
							<name>DTPRESC</name>
							<description>DTI Prescaler Setting</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<description>The HFPERCLK is undivided</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<description>The HFPERCLK is divided by 2</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<description>The HFPERCLK is divided by 4</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<description>The HFPERCLK is divided by 8</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<description>The HFPERCLK is divided by 16</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
									<description>The HFPERCLK is divided by 32</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
									<description>The HFPERCLK is divided by 64</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
									<description>The HFPERCLK is divided by 128</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV256</name>
									<description>The HFPERCLK is divided by 256</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV512</name>
									<description>The HFPERCLK is divided by 512</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV1024</name>
									<description>The HFPERCLK is divided by 1024</description>
									<value>0x0000000A</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTRISET</name>
							<description>DTI Rise-time</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTFALLT</name>
							<description>DTI Fall-time</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DTFC</name>
					<description>DTI Fault Configuration Register</description>
					<addressOffset>0x0A8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0F030F0F</resetMask>
					<fields>
						<field>
							<name>DTPRS0FSEL</name>
							<description>DTI PRS Fault Source 0 Select</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PRSCH0</name>
									<description>PRS Channel 0 selected as fault source 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH1</name>
									<description>PRS Channel 1 selected as fault source 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH2</name>
									<description>PRS Channel 2 selected as fault source 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH3</name>
									<description>PRS Channel 3 selected as fault source 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH4</name>
									<description>PRS Channel 4 selected as fault source 4</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH5</name>
									<description>PRS Channel 5 selected as fault source 5</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH6</name>
									<description>PRS Channel 6 selected as fault source 6</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH7</name>
									<description>PRS Channel 7 selected as fault source 7</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH8</name>
									<description>PRS Channel 8 selected as fault source 8</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH9</name>
									<description>PRS Channel 9 selected as fault source 9</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH10</name>
									<description>PRS Channel 10 selected as fault source 10</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH11</name>
									<description>PRS Channel 11 selected as fault source 11</description>
									<value>0x0000000B</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTPRS1FSEL</name>
							<description>DTI PRS Fault Source 1 Select</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PRSCH0</name>
									<description>PRS Channel 0 selected as fault source 1</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH1</name>
									<description>PRS Channel 1 selected as fault source 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH2</name>
									<description>PRS Channel 2 selected as fault source 1</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH3</name>
									<description>PRS Channel 3 selected as fault source 1</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH4</name>
									<description>PRS Channel 4 selected as fault source 1</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH5</name>
									<description>PRS Channel 5 selected as fault source 1</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH6</name>
									<description>PRS Channel 6 selected as fault source 1</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH7</name>
									<description>PRS Channel 7 selected as fault source 1</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH8</name>
									<description>PRS Channel 8 selected as fault source 1</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH9</name>
									<description>PRS Channel 9 selected as fault source 1</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH10</name>
									<description>PRS Channel 10 selected as fault source 1</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH11</name>
									<description>PRS Channel 11 selected as fault source 1</description>
									<value>0x0000000B</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTFA</name>
							<description>DTI Fault Action</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>No action on fault</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Set outputs inactive</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear outputs</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TRISTATE</name>
									<description>Tristate outputs</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTPRS0FEN</name>
							<description>DTI PRS 0 Fault Enable</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTPRS1FEN</name>
							<description>DTI PRS 1 Fault Enable</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTDBGFEN</name>
							<description>DTI Debugger Fault Enable</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTLOCKUPFEN</name>
							<description>DTI Lockup Fault Enable</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DTOGEN</name>
					<description>DTI Output Generation Enable Register</description>
					<addressOffset>0x0AC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>DTOGCC0EN</name>
							<description>DTI CC0 Output Generation Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTOGCC1EN</name>
							<description>DTI CC1 Output Generation Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTOGCC2EN</name>
							<description>DTI CC2 Output Generation Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTOGCDTI0EN</name>
							<description>DTI CDTI0 Output Generation Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTOGCDTI1EN</name>
							<description>DTI CDTI1 Output Generation Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTOGCDTI2EN</name>
							<description>DTI CDTI2 Output Generation Enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DTFAULT</name>
					<description>DTI Fault Register</description>
					<addressOffset>0x0B0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000000F</resetMask>
					<fields>
						<field>
							<name>DTPRS0F</name>
							<description>DTI PRS 0 Fault</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DTPRS1F</name>
							<description>DTI PRS 1 Fault</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DTDBGF</name>
							<description>DTI Debugger Fault</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DTLOCKUPF</name>
							<description>DTI Lockup Fault</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DTFAULTC</name>
					<description>DTI Fault Clear Register</description>
					<addressOffset>0x0B4</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000000F</resetMask>
					<fields>
						<field>
							<name>DTPRS0FC</name>
							<description>DTI PRS0 Fault Clear</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DTPRS1FC</name>
							<description>DTI PRS1 Fault Clear</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DTDBGFC</name>
							<description>DTI Debugger Fault Clear</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TLOCKUPFC</name>
							<description>DTI Lockup Fault Clear</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DTLOCK</name>
					<description>DTI Configuration Lock Register</description>
					<addressOffset>0x0B8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>LOCKKEY</name>
							<description>DTI Lock Key</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<value>0x00000001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
