VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>TIMING</name>
					<description>Timing Register</description>
					<addressOffset>0x060</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x77770000</resetMask>
					<fields>
						<field>
							<name>TXDELAY</name>
							<description>TX Frame Start Delay</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable - TXDELAY in USARTn_CTRL can be used for legacy</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONE</name>
									<description>Start of transmission is delayed for 1 baud-times</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWO</name>
									<description>Start of transmission is delayed for 2 baud-times</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THREE</name>
									<description>Start of transmission is delayed for 3 baud-times</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SEVEN</name>
									<description>Start of transmission is delayed for 7 baud-times</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TCMP0</name>
									<description>Start of transmission is delayed for TCMPVAL0 baud-times</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TCMP1</name>
									<description>Start of transmission is delayed for TCMPVAL1 baud-times</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TCMP2</name>
									<description>Start of transmission is delayed for TCMPVAL2 baud-times</description>
									<value>0x00000007</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSSETUP</name>
							<description>Chip Select Setup</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ZERO</name>
									<description>CS is not asserted before start of transmission</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONE</name>
									<description>CS is asserted for 1 baud-times before start of transmission</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWO</name>
									<description>CS is asserted for 2 baud-times before start of transmission</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THREE</name>
									<description>CS is asserted for 3 baud-times before start of transmission</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SEVEN</name>
									<description>CS is asserted for 7 baud-times before start of transmission</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TCMP0</name>
									<description>CS is asserted before the start of transmission for TCMPVAL0 baud-times</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TCMP1</name>
									<description>CS is asserted before the start of transmission for TCMPVAL1 baud-times</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TCMP2</name>
									<description>CS is asserted before the start of transmission for TCMPVAL2 baud-times</description>
									<value>0x00000007</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ICS</name>
							<description>Inter-character Spacing</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ZERO</name>
									<description>There is no space between charcters</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONE</name>
									<description>Create a space of 1 baud-times before start of transmission</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWO</name>
									<description>Create a space of 2 baud-times before start of transmission</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THREE</name>
									<description>Create a space of 3 baud-times before start of transmission</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SEVEN</name>
									<description>Create a space of 7 baud-times before start of transmission</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TCMP0</name>
									<description>Create a space of before the start of transmission for TCMPVAL0 baud-times</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TCMP1</name>
									<description>Create a space of before the start of transmission for TCMPVAL1 baud-times</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TCMP2</name>
									<description>Create a space of before the start of transmission for TCMPVAL2 baud-times</description>
									<value>0x00000007</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSHOLD</name>
							<description>Chip Select Hold</description>
							<bitOffset>28</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ZERO</name>
									<description>Disable CS being asserted after the end of transmission</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONE</name>
									<description>CS is asserted for 1 baud-times after the end of transmission</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TWO</name>
									<description>CS is asserted for 2 baud-times after the end of transmission</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THREE</name>
									<description>CS is asserted for 3 baud-times after the end of transmission</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SEVEN</name>
									<description>CS is asserted for 7 baud-times after the end of transmission</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TCMP0</name>
									<description>CS is asserted after the end of transmission for TCMPVAL0 baud-times</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TCMP1</name>
									<description>CS is asserted after the end of transmission for TCMPVAL1 baud-times</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TCMP2</name>
									<description>CS is asserted after the end of transmission for TCMPVAL2 baud-times</description>
									<value>0x00000007</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRLX</name>
					<description>Control Register Extended</description>
					<addressOffset>0x064</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000000F</resetMask>
					<fields>
						<field>
							<name>DBGHALT</name>
							<description>Debug Halt</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CTSINV</name>
							<description>CTS Pin Inversion</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CTSEN</name>
							<description>CTS Function Enabled</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTSINV</name>
							<description>RTS Pin Inversion</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMECMP0</name>
					<description>Used to Generate Interrupts and Various Delays</description>
					<addressOffset>0x068</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x017700FF</resetMask>
					<fields>
						<field>
							<name>TCMPVAL</name>
							<description>Timer Comparator 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TSTART</name>
							<description>Timer Start Source</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Comparator 0 is disabled</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXEOF</name>
									<description>Comparator 0 and timer are started at TX end of frame</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXC</name>
									<description>Comparator 0 and timer are started at TX Complete</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXACT</name>
									<description>Comparator 0 and timer are started at RX going Active (default: low)</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXEOF</name>
									<description>Comparator 0 and timer are started at RX end of frame</description>
									<value>0x00000004</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TSTOP</name>
							<description>Source Used to Disable Comparator 0</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>TCMP0</name>
									<description>Comparator 0 is disabled when the counter equals TCMPVAL and triggers a TCMP0 event</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXST</name>
									<description>Comparator 0 is disabled at the start of transmission</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXACT</name>
									<description>Comparator 0 is disabled on RX going going Active (default: low)</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXACTN</name>
									<description>Comparator 0 is disabled on RX going Inactive</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESTARTEN</name>
							<description>Restart Timer on TCMP0</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMECMP1</name>
					<description>Used to Generate Interrupts and Various Delays</description>
					<addressOffset>0x06C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x017700FF</resetMask>
					<fields>
						<field>
							<name>TCMPVAL</name>
							<description>Timer Comparator 1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TSTART</name>
							<description>Timer Start Source</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Comparator 1 is disabled</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXEOF</name>
									<description>Comparator 1 and timer are started at TX end of frame</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXC</name>
									<description>Comparator 1 and timer are started at TX Complete</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXACT</name>
									<description>Comparator 1 and timer are started at RX going going Active (default: low)</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXEOF</name>
									<description>Comparator 1 and timer are started at RX end of frame</description>
									<value>0x00000004</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TSTOP</name>
							<description>Source Used to Disable Comparator 1</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>TCMP1</name>
									<description>Comparator 1 is disabled when the counter equals TCMPVAL and triggers a TCMP1 event</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXST</name>
									<description>Comparator 1 is disabled at TX start TX Engine</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXACT</name>
									<description>Comparator 1 is disabled on RX going going Active (default: low)</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXACTN</name>
									<description>Comparator 1 is disabled on RX going Inactive</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESTARTEN</name>
							<description>Restart Timer on TCMP1</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMECMP2</name>
					<description>Used to Generate Interrupts and Various Delays</description>
					<addressOffset>0x070</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x017700FF</resetMask>
					<fields>
						<field>
							<name>TCMPVAL</name>
							<description>Timer Comparator 2</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TSTART</name>
							<description>Timer Start Source</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Comparator 2 is disabled</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXEOF</name>
									<description>Comparator 2 and timer are started at TX end of frame</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXC</name>
									<description>Comparator 2 and timer are started at TX Complete</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXACT</name>
									<description>Comparator 2 and timer are started at RX going going Active (default: low)</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXEOF</name>
									<description>Comparator 2 and timer are started at RX end of frame</description>
									<value>0x00000004</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TSTOP</name>
							<description>Source Used to Disable Comparator 2</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>TCMP2</name>
									<description>Comparator 2 is disabled when the counter equals TCMPVAL and triggers a TCMP2 event</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXST</name>
									<description>Comparator 2 is disabled at TX start TX Engine</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXACT</name>
									<description>Comparator 2 is disabled on RX going going Active (default: low)</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXACTN</name>
									<description>Comparator 2 is disabled on RX going Inactive</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESTARTEN</name>
							<description>Restart Timer on TCMP2</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ROUTEPEN</name>
					<description>I/O Routing Pin Enable Register</description>
					<addressOffset>0x074</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>RXPEN</name>
							<description>RX Pin Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXPEN</name>
							<description>TX Pin Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CSPEN</name>
							<description>CS Pin Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKPEN</name>
							<description>CLK Pin Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CTSPEN</name>
							<description>CTS Pin Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTSPEN</name>
							<description>RTS Pin Enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
