VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>LETIMER0</name>
			<description>LETIMER0</description>
			<baseAddress>0x40046000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x00000400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>LETIMER0</name>
				<value>26</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>Control Register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000013FF</resetMask>
					<fields>
						<field>
							<name>REPMODE</name>
							<description>Repeat Mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>FREE</name>
									<description>When started, the LETIMER counts down until it is stopped by software</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONESHOT</name>
									<description>The counter counts REP0 times. When REP0 reaches zero, the counter stops</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BUFFERED</name>
									<description>The counter counts REP0 times. If REP1 has been written, it is loaded into REP0 when REP0 reaches zero, otherwise the counter stops</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOUBLE</name>
									<description>Both REP0 and REP1 are decremented when the LETIMER wraps around. The LETIMER counts until both REP0 and REP1 are zero</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UFOA0</name>
							<description>Underflow Output Action 0</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>LETn_O0 is held at its idle value as defined by OPOL0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>LETn_O0 is toggled on CNT underflow</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULSE</name>
									<description>LETn_O0 is held active for one LFACLKLETIMER0 clock cycle on CNT underflow. The output then returns to its idle value as defined by OPOL0</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM</name>
									<description>LETn_O0 is set idle on CNT underflow, and active on compare match with COMP1</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UFOA1</name>
							<description>Underflow Output Action 1</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>LETn_O1 is held at its idle value as defined by OPOL1</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>LETn_O1 is toggled on CNT underflow</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULSE</name>
									<description>LETn_O1 is held active for one LFACLKLETIMER0 clock cycle on CNT underflow. The output then returns to its idle value as defined by OPOL1</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM</name>
									<description>LETn_O1 is set idle on CNT underflow, and active on compare match with COMP1</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OPOL0</name>
							<description>Output 0 Polarity</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OPOL1</name>
							<description>Output 1 Polarity</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUFTOP</name>
							<description>Buffered Top</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP0TOP</name>
							<description>Compare Value 0 is Top Value</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DEBUGRUN</name>
							<description>Debug Mode Run Enable</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMD</name>
					<description>Command Register</description>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000001F</resetMask>
					<fields>
						<field>
							<name>START</name>
							<description>Start LETIMER</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>STOP</name>
							<description>Stop LETIMER</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CLEAR</name>
							<description>Clear LETIMER</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CTO0</name>
							<description>Clear Toggle Output 0</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CTO1</name>
							<description>Clear Toggle Output 1</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Status Register</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>RUNNING</name>
							<description>LETIMER Running</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<description>Counter Value Register</description>
					<addressOffset>0x00C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Counter Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP0</name>
					<description>Compare Value Register 0</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>COMP0</name>
							<description>Compare Value 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP1</name>
					<description>Compare Value Register 1</description>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>COMP1</name>
							<description>Compare Value 1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REP0</name>
					<description>Repeat Counter Register 0</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>REP0</name>
							<description>Repeat Counter 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REP1</name>
					<description>Repeat Counter Register 1</description>
					<addressOffset>0x01C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>REP1</name>
							<description>Repeat Counter 1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IF</name>
					<description>Interrupt Flag Register</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000001F</resetMask>
					<fields>
						<field>
							<name>COMP0</name>
							<description>Compare Match 0 Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>COMP1</name>
							<description>Compare Match 1 Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>UF</name>
							<description>Underflow Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>REP0</name>
							<description>Repeat Counter 0 Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>REP1</name>
							<description>Repeat Counter 1 Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFS</name>
					<description>Interrupt Flag Set Register</description>
					<addressOffset>0x024</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000001F</resetMask>
					<fields>
						<field>
							<name>COMP0</name>
							<description>Set COMP0 Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>COMP1</name>
							<description>Set COMP1 Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>UF</name>
							<description>Set UF Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>REP0</name>
							<description>Set REP0 Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>REP1</name>
							<description>Set REP1 Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFC</name>
					<description>Interrupt Flag Clear Register</description>
					<addressOffset>0x028</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000001F</resetMask>
					<fields>
						<field>
							<name>COMP0</name>
							<description>Clear COMP0 Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>COMP1</name>
							<description>Clear COMP1 Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>UF</name>
							<description>Clear UF Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>REP0</name>
							<description>Clear REP0 Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>REP1</name>
							<description>Clear REP1 Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IEN</name>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x02C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000001F</resetMask>
					<fields>
						<field>
							<name>COMP0</name>
							<description>COMP0 Interrupt Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP1</name>
							<description>COMP1 Interrupt Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UF</name>
							<description>UF Interrupt Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REP0</name>
							<description>REP0 Interrupt Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REP1</name>
							<description>REP1 Interrupt Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYNCBUSY</name>
					<description>Synchronization Busy Register</description>
					<addressOffset>0x034</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000002</resetMask>
					<fields>
						<field>
							<name>CMD</name>
							<description>CMD Register Busy</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ROUTEPEN</name>
					<description>I/O Routing Pin Enable Register</description>
					<addressOffset>0x040</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>OUT0PEN</name>
							<description>Output 0 Pin Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OUT1PEN</name>
							<description>Output 1 Pin Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
