VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CRYOTIMER</name>
			<description>CRYOTIMER</description>
			<baseAddress>0x4001E000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x00000400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CRYOTIMER</name>
				<value>31</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>Control Register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000EF</resetMask>
					<fields>
						<field>
							<name>EN</name>
							<description>Enable CRYOTIMER</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DEBUGRUN</name>
							<description>Debug Mode Run Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OSCSEL</name>
							<description>Select Low Frequency Oscillator</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LFRCO</name>
									<description>Select Low Frequency RC Oscillator</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXO</name>
									<description>Select Low Frequency Crystal Oscillator</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ULFRCO</name>
									<description>Select Ultra Low Frequency RC Oscillator</description>
									<value>0x00000002</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRESC</name>
							<description>Prescaler Setting</description>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<description>LF Oscillator frequency undivided</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<description>LF Oscillator frequency divided by 2</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<description>LF Oscillator frequency divided by 4</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<description>LF Oscillator frequency divided by 8</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<description>LF Oscillator frequency divided by 16</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
									<description>LF Oscillator frequency divided by 32</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
									<description>LF Oscillator frequency divided by 64</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
									<description>LF Oscillator frequency divided by 128</description>
									<value>0x00000007</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PERIODSEL</name>
					<description>Interrupt Duration</description>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000020</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>PERIODSEL</name>
							<description>Interrupts/Wakeup Events Period Setting</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<description>Counter Value</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Counter Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EM4WUEN</name>
					<description>Wake Up Enable</description>
					<addressOffset>0x00C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>EM4WU</name>
							<description>EM4 Wake-up Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IF</name>
					<description>Interrupt Flag Register</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>PERIOD</name>
							<description>Wakeup Event/Interrupt</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFS</name>
					<description>Interrupt Flag Set Register</description>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>PERIOD</name>
							<description>Set PERIOD Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFC</name>
					<description>Interrupt Flag Clear Register</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>PERIOD</name>
							<description>Clear PERIOD Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IEN</name>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x01C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>PERIOD</name>
							<description>PERIOD Interrupt Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
