VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PCNT0</name>
			<description>PCNT0</description>
			<baseAddress>0x4004E000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x00000400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PCNT0</name>
				<value>22</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>Control Register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xBFDBFFFF</resetMask>
					<fields>
						<field>
							<name>MODE</name>
							<description>Mode Select</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>The module is disabled.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVSSINGLE</name>
									<description>Single input LFACLK oversampling mode (available in EM0-EM3).</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTCLKSINGLE</name>
									<description>Externally clocked single input counter mode (available in EM0-EM3).</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTCLKQUAD</name>
									<description>Externally clocked quadrature decoder mode (available in EM0-EM3).</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVSQUAD1X</name>
									<description>LFACLK oversampling quadrature decoder 1X mode (available in EM0-EM3).</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVSQUAD2X</name>
									<description>LFACLK oversampling quadrature decoder 2X mode (available in EM0-EM3).</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVSQUAD4X</name>
									<description>LFACLK oversampling quadrature decoder 4X mode (available in EM0-EM3).</description>
									<value>0x00000006</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILT</name>
							<description>Enable Digital Pulse Width Filter</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTEN</name>
							<description>Enable PCNT Clock Domain Reset</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTRSTEN</name>
							<description>Enable CNT Reset</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUXCNTRSTEN</name>
							<description>Enable AUXCNT Reset</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DEBUGHALT</name>
							<description>Debug Mode Halt Enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HYST</name>
							<description>Enable Hysteresis</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>S1CDIR</name>
							<description>Count Direction Determined By S1</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTEV</name>
							<description>Controls When the Counter Counts</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>BOTH</name>
									<description>Counts up on up-count and down on down-count events.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UP</name>
									<description>Only counts up on up-count events.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOWN</name>
									<description>Only counts down on down-count events.</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NONE</name>
									<description>Never counts.</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AUXCNTEV</name>
							<description>Controls When the Auxiliary Counter Counts</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>Never counts.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UP</name>
									<description>Counts up on up-count events.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DOWN</name>
									<description>Counts up on down-count events.</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BOTH</name>
									<description>Counts up on both up-count and down-count events.</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNTDIR</name>
							<description>Non-Quadrature Mode Counter Direction Control</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EDGE</name>
							<description>Edge Select</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCCMODE</name>
							<description>Sets the Mode for Triggered Compare and Clear</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Triggered compare and clear not enabled.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFA</name>
									<description>Compare and clear performed on each (optionally prescaled) LFA clock cycle.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRS</name>
									<description>Compare and clear performed on positive PRS edges.</description>
									<value>0x00000002</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TCCPRESC</name>
							<description>Set the LFA Prescaler for Triggered Compare and Clear</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<description>Compare and clear event each LFA cycle.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<description>Compare and clear performed on every other LFA cycle.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<description>Compare and clear performed on every 4th LFA cycle.</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<description>Compare and clear performed on every 8th LFA cycle.</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TCCCOMP</name>
							<description>Triggered Compare and Clear Compare Mode</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LTOE</name>
									<description>Compare match if PCNT_CNT is less than, or equal to PCNT_TOP.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GTOE</name>
									<description>Compare match if PCNT_CNT is greater than or equal to PCNT_TOP.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RANGE</name>
									<description>Compare match if PCNT_CNT is less than, or equal to PCNT_TOP[15:8]], and greater than, or equal to PCNT_TOP[7:0].</description>
									<value>0x00000002</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRSGATEEN</name>
							<description>PRS Gate Enable</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCCPRSPOL</name>
							<description>TCC PRS Polarity Select</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCCPRSSEL</name>
							<description>TCC PRS Channel Select</description>
							<bitOffset>26</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PRSCH0</name>
									<description>PRS Channel 0 selected.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH1</name>
									<description>PRS Channel 1 selected.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH2</name>
									<description>PRS Channel 2 selected.</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH3</name>
									<description>PRS Channel 3 selected.</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH4</name>
									<description>PRS Channel 4 selected.</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH5</name>
									<description>PRS Channel 5 selected.</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH6</name>
									<description>PRS Channel 6 selected.</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH7</name>
									<description>PRS Channel 7 selected.</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH8</name>
									<description>PRS Channel 8 selected.</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH9</name>
									<description>PRS Channel 9 selected.</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH10</name>
									<description>PRS Channel 10 selected.</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH11</name>
									<description>PRS Channel 11 selected.</description>
									<value>0x0000000B</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TOPBHFSEL</name>
							<description>TOPB High Frequency Value Select</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMD</name>
					<description>Command Register</description>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>LCNTIM</name>
							<description>Load CNT Immediately</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LTOPBIM</name>
							<description>Load TOPB Immediately</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Status Register</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>DIR</name>
							<description>Current Counter Direction</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<description>Counter Value Register</description>
					<addressOffset>0x00C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Counter Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TOP</name>
					<description>Top Value Register</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x000000FF</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>TOP</name>
							<description>Counter Top Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TOPB</name>
					<description>Top Value Buffer Register</description>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x000000FF</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>TOPB</name>
							<description>Counter Top Buffer</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IF</name>
					<description>Interrupt Flag Register</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>UF</name>
							<description>Underflow Interrupt Read Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OF</name>
							<description>Overflow Interrupt Read Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DIRCNG</name>
							<description>Direction Change Detect Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AUXOF</name>
							<description>Auxiliary Overflow Interrupt Read Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TCC</name>
							<description>Triggered Compare Interrupt Read Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OQSTERR</name>
							<description>Oversampling Quadrature State Error Interrupt</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFS</name>
					<description>Interrupt Flag Set Register</description>
					<addressOffset>0x01C</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>UF</name>
							<description>Set UF Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OF</name>
							<description>Set OF Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DIRCNG</name>
							<description>Set DIRCNG Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AUXOF</name>
							<description>Set AUXOF Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TCC</name>
							<description>Set TCC Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OQSTERR</name>
							<description>Set OQSTERR Interrupt Flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFC</name>
					<description>Interrupt Flag Clear Register</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>UF</name>
							<description>Clear UF Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OF</name>
							<description>Clear OF Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DIRCNG</name>
							<description>Clear DIRCNG Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AUXOF</name>
							<description>Clear AUXOF Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TCC</name>
							<description>Clear TCC Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OQSTERR</name>
							<description>Clear OQSTERR Interrupt Flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IEN</name>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x024</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>UF</name>
							<description>UF Interrupt Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OF</name>
							<description>OF Interrupt Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIRCNG</name>
							<description>DIRCNG Interrupt Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUXOF</name>
							<description>AUXOF Interrupt Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCC</name>
							<description>TCC Interrupt Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OQSTERR</name>
							<description>OQSTERR Interrupt Enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
