VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>I2C0</name>
			<description>I2C0</description>
			<baseAddress>0x4000C000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x00000400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>I2C0</name>
				<value>16</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>Control Register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0007B3FF</resetMask>
					<fields>
						<field>
							<name>EN</name>
							<description>I2C Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SLAVE</name>
							<description>Addressable as Slave</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUTOACK</name>
							<description>Automatic Acknowledge</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUTOSE</name>
							<description>Automatic STOP When Empty</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUTOSN</name>
							<description>Automatic STOP on NACK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ARBDIS</name>
							<description>Arbitration Disable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GCAMEN</name>
							<description>General Call Address Match Enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXBIL</name>
							<description>TX Buffer Interrupt Level</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLHR</name>
							<description>Clock Low High Ratio</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>The ratio between low period and high period counters (Nlow:Nhigh) is 4:4</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ASYMMETRIC</name>
									<description>The ratio between low period and high period counters (Nlow:Nhigh) is 6:3</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>The ratio between low period and high period counters (Nlow:Nhigh) is 11:6</description>
									<value>0x00000002</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BITO</name>
							<description>Bus Idle Timeout</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>Timeout disabled</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>40PCC</name>
									<description>Timeout after 40 prescaled clock cycles. In standard mode at 100 kHz, this results in a 50us timeout.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>80PCC</name>
									<description>Timeout after 80 prescaled clock cycles. In standard mode at 100 kHz, this results in a 100us timeout.</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>160PCC</name>
									<description>Timeout after 160 prescaled clock cycles. In standard mode at 100 kHz, this results in a 200us timeout.</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GIBITO</name>
							<description>Go Idle on Bus Idle Timeout</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLTO</name>
							<description>Clock Low Timeout</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>Timeout disabled</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>40PCC</name>
									<description>Timeout after 40 prescaled clock cycles. In standard mode at 100 kHz, this results in a 50us timeout.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>80PCC</name>
									<description>Timeout after 80 prescaled clock cycles. In standard mode at 100 kHz, this results in a 100us timeout.</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>160PCC</name>
									<description>Timeout after 160 prescaled clock cycles. In standard mode at 100 kHz, this results in a 200us timeout.</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>320PCC</name>
									<description>Timeout after 320 prescaled clock cycles. In standard mode at 100 kHz, this results in a 400us timeout.</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1024PCC</name>
									<description>Timeout after 1024 prescaled clock cycles. In standard mode at 100 kHz, this results in a 1280us timeout.</description>
									<value>0x00000005</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CMD</name>
					<description>Command Register</description>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>START</name>
							<description>Send Start Condition</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>STOP</name>
							<description>Send Stop Condition</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ACK</name>
							<description>Send ACK</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>NACK</name>
							<description>Send NACK</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CONT</name>
							<description>Continue Transmission</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ABORT</name>
							<description>Abort Transmission</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CLEARTX</name>
							<description>Clear TX</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CLEARPC</name>
							<description>Clear Pending Commands</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATE</name>
					<description>State Register</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>BUSY</name>
							<description>Bus Busy</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MASTER</name>
							<description>Master</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRANSMITTER</name>
							<description>Transmitter</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>NACKED</name>
							<description>Nack Received</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BUSHOLD</name>
							<description>Bus Held</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>STATE</name>
							<description>Transmission State</description>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>IDLE</name>
									<description>No transmission is being performed.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAIT</name>
									<description>Waiting for idle. Will send a start condition as soon as the bus is idle.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>Start transmitted or received</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADDR</name>
									<description>Address transmitted or received</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADDRACK</name>
									<description>Address ack/nack transmitted or received</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DATA</name>
									<description>Data transmitted or received</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DATAACK</name>
									<description>Data ack/nack transmitted or received</description>
									<value>0x00000006</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Status Register</description>
					<addressOffset>0x00C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000080</resetValue>
					<resetMask>0x000003FF</resetMask>
					<fields>
						<field>
							<name>PSTART</name>
							<description>Pending START</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PSTOP</name>
							<description>Pending STOP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PACK</name>
							<description>Pending ACK</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PNACK</name>
							<description>Pending NACK</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PCONT</name>
							<description>Pending Continue</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PABORT</name>
							<description>Pending Abort</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TXC</name>
							<description>TX Complete</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TXBL</name>
							<description>TX Buffer Level</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXDATAV</name>
							<description>RX Data Valid</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXFULL</name>
							<description>RX FIFO Full</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKDIV</name>
					<description>Clock Division Register</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000001FF</resetMask>
					<fields>
						<field>
							<name>DIV</name>
							<description>Clock Divider</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SADDR</name>
					<description>Slave Address Register</description>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FE</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Slave Address</description>
							<bitOffset>1</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SADDRMASK</name>
					<description>Slave Address Mask Register</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FE</resetMask>
					<fields>
						<field>
							<name>MASK</name>
							<description>Slave Address Mask</description>
							<bitOffset>1</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXDATA</name>
					<description>Receive Buffer Data Register</description>
					<addressOffset>0x01C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>RXDATA</name>
							<description>RX Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXDOUBLE</name>
					<description>Receive Buffer Double Data Register</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>RXDATA0</name>
							<description>RX Data 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXDATA1</name>
							<description>RX Data 1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXDATAP</name>
					<description>Receive Buffer Data Peek Register</description>
					<addressOffset>0x024</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>RXDATAP</name>
							<description>RX Data Peek</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXDOUBLEP</name>
					<description>Receive Buffer Double Data Peek Register</description>
					<addressOffset>0x028</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>RXDATAP0</name>
							<description>RX Data 0 Peek</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXDATAP1</name>
							<description>RX Data 1 Peek</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXDATA</name>
					<description>Transmit Buffer Data Register</description>
					<addressOffset>0x02C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>TXDATA</name>
							<description>TX Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXDOUBLE</name>
					<description>Transmit Buffer Double Data Register</description>
					<addressOffset>0x030</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>TXDATA0</name>
							<description>TX Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXDATA1</name>
							<description>TX Data</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IF</name>
					<description>Interrupt Flag Register</description>
					<addressOffset>0x034</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000010</resetValue>
					<resetMask>0x0007FFFF</resetMask>
					<fields>
						<field>
							<name>START</name>
							<description>START Condition Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RSTART</name>
							<description>Repeated START Condition Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDR</name>
							<description>Address Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TXC</name>
							<description>Transfer Completed Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TXBL</name>
							<description>Transmit Buffer Level Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXDATAV</name>
							<description>Receive Data Valid Interrupt Flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ACK</name>
							<description>Acknowledge Received Interrupt Flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>NACK</name>
							<description>Not Acknowledge Received Interrupt Flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MSTOP</name>
							<description>Master STOP Condition Interrupt Flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ARBLOST</name>
							<description>Arbitration Lost Interrupt Flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BUSERR</name>
							<description>Bus Error Interrupt Flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BUSHOLD</name>
							<description>Bus Held Interrupt Flag</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TXOF</name>
							<description>Transmit Buffer Overflow Interrupt Flag</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXUF</name>
							<description>Receive Buffer Underflow Interrupt Flag</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BITO</name>
							<description>Bus Idle Timeout Interrupt Flag</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLTO</name>
							<description>Clock Low Timeout Interrupt Flag</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SSTOP</name>
							<description>Slave STOP Condition Interrupt Flag</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXFULL</name>
							<description>Receive Buffer Full Interrupt Flag</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLERR</name>
							<description>Clock Low Error Interrupt Flag</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
