VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>IFS</name>
					<description>Interrupt Flag Set Register</description>
					<addressOffset>0x038</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0007FFCF</resetMask>
					<fields>
						<field>
							<name>START</name>
							<description>Set START Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RSTART</name>
							<description>Set RSTART Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ADDR</name>
							<description>Set ADDR Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TXC</name>
							<description>Set TXC Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ACK</name>
							<description>Set ACK Interrupt Flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>NACK</name>
							<description>Set NACK Interrupt Flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MSTOP</name>
							<description>Set MSTOP Interrupt Flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ARBLOST</name>
							<description>Set ARBLOST Interrupt Flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>BUSERR</name>
							<description>Set BUSERR Interrupt Flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>BUSHOLD</name>
							<description>Set BUSHOLD Interrupt Flag</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TXOF</name>
							<description>Set TXOF Interrupt Flag</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXUF</name>
							<description>Set RXUF Interrupt Flag</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>BITO</name>
							<description>Set BITO Interrupt Flag</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CLTO</name>
							<description>Set CLTO Interrupt Flag</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SSTOP</name>
							<description>Set SSTOP Interrupt Flag</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXFULL</name>
							<description>Set RXFULL Interrupt Flag</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CLERR</name>
							<description>Set CLERR Interrupt Flag</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFC</name>
					<description>Interrupt Flag Clear Register</description>
					<addressOffset>0x03C</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0007FFCF</resetMask>
					<fields>
						<field>
							<name>START</name>
							<description>Clear START Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RSTART</name>
							<description>Clear RSTART Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ADDR</name>
							<description>Clear ADDR Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TXC</name>
							<description>Clear TXC Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ACK</name>
							<description>Clear ACK Interrupt Flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>NACK</name>
							<description>Clear NACK Interrupt Flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MSTOP</name>
							<description>Clear MSTOP Interrupt Flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ARBLOST</name>
							<description>Clear ARBLOST Interrupt Flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>BUSERR</name>
							<description>Clear BUSERR Interrupt Flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>BUSHOLD</name>
							<description>Clear BUSHOLD Interrupt Flag</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TXOF</name>
							<description>Clear TXOF Interrupt Flag</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXUF</name>
							<description>Clear RXUF Interrupt Flag</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>BITO</name>
							<description>Clear BITO Interrupt Flag</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CLTO</name>
							<description>Clear CLTO Interrupt Flag</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SSTOP</name>
							<description>Clear SSTOP Interrupt Flag</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXFULL</name>
							<description>Clear RXFULL Interrupt Flag</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CLERR</name>
							<description>Clear CLERR Interrupt Flag</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IEN</name>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x040</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0007FFFF</resetMask>
					<fields>
						<field>
							<name>START</name>
							<description>START Interrupt Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RSTART</name>
							<description>RSTART Interrupt Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADDR</name>
							<description>ADDR Interrupt Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXC</name>
							<description>TXC Interrupt Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXBL</name>
							<description>TXBL Interrupt Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RXDATAV</name>
							<description>RXDATAV Interrupt Enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ACK</name>
							<description>ACK Interrupt Enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NACK</name>
							<description>NACK Interrupt Enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MSTOP</name>
							<description>MSTOP Interrupt Enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ARBLOST</name>
							<description>ARBLOST Interrupt Enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUSERR</name>
							<description>BUSERR Interrupt Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUSHOLD</name>
							<description>BUSHOLD Interrupt Enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXOF</name>
							<description>TXOF Interrupt Enable</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RXUF</name>
							<description>RXUF Interrupt Enable</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BITO</name>
							<description>BITO Interrupt Enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLTO</name>
							<description>CLTO Interrupt Enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SSTOP</name>
							<description>SSTOP Interrupt Enable</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RXFULL</name>
							<description>RXFULL Interrupt Enable</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLERR</name>
							<description>CLERR Interrupt Enable</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ROUTEPEN</name>
					<description>I/O Routing Pin Enable Register</description>
					<addressOffset>0x044</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>SDAPEN</name>
							<description>SDA Pin Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCLPEN</name>
							<description>SCL Pin Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
