VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ADC0</name>
			<description>ADC0</description>
			<baseAddress>0x40002000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x00000400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC0</name>
				<value>14</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>Control Register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x001F0000</resetValue>
					<resetMask>0x2F7F7FDF</resetMask>
					<fields>
						<field>
							<name>WARMUPMODE</name>
							<description>Warm-up Mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>ADC is shut down after each conversion. 5us warmup time is used before each conversion.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>KEEPINSTANDBY</name>
									<description>ADC is kept in standby mode between conversions. 1us warmup time is used before each conversion.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>KEEPINSLOWACC</name>
									<description>ADC is kept in slow acquisition mode between conversions. 1us warmup time is used before each conversion.</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>KEEPADCWARM</name>
									<description>ADC is kept on after conversions, allowing for continuous conversion.</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SINGLEDMAWU</name>
							<description>SINGLEFIFO DMA Wakeup</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCANDMAWU</name>
							<description>SCANFIFO DMA Wakeup</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TAILGATE</name>
							<description>Conversion Tailgating</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ASYNCCLKEN</name>
							<description>Selects ASYNC CLK Enable Mode When ADCCLKMODE=1</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADCCLKMODE</name>
							<description>ADC Clock Mode</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PRESC</name>
							<description>Prescalar Setting for ADC Sample and Conversion Clock</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NODIVISION</name>
									<value>0x00000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIMEBASE</name>
							<description>1us Time Base</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OVSRSEL</name>
							<description>Oversample Rate Select</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>X2</name>
									<description>2 samples for each conversion result</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>X4</name>
									<description>4 samples for each conversion result</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>X8</name>
									<description>8 samples for each conversion result</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>X16</name>
									<description>16 samples for each conversion result</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>X32</name>
									<description>32 samples for each conversion result</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>X64</name>
									<description>64 samples for each conversion result</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>X128</name>
									<description>128 samples for each conversion result</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>X256</name>
									<description>256 samples for each conversion result</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>X512</name>
									<description>512 samples for each conversion result</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>X1024</name>
									<description>1024 samples for each conversion result</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>X2048</name>
									<description>2048 samples for each conversion result</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>X4096</name>
									<description>4096 samples for each conversion result</description>
									<value>0x0000000B</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHCONMODE</name>
							<description>Channel Connect</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMD</name>
					<description>Command Register</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000000F</resetMask>
					<fields>
						<field>
							<name>SINGLESTART</name>
							<description>Single Channel Conversion Start</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SINGLESTOP</name>
							<description>Single Channel Conversion Stop</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCANSTART</name>
							<description>Scan Sequence Start</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCANSTOP</name>
							<description>Scan Sequence Stop</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Status Register</description>
					<addressOffset>0x00C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00031F03</resetMask>
					<fields>
						<field>
							<name>SINGLEACT</name>
							<description>Single Channel Conversion Active</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCANACT</name>
							<description>Scan Conversion Active</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SINGLEREFWARM</name>
							<description>Single Channel Reference Warmed Up</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCANREFWARM</name>
							<description>Scan Reference Warmed Up</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROGERR</name>
							<description>Programming Error Status</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>BUSCONF</name>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NEGSELCONF</name>
									<value>0x00000002</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WARM</name>
							<description>ADC Warmed Up</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SINGLEDV</name>
							<description>Single Channel Data Valid</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCANDV</name>
							<description>Scan Data Valid</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SINGLECTRL</name>
					<description>Single Channel Control Register</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00FFFF00</resetValue>
					<resetMask>0xAFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REP</name>
							<description>Single Channel Repetitive Mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIFF</name>
							<description>Single Channel Differential Mode</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADJ</name>
							<description>Single Channel Result Adjustment</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RES</name>
							<description>Single Channel Resolution Select</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>12BIT</name>
									<description>12-bit resolution.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8BIT</name>
									<description>8-bit resolution.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6BIT</name>
									<description>6-bit resolution.</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVS</name>
									<description>Oversampling enabled. Oversampling rate is set in OVSRSEL.</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REF</name>
							<description>Single Channel Reference Selection</description>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1V25</name>
									<description>VFS = 1.25V with internal VBGR reference</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2V5</name>
									<description>VFS = 2.5V with internal VBGR reference</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VDD</name>
									<description>VFS = AVDD with AVDD as reference source</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5V</name>
									<description>VFS = 5V with internal VBGR reference</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTSINGLE</name>
									<description>Single ended external reference</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2XEXTDIFF</name>
									<description>Differential external reference, 2x</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2XVDD</name>
									<description>VFS = 2xAVDD with AVDD as the reference source</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CONF</name>
									<description>Use SINGLECTRLX to configure reference</description>
									<value>0x00000007</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>POSSEL</name>
							<description>Single Channel Positive Input Selection</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NEGSEL</name>
							<description>Single Channel Negative Input Selection</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AT</name>
							<description>Single Channel Acquisition Time</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1CYCLE</name>
									<description>1 conversion clock cycle acquisition time for single channel</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2CYCLES</name>
									<description>2 conversion clock cycles acquisition time for single channel</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3CYCLES</name>
									<description>3 conversion clock cycles acquisition time for single channel</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4CYCLES</name>
									<description>4 conversion clock cycles acquisition time for single channel</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8CYCLES</name>
									<description>8 conversion clock cycles acquisition time for single channel</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16CYCLES</name>
									<description>16 conversion clock cycles acquisition time for single channel</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32CYCLES</name>
									<description>32 conversion clock cycles acquisition time for single channel</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>64CYCLES</name>
									<description>64 conversion clock cycles acquisition time for single channel</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>128CYCLES</name>
									<description>128 conversion clock cycles acquisition time for single channel</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>256CYCLES</name>
									<description>256 conversion clock cycles acquisition time for single channel</description>
									<value>0x00000009</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRSEN</name>
							<description>Single Channel PRS Trigger Enable</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CMPEN</name>
							<description>Compare Logic Enable for Single Channel</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SINGLECTRLX</name>
					<description>Single Channel Control Register Continued</description>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0F1F7FFF</resetMask>
					<fields>
						<field>
							<name>VREFSEL</name>
							<description>Single Channel Reference Selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VBGR</name>
									<description>Internal 0.83V Bandgap reference</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VDDXWATT</name>
									<description>Scaled AVDD: AVDD*(the VREF attenuation factor)</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VREFPWATT</name>
									<description>Scaled singled ended external Vref: ADCn_EXTP*(the VREF attenuation factor)</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VREFP</name>
									<description>Raw single ended external Vref: ADCn_EXTP</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VENTROPY</name>
									<description>Special mode used to generate ENTROPY.</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VREFPNWATT</name>
									<description>Scaled differential external Vref from : (ADCn_EXTP-ADCn_EXTN)*(the VREF attenuation factor)</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VREFPN</name>
									<description>Raw differential external Vref from : (ADCn_EXTP-ADCn_EXTN)</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VBGRLOW</name>
									<description>Internal Bandgap reference at low setting 0.78V</description>
									<value>0x00000007</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREFATTFIX</name>
							<description>Enable Fixed Scaling on VREF</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VREFATT</name>
							<description>Code for VREF Attenuation Factor When VREFSEL is 1, 2 or 5</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VINATT</name>
							<description>Code for VIN Attenuation Factor</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DVL</name>
							<description>Single Channel DV Level Select</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FIFOOFACT</name>
							<description>Single Channel FIFO Overflow Action</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PRSMODE</name>
							<description>Single Channel PRS Trigger Mode</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PRSSEL</name>
							<description>Single Channel PRS Trigger Select</description>
							<bitOffset>17</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PRSCH0</name>
									<description>PRS ch 0 triggers single channel</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH1</name>
									<description>PRS ch 1 triggers single channel</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH2</name>
									<description>PRS ch 2 triggers single channel</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH3</name>
									<description>PRS ch 3 triggers single channel</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH4</name>
									<description>PRS ch 4 triggers single channel</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH5</name>
									<description>PRS ch 5 triggers single channel</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH6</name>
									<description>PRS ch 6 triggers single channel</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH7</name>
									<description>PRS ch 7 triggers single channel</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH8</name>
									<description>PRS ch 8 triggers single channel</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH9</name>
									<description>PRS ch 9 triggers single channel</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH10</name>
									<description>PRS ch 10 triggers single channel</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH11</name>
									<description>PRS ch 11 triggers single channel</description>
									<value>0x0000000B</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CONVSTARTDELAY</name>
							<description>Delay Value for Next Conversion Start If CONVSTARTDELAYEN is Set</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CONVSTARTDELAYEN</name>
							<description>Enable Delaying Next Conversion Start</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
