VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>SCANCTRL</name>
					<description>Scan Control Register</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xAF0000FF</resetMask>
					<fields>
						<field>
							<name>REP</name>
							<description>Scan Sequence Repetitive Mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIFF</name>
							<description>Scan Sequence Differential Mode</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADJ</name>
							<description>Scan Sequence Result Adjustment</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RES</name>
							<description>Scan Sequence Resolution Select</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>12BIT</name>
									<description>12-bit resolution</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8BIT</name>
									<description>8-bit resolution</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6BIT</name>
									<description>6-bit resolution</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVS</name>
									<description>Oversampling enabled. Oversampling rate is set in OVSRSEL</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REF</name>
							<description>Scan Sequence Reference Selection</description>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1V25</name>
									<description>VFS = 1.25V with internal VBGR reference</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2V5</name>
									<description>VFS = 2.5V with internal VBGR reference</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VDD</name>
									<description>VFS = AVDD with AVDD as reference source</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5V</name>
									<description>VFS = 5V with internal VBGR reference</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTSINGLE</name>
									<description>Single ended external reference</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2XEXTDIFF</name>
									<description>Differential external reference, 2x</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2XVDD</name>
									<description>VFS=2xAVDD with AVDD as the reference source</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CONF</name>
									<description>Use SCANCTRLX to configure reference</description>
									<value>0x00000007</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AT</name>
							<description>Scan Acquisition Time</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1CYCLE</name>
									<description>1 conversion clock cycle acquisition time for scan</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2CYCLES</name>
									<description>2 conversion clock cycles acquisition time for scan</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3CYCLES</name>
									<description>3 conversion clock cycles acquisition time for scan</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4CYCLES</name>
									<description>4 conversion clock cycles acquisition time for scan</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8CYCLES</name>
									<description>8 conversion clock cycles acquisition time for scan</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16CYCLES</name>
									<description>16 conversion clock cycles acquisition time for scan</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32CYCLES</name>
									<description>32 conversion clock cycles acquisition time for scan</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>64CYCLES</name>
									<description>64 conversion clock cycles acquisition time for scan</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>128CYCLES</name>
									<description>128 conversion clock cycles acquisition time for scan</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>256CYCLES</name>
									<description>256 conversion clock cycles acquisition time for scan</description>
									<value>0x00000009</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRSEN</name>
							<description>Scan Sequence PRS Trigger Enable</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CMPEN</name>
							<description>Compare Logic Enable for Scan</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCANCTRLX</name>
					<description>Scan Control Register Continued</description>
					<addressOffset>0x01C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0F1F7FFF</resetMask>
					<fields>
						<field>
							<name>VREFSEL</name>
							<description>Scan Channel Reference Selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VBGR</name>
									<description>Internal 0.83V Bandgap reference</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VDDXWATT</name>
									<description>Scaled AVDD: AVDD*(the VREF attenuation factor)</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VREFPWATT</name>
									<description>Scaled singled ended external Vref: ADCn_EXTP*(the VREF attenuation factor)</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VREFP</name>
									<description>Raw single ended external Vref: ADCn_EXTP</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VREFPNWATT</name>
									<description>Scaled differential external Vref from : (ADCn_EXTP-ADCn_EXTN)*(the VREF attenuation factor)</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VREFPN</name>
									<description>Raw differential external Vref from : (ADCn_EXTP-ADCn_EXTN)</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VBGRLOW</name>
									<description>Internal Bandgap reference at low setting 0.78V</description>
									<value>0x00000007</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREFATTFIX</name>
							<description>Enable Fixed Scaling on VREF</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VREFATT</name>
							<description>Code for VREF Attenuation Factor When VREFSEL is 1, 2 or 5</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VINATT</name>
							<description>Code for VIN Attenuation Factor</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DVL</name>
							<description>Scan DV Level Select</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FIFOOFACT</name>
							<description>Scan FIFO Overflow Action</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PRSMODE</name>
							<description>Scan PRS Trigger Mode</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PRSSEL</name>
							<description>Scan Sequence PRS Trigger Select</description>
							<bitOffset>17</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PRSCH0</name>
									<description>PRS ch 0 triggers scan sequence</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH1</name>
									<description>PRS ch 1 triggers scan sequence</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH2</name>
									<description>PRS ch 2 triggers scan sequence</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH3</name>
									<description>PRS ch 3 triggers scan sequence</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH4</name>
									<description>PRS ch 4 triggers scan sequence</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH5</name>
									<description>PRS ch 5 triggers scan sequence</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH6</name>
									<description>PRS ch 6 triggers scan sequence</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH7</name>
									<description>PRS ch 7 triggers scan sequence</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH8</name>
									<description>PRS ch 8 triggers scan sequence</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH9</name>
									<description>PRS ch 9 triggers scan sequence</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH10</name>
									<description>PRS ch 10 triggers scan sequence</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH11</name>
									<description>PRS ch 11 triggers scan sequence</description>
									<value>0x0000000B</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CONVSTARTDELAY</name>
							<description>Delay Next Conversion Start If CONVSTARTDELAYEN is Set</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CONVSTARTDELAYEN</name>
							<description>Enable Delaying Next Conversion Start</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCANMASK</name>
					<description>Scan Sequence Input Mask Register</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SCANINPUTEN</name>
							<description>Scan Sequence Input Mask</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCANINPUTSEL</name>
					<description>Input Selection Register for Scan Mode</description>
					<addressOffset>0x024</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x1F1F1F1F</resetMask>
					<fields>
						<field>
							<name>INPUT0TO7SEL</name>
							<description>Inputs Chosen for ADCn_INPUT7-ADCn_INPUT0 as Referred in SCANMASK</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>APORT0CH0TO7</name>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT0CH8TO15</name>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT1CH0TO7</name>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT1CH8TO15</name>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT1CH16TO23</name>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT1CH24TO31</name>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT2CH0TO7</name>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT2CH8TO15</name>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT2CH16TO23</name>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT2CH24TO31</name>
									<value>0x0000000B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT3CH0TO7</name>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT3CH8TO15</name>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT3CH16TO23</name>
									<value>0x0000000E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT3CH24TO31</name>
									<value>0x0000000F</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT4CH0TO7</name>
									<value>0x00000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT4CH8TO15</name>
									<value>0x00000011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT4CH16TO23</name>
									<value>0x00000012</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT4CH24TO31</name>
									<value>0x00000013</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INPUT8TO15SEL</name>
							<description>Inputs Chosen for ADCn_INPUT8-ADCn_INPUT15 as Referred in SCANMASK</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>APORT0CH0TO7</name>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT0CH8TO15</name>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT1CH0TO7</name>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT1CH8TO15</name>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT1CH16TO23</name>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT1CH24TO31</name>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT2CH0TO7</name>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT2CH8TO15</name>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT2CH16TO23</name>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT2CH24TO31</name>
									<value>0x0000000B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT3CH0TO7</name>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT3CH8TO15</name>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT3CH16TO23</name>
									<value>0x0000000E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT3CH24TO31</name>
									<value>0x0000000F</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT4CH0TO7</name>
									<value>0x00000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT4CH8TO15</name>
									<value>0x00000011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT4CH16TO23</name>
									<value>0x00000012</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT4CH24TO31</name>
									<value>0x00000013</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INPUT16TO23SEL</name>
							<description>Inputs Chosen for ADCn_INPUT16-ADCn_INPUT23 as Referred in SCANMASK</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>APORT0CH0TO7</name>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT0CH8TO15</name>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT1CH0TO7</name>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT1CH8TO15</name>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT1CH16TO23</name>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT1CH24TO31</name>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT2CH0TO7</name>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT2CH8TO15</name>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT2CH16TO23</name>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT2CH24TO31</name>
									<value>0x0000000B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT3CH0TO7</name>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT3CH8TO15</name>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT3CH16TO23</name>
									<value>0x0000000E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT3CH24TO31</name>
									<value>0x0000000F</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT4CH0TO7</name>
									<value>0x00000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT4CH8TO15</name>
									<value>0x00000011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT4CH16TO23</name>
									<value>0x00000012</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT4CH24TO31</name>
									<value>0x00000013</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INPUT24TO31SEL</name>
							<description>Inputs Chosen for ADCn_INPUT24-ADCn_INPUT31 as Referred in SCANMASK</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>APORT0CH0TO7</name>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT0CH8TO15</name>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT1CH0TO7</name>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT1CH8TO15</name>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT1CH16TO23</name>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT1CH24TO31</name>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT2CH0TO7</name>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT2CH8TO15</name>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT2CH16TO23</name>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT2CH24TO31</name>
									<value>0x0000000B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT3CH0TO7</name>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT3CH8TO15</name>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT3CH16TO23</name>
									<value>0x0000000E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT3CH24TO31</name>
									<value>0x0000000F</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT4CH0TO7</name>
									<value>0x00000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT4CH8TO15</name>
									<value>0x00000011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT4CH16TO23</name>
									<value>0x00000012</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APORT4CH24TO31</name>
									<value>0x00000013</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
