VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>SCANNEGSEL</name>
					<description>Negative Input Select Register for Scan</description>
					<addressOffset>0x028</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x000039E4</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>INPUT0NEGSEL</name>
							<description>Negative Input Select Register for ADCn_INPUT0 in Differential Scan Mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INPUT1</name>
									<description>Selects ADCn_INPUT1 as negative channel input</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT3</name>
									<description>Selects ADCn_INPUT3 as negative channel input</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT5</name>
									<description>Selects ADCn_INPUT5 as negative channel input</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT7</name>
									<description>Selects ADCn_INPUT7 as negative channel input</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INPUT2NEGSEL</name>
							<description>Negative Input Select Register for ADCn_INPUT2 in Differential Scan Mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INPUT1</name>
									<description>Selects ADCn_INPUT1 as negative channel input</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT3</name>
									<description>Selects ADCn_INPUT3 as negative channel input</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT5</name>
									<description>Selects ADCn_INPUT5 as negative channel input</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT7</name>
									<description>Selects ADCn_INPUT7 as negative channel input</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INPUT4NEGSEL</name>
							<description>Negative Input Select Register for ADCn_INPUT4 in Differential Scan Mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INPUT1</name>
									<description>Selects ADCn_INPUT1 as negative channel input</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT3</name>
									<description>Selects ADCn_INPUT3 as negative channel input</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT5</name>
									<description>Selects ADCn_INPUT5 as negative channel input</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT7</name>
									<description>Selects ADCn_INPUT7 as negative channel input</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INPUT6NEGSEL</name>
							<description>Negative Input Select Register for ADCn_INPUT1 in Differential Scan Mode</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INPUT1</name>
									<description>Selects ADCn_INPUT1 as negative channel input</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT3</name>
									<description>Selects ADCn_INPUT3 as negative channel input</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT5</name>
									<description>Selects ADCn_INPUT5 as negative channel input</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT7</name>
									<description>Selects ADCn_INPUT7 as negative channel input</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INPUT9NEGSEL</name>
							<description>Negative Input Select Register for ADCn_INPUT9 in Differential Scan Mode</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INPUT8</name>
									<description>Selects ADCn_INPUT8 as negative channel input</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT10</name>
									<description>Selects ADCn_INPUT10 as negative channel input</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT12</name>
									<description>Selects ADCn_INPUT12 as negative channel input</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT14</name>
									<description>Selects ADCn_INPUT14 as negative channel input</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INPUT11NEGSEL</name>
							<description>Negative Input Select Register for ADCn_INPUT11 in Differential Scan Mode</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INPUT8</name>
									<description>Selects ADCn_INPUT8 as negative channel input</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT10</name>
									<description>Selects ADCn_INPUT10 as negative channel input</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT12</name>
									<description>Selects ADCn_INPUT12 as negative channel input</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT14</name>
									<description>Selects ADCn_INPUT14 as negative channel input</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INPUT13NEGSEL</name>
							<description>Negative Input Select Register for ADCn_INPUT13 in Differential Scan Mode</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INPUT8</name>
									<description>Selects ADCn_INPUT8 as negative channel input</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT10</name>
									<description>Selects ADCn_INPUT10 as negative channel input</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT12</name>
									<description>Selects ADCn_INPUT12 as negative channel input</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT14</name>
									<description>Selects ADCn_INPUT14 as negative channel input</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INPUT15NEGSEL</name>
							<description>Negative Input Select Register for ADCn_INPUT15 in Differential Scan Mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INPUT8</name>
									<description>Selects ADCn_INPUT8 as negative channel input</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT10</name>
									<description>Selects ADCn_INPUT10 as negative channel input</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT12</name>
									<description>Selects ADCn_INPUT12 as negative channel input</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT14</name>
									<description>Selects ADCn_INPUT14 as negative channel input</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CMPTHR</name>
					<description>Compare Threshold Register</description>
					<addressOffset>0x02C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADLT</name>
							<description>Less Than Compare Threshold</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADGT</name>
							<description>Greater Than Compare Threshold</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BIASPROG</name>
					<description>Bias Programming Register for Various Analog Blocks Used in ADC Operation</description>
					<addressOffset>0x030</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0001100F</resetMask>
					<fields>
						<field>
							<name>ADCBIASPROG</name>
							<description>Bias Programming Value of Analog ADC Block</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal power (use for 1Msps operation)</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCALE2</name>
									<description>Scaling bias to 1/2</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCALE4</name>
									<description>Scaling bias to 1/4</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCALE8</name>
									<description>Scaling bias to 1/8</description>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCALE16</name>
									<description>Scaling bias to 1/16</description>
									<value>0x0000000E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCALE32</name>
									<description>Scaling bias to 1/32</description>
									<value>0x0000000F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VFAULTCLR</name>
							<description>Clear VREFOF Flag</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GPBIASACC</name>
							<description>Accuracy Setting for the System Bias During ADC Operation</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL</name>
					<description>Calibration Register</description>
					<addressOffset>0x034</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x40784078</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SINGLEOFFSET</name>
							<description>Single Mode Offset Calibration Value for Differential or Positive Single-ended Mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SINGLEOFFSETINV</name>
							<description>Single Mode Offset Calibration Value for Negative Single-ended Mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SINGLEGAIN</name>
							<description>Single Mode Gain Calibration Value</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFSETINVMODE</name>
							<description>Negative Single-ended Offset Calibration is Enabled</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCANOFFSET</name>
							<description>Scan Mode Offset Calibration Value for Differential or Positive Single-ended Mode</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCANOFFSETINV</name>
							<description>Scan Mode Offset Calibration Value for Negative Single-ended Mode</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCANGAIN</name>
							<description>Scan Mode Gain Calibration Value</description>
							<bitOffset>24</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CALEN</name>
							<description>Calibration Mode is Enabled</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IF</name>
					<description>Interrupt Flag Register</description>
					<addressOffset>0x038</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x03030F03</resetMask>
					<fields>
						<field>
							<name>SINGLE</name>
							<description>Single Conversion Complete Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCAN</name>
							<description>Scan Conversion Complete Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SINGLEOF</name>
							<description>Single FIFO Overflow Interrupt Flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCANOF</name>
							<description>Scan FIFO Overflow Interrupt Flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SINGLEUF</name>
							<description>Single FIFO Underflow Interrupt Flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCANUF</name>
							<description>Scan FIFO Underflow Interrupt Flag</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SINGLECMP</name>
							<description>Single Result Compare Match Interrupt Flag</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCANCMP</name>
							<description>Scan Result Compare Match Interrupt Flag</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VREFOV</name>
							<description>VREF Over Voltage Interrupt Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROGERR</name>
							<description>Programming Error Interrupt Flag</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFS</name>
					<description>Interrupt Flag Set Register</description>
					<addressOffset>0x03C</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x03030F00</resetMask>
					<fields>
						<field>
							<name>SINGLEOF</name>
							<description>Set SINGLEOF Interrupt Flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCANOF</name>
							<description>Set SCANOF Interrupt Flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SINGLEUF</name>
							<description>Set SINGLEUF Interrupt Flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCANUF</name>
							<description>Set SCANUF Interrupt Flag</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SINGLECMP</name>
							<description>Set SINGLECMP Interrupt Flag</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCANCMP</name>
							<description>Set SCANCMP Interrupt Flag</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VREFOV</name>
							<description>Set VREFOV Interrupt Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PROGERR</name>
							<description>Set PROGERR Interrupt Flag</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFC</name>
					<description>Interrupt Flag Clear Register</description>
					<addressOffset>0x040</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x03030F00</resetMask>
					<fields>
						<field>
							<name>SINGLEOF</name>
							<description>Clear SINGLEOF Interrupt Flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCANOF</name>
							<description>Clear SCANOF Interrupt Flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SINGLEUF</name>
							<description>Clear SINGLEUF Interrupt Flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCANUF</name>
							<description>Clear SCANUF Interrupt Flag</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SINGLECMP</name>
							<description>Clear SINGLECMP Interrupt Flag</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCANCMP</name>
							<description>Clear SCANCMP Interrupt Flag</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VREFOV</name>
							<description>Clear VREFOV Interrupt Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PROGERR</name>
							<description>Clear PROGERR Interrupt Flag</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IEN</name>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x044</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x03030F03</resetMask>
					<fields>
						<field>
							<name>SINGLE</name>
							<description>SINGLE Interrupt Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCAN</name>
							<description>SCAN Interrupt Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SINGLEOF</name>
							<description>SINGLEOF Interrupt Enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCANOF</name>
							<description>SCANOF Interrupt Enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SINGLEUF</name>
							<description>SINGLEUF Interrupt Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCANUF</name>
							<description>SCANUF Interrupt Enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SINGLECMP</name>
							<description>SINGLECMP Interrupt Enable</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCANCMP</name>
							<description>SCANCMP Interrupt Enable</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VREFOV</name>
							<description>VREFOV Interrupt Enable</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PROGERR</name>
							<description>PROGERR Interrupt Enable</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
