VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>SINGLEDATA</name>
					<description>Single Conversion Result Data</description>
					<addressOffset>0x048</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DATA</name>
							<description>Single Conversion Result Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCANDATA</name>
					<description>Scan Conversion Result Data</description>
					<addressOffset>0x04C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DATA</name>
							<description>Scan Conversion Result Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SINGLEDATAP</name>
					<description>Single Conversion Result Data Peek Register</description>
					<addressOffset>0x050</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATAP</name>
							<description>Single Conversion Result Data Peek</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCANDATAP</name>
					<description>Scan Sequence Result Data Peek Register</description>
					<addressOffset>0x054</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATAP</name>
							<description>Scan Conversion Result Data Peek</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCANDATAX</name>
					<description>Scan Sequence Result Data + Data Source Register</description>
					<addressOffset>0x068</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x001FFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DATA</name>
							<description>Scan Conversion Result Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCANINPUTID</name>
							<description>Scan Conversion Input ID</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCANDATAXP</name>
					<description>Scan Sequence Result Data + Data Source Peek Register</description>
					<addressOffset>0x06C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x001FFFFF</resetMask>
					<fields>
						<field>
							<name>DATAP</name>
							<description>Scan Conversion Result Data Peek</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SCANINPUTIDPEEK</name>
							<description>Scan Conversion Data Source Peek</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>APORTREQ</name>
					<description>APORT Request Status Register</description>
					<addressOffset>0x07C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000003FF</resetMask>
					<fields>
						<field>
							<name>APORT0XREQ</name>
							<description>1 If the Bus Connected to APORT0X is Requested</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT0YREQ</name>
							<description>1 If the Bus Connected to APORT0Y is Requested</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT1XREQ</name>
							<description>1 If the Bus Connected to APORT1X is Requested</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT1YREQ</name>
							<description>1 If the Bus Connected to APORT1Y is Requested</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT2XREQ</name>
							<description>1 If the Bus Connected to APORT2X is Requested</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT2YREQ</name>
							<description>1 If the Bus Connected to APORT2Y is Requested</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT3XREQ</name>
							<description>1 If the Bus Connected to APORT3X is Requested</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT3YREQ</name>
							<description>1 If the Bus Connected to APORT3Y is Requested</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT4XREQ</name>
							<description>1 If the Bus Connected to APORT4X is Requested</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT4YREQ</name>
							<description>1 If the Bus Connected to APORT4Y is Requested</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>APORTCONFLICT</name>
					<description>APORT Conflict Status Register</description>
					<addressOffset>0x080</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000003FF</resetMask>
					<fields>
						<field>
							<name>APORT0XCONFLICT</name>
							<description>1 If the Bus Connected to APORT0X is in Conflict With Another Peripheral</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT0YCONFLICT</name>
							<description>1 If the Bus Connected to APORT0Y is in Conflict With Another Peripheral</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT1XCONFLICT</name>
							<description>1 If the Bus Connected to APORT1X is in Conflict With Another Peripheral</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT1YCONFLICT</name>
							<description>1 If the Bus Connected to APORT1Y is in Conflict With Another Peripheral</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT2XCONFLICT</name>
							<description>1 If the Bus Connected to APORT2X is in Conflict With Another Peripheral</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT2YCONFLICT</name>
							<description>1 If the Bus Connected to APORT2Y is in Conflict With Another Peripheral</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT3XCONFLICT</name>
							<description>1 If the Bus Connected to APORT3X is in Conflict With Another Peripheral</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT3YCONFLICT</name>
							<description>1 If the Bus Connected to APORT3Y is in Conflict With Another Peripheral</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT4XCONFLICT</name>
							<description>1 If the Bus Connected to APORT4X is in Conflict With Another Peripheral</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT4YCONFLICT</name>
							<description>1 If the Bus Connected to APORT4Y is in Conflict With Another Peripheral</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SINGLEFIFOCOUNT</name>
					<description>Single FIFO Count Register</description>
					<addressOffset>0x084</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>SINGLEDC</name>
							<description>Single Data Count</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCANFIFOCOUNT</name>
					<description>Scan FIFO Count Register</description>
					<addressOffset>0x088</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>SCANDC</name>
							<description>Scan Data Count</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SINGLEFIFOCLEAR</name>
					<description>Single FIFO Clear Register</description>
					<addressOffset>0x08C</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>SINGLEFIFOCLEAR</name>
							<description>Clear Single FIFO Content</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCANFIFOCLEAR</name>
					<description>Scan FIFO Clear Register</description>
					<addressOffset>0x090</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>SCANFIFOCLEAR</name>
							<description>Clear Scan FIFO Content</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>APORTMASTERDIS</name>
					<description>APORT Bus Master Disable Register</description>
					<addressOffset>0x094</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000003FC</resetMask>
					<fields>
						<field>
							<name>APORT1XMASTERDIS</name>
							<description>APORT1X Master Disable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>APORT1YMASTERDIS</name>
							<description>APORT1Y Master Disable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>APORT2XMASTERDIS</name>
							<description>APORT2X Master Disable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>APORT2YMASTERDIS</name>
							<description>APORT2Y Master Disable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>APORT3XMASTERDIS</name>
							<description>APORT3X Master Disable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>APORT3YMASTERDIS</name>
							<description>APORT3Y Master Disable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>APORT4XMASTERDIS</name>
							<description>APORT4X Master Disable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>APORT4YMASTERDIS</name>
							<description>APORT4Y Master Disable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
