VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>APORTREQ</name>
					<description>APORT Request Status Register</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000003FF</resetMask>
					<fields>
						<field>
							<name>APORT0XREQ</name>
							<description>1 If the Bus Connected to APORT0X is Requested</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT0YREQ</name>
							<description>1 If the Bus Connected to APORT0Y is Requested</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT1XREQ</name>
							<description>1 If the Bus Connected to APORT2X is Requested</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT1YREQ</name>
							<description>1 If the Bus Connected to APORT1X is Requested</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT2XREQ</name>
							<description>1 If the Bus Connected to APORT2X is Requested</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT2YREQ</name>
							<description>1 If the Bus Connected to APORT2Y is Requested</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT3XREQ</name>
							<description>1 If the Bus Connected to APORT3X is Requested</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT3YREQ</name>
							<description>1 If the Bus Connected to APORT3Y is Requested</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT4XREQ</name>
							<description>1 If the Bus Connected to APORT4X is Requested</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT4YREQ</name>
							<description>1 If the Bus Connected to APORT4Y is Requested</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>APORTCONFLICT</name>
					<description>APORT Conflict Status Register</description>
					<addressOffset>0x024</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000003FF</resetMask>
					<fields>
						<field>
							<name>APORT0XCONFLICT</name>
							<description>1 If the Bus Connected to APORT0X is in Conflict With Another Peripheral</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT0YCONFLICT</name>
							<description>1 If the Bus Connected to APORT0Y is in Conflict With Another Peripheral</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT1XCONFLICT</name>
							<description>1 If the Bus Connected to APORT1X is in Conflict With Another Peripheral</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT1YCONFLICT</name>
							<description>1 If the Bus Connected to APORT1X is in Conflict With Another Peripheral</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT2XCONFLICT</name>
							<description>1 If the Bus Connected to APORT2X is in Conflict With Another Peripheral</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT2YCONFLICT</name>
							<description>1 If the Bus Connected to APORT2Y is in Conflict With Another Peripheral</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT3XCONFLICT</name>
							<description>1 If the Bus Connected to APORT3X is in Conflict With Another Peripheral</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT3YCONFLICT</name>
							<description>1 If the Bus Connected to APORT3Y is in Conflict With Another Peripheral</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT4XCONFLICT</name>
							<description>1 If the Bus Connected to APORT4X is in Conflict With Another Peripheral</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>APORT4YCONFLICT</name>
							<description>1 If the Bus Connected to APORT4Y is in Conflict With Another Peripheral</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HYSTERESIS0</name>
					<description>Hysteresis 0 Register</description>
					<addressOffset>0x028</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x3F3F000F</resetMask>
					<fields>
						<field>
							<name>HYST</name>
							<description>Hysteresis Select When ACMPOUT=0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYST0</name>
									<description>No hysteresis</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST1</name>
									<description>14 mV hysteresis</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST2</name>
									<description>25 mV hysteresis</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST3</name>
									<description>30 mV hysteresis</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>35 mV hysteresis</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST5</name>
									<description>39 mV hysteresis</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST6</name>
									<description>42 mV hysteresis</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST7</name>
									<description>45 mV hysteresis</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>No hysteresis</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST9</name>
									<description>-14 mV hysteresis</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST10</name>
									<description>-25 mV hysteresis</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST11</name>
									<description>-30 mV hysteresis</description>
									<value>0x0000000B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST12</name>
									<description>-35 mV hysteresis</description>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST13</name>
									<description>-39 mV hysteresis</description>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST14</name>
									<description>-42 mV hysteresis</description>
									<value>0x0000000E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST15</name>
									<description>-45 mV hysteresis</description>
									<value>0x0000000F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIVVA</name>
							<description>Divider for VA Voltage When ACMPOUT=0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIVVB</name>
							<description>Divider for VB Voltage When ACMPOUT=0</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HYSTERESIS1</name>
					<description>Hysteresis 1 Register</description>
					<addressOffset>0x02C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x3F3F000F</resetMask>
					<fields>
						<field>
							<name>HYST</name>
							<description>Hysteresis Select When ACMPOUT=1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYST0</name>
									<description>No hysteresis</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST1</name>
									<description>14 mV hysteresis</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST2</name>
									<description>25 mV hysteresis</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST3</name>
									<description>30 mV hysteresis</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>35 mV hysteresis</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST5</name>
									<description>39 mV hysteresis</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST6</name>
									<description>42 mV hysteresis</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST7</name>
									<description>45 mV hysteresis</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>No hysteresis</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST9</name>
									<description>-14 mV hysteresis</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST10</name>
									<description>-25 mV hysteresis</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST11</name>
									<description>-30 mV hysteresis</description>
									<value>0x0000000B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST12</name>
									<description>-35 mV hysteresis</description>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST13</name>
									<description>-39 mV hysteresis</description>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST14</name>
									<description>-42 mV hysteresis</description>
									<value>0x0000000E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST15</name>
									<description>-45 mV hysteresis</description>
									<value>0x0000000F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIVVA</name>
							<description>Divider for VA Voltage When ACMPOUT=1</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIVVB</name>
							<description>Divider for VB Voltage When ACMPOUT=1</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ROUTEPEN</name>
					<description>I/O Routing Pine Enable Register</description>
					<addressOffset>0x040</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>OUTPEN</name>
							<description>ACMP Output Pin Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ROUTELOC0</name>
					<description>I/O Routing Location Register</description>
					<addressOffset>0x044</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>OUTLOC</name>
							<description>I/O Location</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOC0</name>
									<description>Location 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC1</name>
									<description>Location 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC2</name>
									<description>Location 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC3</name>
									<description>Location 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC4</name>
									<description>Location 4</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC5</name>
									<description>Location 5</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC6</name>
									<description>Location 6</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC7</name>
									<description>Location 7</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC8</name>
									<description>Location 8</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC9</name>
									<description>Location 9</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC10</name>
									<description>Location 10</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC11</name>
									<description>Location 11</description>
									<value>0x0000000B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC12</name>
									<description>Location 12</description>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC13</name>
									<description>Location 13</description>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC14</name>
									<description>Location 14</description>
									<value>0x0000000E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC15</name>
									<description>Location 15</description>
									<value>0x0000000F</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC16</name>
									<description>Location 16</description>
									<value>0x00000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC17</name>
									<description>Location 17</description>
									<value>0x00000011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC18</name>
									<description>Location 18</description>
									<value>0x00000012</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC19</name>
									<description>Location 19</description>
									<value>0x00000013</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC20</name>
									<description>Location 20</description>
									<value>0x00000014</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC21</name>
									<description>Location 21</description>
									<value>0x00000015</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC22</name>
									<description>Location 22</description>
									<value>0x00000016</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC23</name>
									<description>Location 23</description>
									<value>0x00000017</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC24</name>
									<description>Location 24</description>
									<value>0x00000018</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC25</name>
									<description>Location 25</description>
									<value>0x00000019</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC26</name>
									<description>Location 26</description>
									<value>0x0000001A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC27</name>
									<description>Location 27</description>
									<value>0x0000001B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC28</name>
									<description>Location 28</description>
									<value>0x0000001C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC29</name>
									<description>Location 29</description>
									<value>0x0000001D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC30</name>
									<description>Location 30</description>
									<value>0x0000001E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC31</name>
									<description>Location 31</description>
									<value>0x0000001F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
