VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>RTCC</name>
			<description>RTCC</description>
			<baseAddress>0x40042000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x00000400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>RTCC</name>
				<value>29</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>Control Register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00039F35</resetMask>
					<fields>
						<field>
							<name>ENABLE</name>
							<description>RTCC Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DEBUGRUN</name>
							<description>Debug Mode Run Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PRECCV0TOP</name>
							<description>Pre-counter CCV0 Top Value Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCV1TOP</name>
							<description>CCV1 Top Value Enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTPRESC</name>
							<description>Counter Prescaler Value</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<description>CLKCNT = LFECLKRTCC/1</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<description>CLKCNT = LFECLKRTCC/2</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<description>CLKCNT = LFECLKRTCC/4</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<description>CLKCNT = LFECLKRTCC/8</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<description>CLKCNT = LFECLKRTCC/16</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
									<description>CLKCNT = LFECLKRTCC/32</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
									<description>CLKCNT = LFECLKRTCC/64</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
									<description>CLKCNT = LFECLKRTCC/128</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV256</name>
									<description>CLKCNT = LFECLKRTCC/256</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV512</name>
									<description>CLKCNT = LFECLKRTCC/512</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV1024</name>
									<description>CLKCNT = LFECLKRTCC/1024</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2048</name>
									<description>CLKCNT = LFECLKRTCC/2048</description>
									<value>0x0000000B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4096</name>
									<description>CLKCNT = LFECLKRTCC/4096</description>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8192</name>
									<description>CLKCNT = LFECLKRTCC/8192</description>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16384</name>
									<description>CLKCNT = LFECLKRTCC/16384</description>
									<value>0x0000000E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32768</name>
									<description>CLKCNT = LFECLKRTCC/32768</description>
									<value>0x0000000F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNTTICK</name>
							<description>Counter Prescaler Mode</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OSCFDETEN</name>
							<description>Oscillator Failure Detection Enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTMODE</name>
							<description>Main Counter Mode</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LYEARCORRDIS</name>
							<description>Leap Year Correction Disabled</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRECNT</name>
					<description>Pre-Counter Value Register</description>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00007FFF</resetMask>
					<fields>
						<field>
							<name>PRECNT</name>
							<description>Pre-Counter Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>15</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<description>Counter Value Register</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Counter Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>COMBCNT</name>
					<description>Combined Pre-Counter and Counter Value Register</description>
					<addressOffset>0x00C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRECNT</name>
							<description>Pre-Counter Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>15</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CNTLSB</name>
							<description>Counter Value</description>
							<bitOffset>15</bitOffset>
							<bitWidth>17</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIME</name>
					<description>Time of Day Register</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x003F7F7F</resetMask>
					<fields>
						<field>
							<name>SECU</name>
							<description>Seconds, Units</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SECT</name>
							<description>Seconds, Tens</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MINU</name>
							<description>Minutes, Units</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MINT</name>
							<description>Minutes, Tens</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HOURU</name>
							<description>Hours, Units</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HOURT</name>
							<description>Hours, Tens</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATE</name>
					<description>Date Register</description>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x07FF1F3F</resetMask>
					<fields>
						<field>
							<name>DAYOMU</name>
							<description>Day of Month, Units</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DAYOMT</name>
							<description>Day of Month, Tens</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MONTHU</name>
							<description>Month, Units</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MONTHT</name>
							<description>Month, Tens</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>YEARU</name>
							<description>Year, Units</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>YEART</name>
							<description>Year, Tens</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DAYOW</name>
							<description>Day of Week</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IF</name>
					<description>RTCC Interrupt Flags</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000007FF</resetMask>
					<fields>
						<field>
							<name>OF</name>
							<description>Overflow Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CC0</name>
							<description>Channel 0 Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CC1</name>
							<description>Channel 1 Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CC2</name>
							<description>Channel 2 Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OSCFAIL</name>
							<description>Oscillator Failure Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CNTTICK</name>
							<description>Main Counter Tick</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MINTICK</name>
							<description>Minute Tick</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HOURTICK</name>
							<description>Hour Tick</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DAYTICK</name>
							<description>Day Tick</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DAYOWOF</name>
							<description>Day of Week Overflow</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MONTHTICK</name>
							<description>Month Tick</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFS</name>
					<description>Interrupt Flag Set Register</description>
					<addressOffset>0x01C</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000007FF</resetMask>
					<fields>
						<field>
							<name>OF</name>
							<description>Set OF Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CC0</name>
							<description>Set CC0 Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CC1</name>
							<description>Set CC1 Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CC2</name>
							<description>Set CC2 Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OSCFAIL</name>
							<description>Set OSCFAIL Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CNTTICK</name>
							<description>Set CNTTICK Interrupt Flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MINTICK</name>
							<description>Set MINTICK Interrupt Flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HOURTICK</name>
							<description>Set HOURTICK Interrupt Flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DAYTICK</name>
							<description>Set DAYTICK Interrupt Flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DAYOWOF</name>
							<description>Set DAYOWOF Interrupt Flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MONTHTICK</name>
							<description>Set MONTHTICK Interrupt Flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFC</name>
					<description>Interrupt Flag Clear Register</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000007FF</resetMask>
					<fields>
						<field>
							<name>OF</name>
							<description>Clear OF Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CC0</name>
							<description>Clear CC0 Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CC1</name>
							<description>Clear CC1 Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CC2</name>
							<description>Clear CC2 Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>OSCFAIL</name>
							<description>Clear OSCFAIL Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CNTTICK</name>
							<description>Clear CNTTICK Interrupt Flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MINTICK</name>
							<description>Clear MINTICK Interrupt Flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HOURTICK</name>
							<description>Clear HOURTICK Interrupt Flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DAYTICK</name>
							<description>Clear DAYTICK Interrupt Flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DAYOWOF</name>
							<description>Clear DAYOWOF Interrupt Flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MONTHTICK</name>
							<description>Clear MONTHTICK Interrupt Flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IEN</name>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x024</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000007FF</resetMask>
					<fields>
						<field>
							<name>OF</name>
							<description>OF Interrupt Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC0</name>
							<description>CC0 Interrupt Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC1</name>
							<description>CC1 Interrupt Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC2</name>
							<description>CC2 Interrupt Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OSCFAIL</name>
							<description>OSCFAIL Interrupt Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTTICK</name>
							<description>CNTTICK Interrupt Enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MINTICK</name>
							<description>MINTICK Interrupt Enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HOURTICK</name>
							<description>HOURTICK Interrupt Enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DAYTICK</name>
							<description>DAYTICK Interrupt Enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DAYOWOF</name>
							<description>DAYOWOF Interrupt Enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MONTHTICK</name>
							<description>MONTHTICK Interrupt Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Status Register</description>
					<addressOffset>0x028</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
				</register>
				<register>
					<name>CMD</name>
					<description>Command Register</description>
					<addressOffset>0x02C</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>CLRSTATUS</name>
							<description>Clear RTCC_STATUS Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYNCBUSY</name>
					<description>Synchronization Busy Register</description>
					<addressOffset>0x030</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000020</resetMask>
					<fields>
						<field>
							<name>CMD</name>
							<description>CMD Register Busy</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>POWERDOWN</name>
					<description>Retention RAM Power-down Register</description>
					<addressOffset>0x034</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>RAM</name>
							<description>Retention RAM Power-down</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LOCK</name>
					<description>Configuration Lock Register</description>
					<addressOffset>0x038</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>LOCKKEY</name>
							<description>Configuration Lock Key</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<value>0x00000001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
