VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>CC2_CTRL</name>
					<description>CC Channel Control Register</description>
					<addressOffset>0x060</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0003FBFF</resetMask>
					<fields>
						<field>
							<name>MODE</name>
							<description>CC Channel Mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>Compare/Capture channel turned off</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUTCAPTURE</name>
									<description>Input capture</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OUTPUTCOMPARE</name>
									<description>Output compare</description>
									<value>0x00000002</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMOA</name>
							<description>Compare Match Output Action</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PULSE</name>
									<description>A single clock cycle pulse is generated on output</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle output on compare match</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear output on compare match</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set output on compare match</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ICEDGE</name>
							<description>Input Capture Edge Select</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISING</name>
									<description>Rising edges detected</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING</name>
									<description>Falling edges detected</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BOTH</name>
									<description>Both edges detected</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NONE</name>
									<description>No edge detection, signal is left as it is</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRSSEL</name>
							<description>Compare/Capture Channel PRS Input Channel Selection</description>
							<bitOffset>6</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PRSCH0</name>
									<description>PRS Channel 0 selected as input</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH1</name>
									<description>PRS Channel 1 selected as input</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH2</name>
									<description>PRS Channel 2 selected as input</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH3</name>
									<description>PRS Channel 3 selected as input</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH4</name>
									<description>PRS Channel 4 selected as input</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH5</name>
									<description>PRS Channel 5 selected as input</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH6</name>
									<description>PRS Channel 6 selected as input</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH7</name>
									<description>PRS Channel 7 selected as input</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH8</name>
									<description>PRS Channel 8 selected as input</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH9</name>
									<description>PRS Channel 9 selected as input</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH10</name>
									<description>PRS Channel 10 selected as input</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH11</name>
									<description>PRS Channel 11 selected as input</description>
									<value>0x0000000B</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COMPBASE</name>
							<description>Capture Compare Channel Comparison Base</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMPMASK</name>
							<description>Capture Compare Channel Comparison Mask</description>
							<bitOffset>12</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DAYCC</name>
							<description>Day Capture/Compare Selection</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC2_CCV</name>
					<description>Capture/Compare Value Register</description>
					<addressOffset>0x064</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CCV</name>
							<description>Capture/Compare Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC2_TIME</name>
					<description>Capture/Compare Time Register</description>
					<addressOffset>0x068</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x003F7F7F</resetMask>
					<fields>
						<field>
							<name>SECU</name>
							<description>Seconds, Units</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SECT</name>
							<description>Seconds, Tens</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MINU</name>
							<description>Minutes, Units</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MINT</name>
							<description>Minutes, Tens</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HOURU</name>
							<description>Hours, Units</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HOURT</name>
							<description>Hours, Tens</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC2_DATE</name>
					<description>Capture/Compare Date Register</description>
					<addressOffset>0x06C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00001F3F</resetMask>
					<fields>
						<field>
							<name>DAYU</name>
							<description>Day of Month/week, Units</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DAYT</name>
							<description>Day of Month/week, Tens</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MONTHU</name>
							<description>Month, Units</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MONTHT</name>
							<description>Month, Tens</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET0_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x104</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET1_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x108</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET2_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x10C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET3_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x110</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET4_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x114</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET5_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x118</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET6_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x11C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET7_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x120</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET8_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x124</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET9_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x128</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET10_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x12C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET11_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x130</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET12_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x134</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET13_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x138</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET14_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x13C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET15_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x140</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET16_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x144</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET17_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x148</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET18_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x14C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET19_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x150</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET20_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x154</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET21_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x158</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET22_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x15C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET23_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x160</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET24_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x164</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET25_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x168</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RET26_REG</name>
					<description>Retention Register</description>
					<addressOffset>0x16C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REG</name>
							<description>General Purpose Retention Register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
