VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>CF</name>
					<description/>
					<addressOffset>0x038</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x3FFFFFFF</resetMask>
					<fields>
						<field>
							<name>DEC0</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DEC1</name>
							<description/>
							<bitOffset>3</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DEC2</name>
							<description/>
							<bitOffset>17</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFOSR</name>
							<description/>
							<bitOffset>23</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DEC1GAIN</name>
							<description/>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESYNCRESETTIMING</name>
							<description/>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESYNCBYPASS</name>
							<description/>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRE</name>
					<description/>
					<addressOffset>0x03C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFF1FFF</resetMask>
					<fields>
						<field>
							<name>BASE</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BASEBITS</name>
							<description/>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PRESYMB4FSK</name>
							<description/>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PREERRORS</name>
							<description/>
							<bitOffset>7</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DSSSPRE</name>
							<description/>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNCSYMB4FSK</name>
							<description/>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXBASES</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYNC0</name>
					<description/>
					<addressOffset>0x040</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SYNC0</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYNC1</name>
					<description/>
					<addressOffset>0x044</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SYNC1</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMING</name>
					<description/>
					<addressOffset>0x048</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TIMTHRESH</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIMINGBASES</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADDTIMSEQ</name>
							<description/>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIMSEQINVEN</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIMSEQSYNC</name>
							<description/>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FDM0THRESH</name>
							<description/>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFSUBNUM</name>
							<description/>
							<bitOffset>21</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFSUBDEN</name>
							<description/>
							<bitOffset>25</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TSAGCDEL</name>
							<description/>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FASTRESYNC</name>
							<description/>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DSSS0</name>
					<description/>
					<addressOffset>0x04C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DSSS0</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MODINDEX</name>
					<description/>
					<addressOffset>0x050</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x003F03FF</resetMask>
					<fields>
						<field>
							<name>MODINDEXM</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODINDEXE</name>
							<description/>
							<bitOffset>5</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FREQGAINE</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FREQGAINM</name>
							<description/>
							<bitOffset>19</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AFC</name>
					<description/>
					<addressOffset>0x054</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00FFFCFF</resetMask>
					<fields>
						<field>
							<name>AFCSCALEM</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFCSCALEE</name>
							<description/>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFCRXMODE</name>
							<description/>
							<bitOffset>10</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFCTXMODE</name>
							<description/>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFCRXCLR</name>
							<description/>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFCDEL</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AFCAVGPER</name>
							<description/>
							<bitOffset>21</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AFCADJLIM</name>
					<description/>
					<addressOffset>0x058</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0003FFFF</resetMask>
					<fields>
						<field>
							<name>AFCADJLIM</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>18</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SHAPING0</name>
					<description/>
					<addressOffset>0x05C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x22130A04</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>COEFF0</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COEFF1</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COEFF2</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COEFF3</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SHAPING1</name>
					<description/>
					<addressOffset>0x060</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x4F4A4132</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>COEFF4</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COEFF5</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COEFF6</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COEFF7</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SHAPING2</name>
					<description/>
					<addressOffset>0x064</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>COEFF8</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAMPCTRL</name>
					<description/>
					<addressOffset>0x068</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000555</resetValue>
					<resetMask>0xFF800FFF</resetMask>
					<fields>
						<field>
							<name>RAMPRATE0</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RAMPRATE1</name>
							<description/>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RAMPRATE2</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RAMPDIS</name>
							<description/>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RAMPVAL</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAMPLEV</name>
					<description/>
					<addressOffset>0x06C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00FFFFFF</resetValue>
					<resetMask>0x00FFFFFF</resetMask>
					<fields>
						<field>
							<name>RAMPLEV0</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RAMPLEV1</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RAMPLEV2</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ROUTEPEN</name>
					<description/>
					<addressOffset>0x070</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000001F</resetMask>
					<fields>
						<field>
							<name>DINPEN</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DOUTPEN</name>
							<description/>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DCLKPEN</name>
							<description/>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ANT0PEN</name>
							<description/>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ANT1PEN</name>
							<description/>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ROUTELOC0</name>
					<description/>
					<addressOffset>0x074</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x003F3F3F</resetMask>
					<fields>
						<field>
							<name>DINLOC</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DOUTLOC</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DCLKLOC</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ROUTELOC1</name>
					<description/>
					<addressOffset>0x078</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00003F3F</resetMask>
					<fields>
						<field>
							<name>ANT0LOC</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ANT1LOC</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IF</name>
					<description/>
					<addressOffset>0x080</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FF07</resetMask>
					<fields>
						<field>
							<name>TXFRAMESENT</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TXSYNCSENT</name>
							<description/>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TXPRESENT</name>
							<description/>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXTIMDET</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXPREDET</name>
							<description/>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXFRAMEDET0</name>
							<description/>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXFRAMEDET1</name>
							<description/>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXTIMLOST</name>
							<description/>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXPRELOST</name>
							<description/>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXFRAMEDETOF</name>
							<description/>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RXTIMNF</name>
							<description/>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFS</name>
					<description/>
					<addressOffset>0x084</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FF07</resetMask>
					<fields>
						<field>
							<name>TXFRAMESENT</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TXSYNCSENT</name>
							<description/>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TXPRESENT</name>
							<description/>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXTIMDET</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXPREDET</name>
							<description/>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXFRAMEDET0</name>
							<description/>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXFRAMEDET1</name>
							<description/>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXTIMLOST</name>
							<description/>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXPRELOST</name>
							<description/>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXFRAMEDETOF</name>
							<description/>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXTIMNF</name>
							<description/>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFC</name>
					<description/>
					<addressOffset>0x088</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FF07</resetMask>
					<fields>
						<field>
							<name>TXFRAMESENT</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TXSYNCSENT</name>
							<description/>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TXPRESENT</name>
							<description/>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXTIMDET</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXPREDET</name>
							<description/>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXFRAMEDET0</name>
							<description/>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXFRAMEDET1</name>
							<description/>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXTIMLOST</name>
							<description/>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXPRELOST</name>
							<description/>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXFRAMEDETOF</name>
							<description/>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RXTIMNF</name>
							<description/>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
