VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>RAM38_RAMDATA</name>
					<description/>
					<addressOffset>0x498</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM39_RAMDATA</name>
					<description/>
					<addressOffset>0x49C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM40_RAMDATA</name>
					<description/>
					<addressOffset>0x4A0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM41_RAMDATA</name>
					<description/>
					<addressOffset>0x4A4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM42_RAMDATA</name>
					<description/>
					<addressOffset>0x4A8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM43_RAMDATA</name>
					<description/>
					<addressOffset>0x4AC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM44_RAMDATA</name>
					<description/>
					<addressOffset>0x4B0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM45_RAMDATA</name>
					<description/>
					<addressOffset>0x4B4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM46_RAMDATA</name>
					<description/>
					<addressOffset>0x4B8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM47_RAMDATA</name>
					<description/>
					<addressOffset>0x4BC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM48_RAMDATA</name>
					<description/>
					<addressOffset>0x4C0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM49_RAMDATA</name>
					<description/>
					<addressOffset>0x4C4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM50_RAMDATA</name>
					<description/>
					<addressOffset>0x4C8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM51_RAMDATA</name>
					<description/>
					<addressOffset>0x4CC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM52_RAMDATA</name>
					<description/>
					<addressOffset>0x4D0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM53_RAMDATA</name>
					<description/>
					<addressOffset>0x4D4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM54_RAMDATA</name>
					<description/>
					<addressOffset>0x4D8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM55_RAMDATA</name>
					<description/>
					<addressOffset>0x4DC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM56_RAMDATA</name>
					<description/>
					<addressOffset>0x4E0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM57_RAMDATA</name>
					<description/>
					<addressOffset>0x4E4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM58_RAMDATA</name>
					<description/>
					<addressOffset>0x4E8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM59_RAMDATA</name>
					<description/>
					<addressOffset>0x4EC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM60_RAMDATA</name>
					<description/>
					<addressOffset>0x4F0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM61_RAMDATA</name>
					<description/>
					<addressOffset>0x4F4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM62_RAMDATA</name>
					<description/>
					<addressOffset>0x4F8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM63_RAMDATA</name>
					<description/>
					<addressOffset>0x4FC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM64_RAMDATA</name>
					<description/>
					<addressOffset>0x500</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM65_RAMDATA</name>
					<description/>
					<addressOffset>0x504</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM66_RAMDATA</name>
					<description/>
					<addressOffset>0x508</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM67_RAMDATA</name>
					<description/>
					<addressOffset>0x50C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM68_RAMDATA</name>
					<description/>
					<addressOffset>0x510</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM69_RAMDATA</name>
					<description/>
					<addressOffset>0x514</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM70_RAMDATA</name>
					<description/>
					<addressOffset>0x518</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM71_RAMDATA</name>
					<description/>
					<addressOffset>0x51C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM72_RAMDATA</name>
					<description/>
					<addressOffset>0x520</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM73_RAMDATA</name>
					<description/>
					<addressOffset>0x524</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM74_RAMDATA</name>
					<description/>
					<addressOffset>0x528</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM75_RAMDATA</name>
					<description/>
					<addressOffset>0x52C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM76_RAMDATA</name>
					<description/>
					<addressOffset>0x530</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM77_RAMDATA</name>
					<description/>
					<addressOffset>0x534</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM78_RAMDATA</name>
					<description/>
					<addressOffset>0x538</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM79_RAMDATA</name>
					<description/>
					<addressOffset>0x53C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM80_RAMDATA</name>
					<description/>
					<addressOffset>0x540</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM81_RAMDATA</name>
					<description/>
					<addressOffset>0x544</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM82_RAMDATA</name>
					<description/>
					<addressOffset>0x548</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM83_RAMDATA</name>
					<description/>
					<addressOffset>0x54C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM84_RAMDATA</name>
					<description/>
					<addressOffset>0x550</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM85_RAMDATA</name>
					<description/>
					<addressOffset>0x554</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM86_RAMDATA</name>
					<description/>
					<addressOffset>0x558</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM87_RAMDATA</name>
					<description/>
					<addressOffset>0x55C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM88_RAMDATA</name>
					<description/>
					<addressOffset>0x560</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM89_RAMDATA</name>
					<description/>
					<addressOffset>0x564</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
