VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SYNTH_CLR</name>
			<description>Frequency synthezicer</description>
			<baseAddress>0x44083000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x00000400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SYNTH</name>
				<value>30</value>
			</interrupt>
			<registers>
				<register>
					<name>STATUS</name>
					<description/>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x057FFF37</resetMask>
					<fields>
						<field>
							<name>INLOCK</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IFFREQEN</name>
							<description/>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SYNTHREADY</name>
							<description/>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AUXINLOCK</name>
							<description/>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AUXRUNNING</name>
							<description/>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CAPCALRUNNING</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CAPCALBITRESULT</name>
							<description/>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CAPCALFULLWAIT</name>
							<description/>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AUXCAPCALRUNNING</name>
							<description/>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AUXCALBITRESULT</name>
							<description/>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AUXCALFULLWAIT</name>
							<description/>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CAPCALERROR</name>
							<description/>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AUXCALERROR</name>
							<description/>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VCOFREQACTIVE</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VCOVARBANK</name>
							<description/>
							<bitOffset>17</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VCOAMPOK</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHPALLOWTRISTATE</name>
							<description/>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMD</name>
					<description/>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000007DF</resetMask>
					<fields>
						<field>
							<name>SYNTHSTART</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SYNTHSTOP</name>
							<description/>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ENABLEIF</name>
							<description/>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DISABLEIF</name>
							<description/>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CAPCALSTART</name>
							<description/>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AUXSTART</name>
							<description/>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AUXSTOP</name>
							<description/>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AUXCAPCALSTART</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VCOUP</name>
							<description/>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VCODOWN</name>
							<description/>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL</name>
					<description/>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0000AC13</resetValue>
					<resetMask>0xE077FFFF</resetMask>
					<fields>
						<field>
							<name>DITHERDSMINPUT</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DITHERDSMOUTPUT</name>
							<description/>
							<bitOffset>1</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DITHERDAC</name>
							<description/>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DSMMODE</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LSBFORCE</name>
							<description/>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LOCKTHRESHOLD</name>
							<description/>
							<bitOffset>10</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUXLOCKTHRESHOLD</name>
							<description/>
							<bitOffset>13</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PRSMUX0</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PRSMUX1</name>
							<description/>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRISTATEPOSTPONE</name>
							<description/>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INTEGERMODE</name>
							<description/>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MMDSCANTESTEN</name>
							<description/>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CALCTRL</name>
					<description/>
					<addressOffset>0x00C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00042801</resetValue>
					<resetMask>0x3F7F7FFF</resetMask>
					<fields>
						<field>
							<name>NUMCYCLES</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPCALSIDE</name>
							<description/>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPCALENDMODE</name>
							<description/>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPCALCYCLEWAIT</name>
							<description/>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPCALWAITMODE</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPCALSINGLESTEP</name>
							<description/>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STARTUPTIMING</name>
							<description/>
							<bitOffset>10</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUXCALCYCLES</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUXCALACCURACY</name>
							<description/>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUXCALCYCLEWAIT</name>
							<description/>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUXCALSINGLESTEP</name>
							<description/>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNTHOVERRIDEEN</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKLOADDENOMVAL</name>
							<description/>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PRESCALERRESETVAL</name>
							<description/>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COUNTERRESETVAL</name>
							<description/>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUXPLLOVERRIDEEN</name>
							<description/>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUXPLLMMDRESETVAL</name>
							<description/>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VCDACCTRL</name>
					<description/>
					<addressOffset>0x024</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000020</resetValue>
					<resetMask>0x0000007F</resetMask>
					<fields>
						<field>
							<name>VCDACVAL</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN</name>
							<description/>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FREQ</name>
					<description/>
					<addressOffset>0x02C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0FFFFFFF</resetMask>
					<fields>
						<field>
							<name>FREQ</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>28</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFFREQ</name>
					<description/>
					<addressOffset>0x030</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x001FFFFF</resetMask>
					<fields>
						<field>
							<name>IFFREQ</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>20</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LOSIDE</name>
							<description/>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIVCTRL</name>
					<description/>
					<addressOffset>0x034</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0x003F01FF</resetMask>
					<fields>
						<field>
							<name>LODIVFREQCTRL</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUXLODIVFREQCTRL</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHCTRL</name>
					<description/>
					<addressOffset>0x038</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>CHNO</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHSP</name>
					<description/>
					<addressOffset>0x03C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0003FFFF</resetMask>
					<fields>
						<field>
							<name>CHSP</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>18</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CALOFFSET</name>
					<description/>
					<addressOffset>0x040</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00007FFF</resetMask>
					<fields>
						<field>
							<name>CALOFFSET</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>15</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VCOTUNING</name>
					<description/>
					<addressOffset>0x044</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000080</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>VCOTUNING</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VCORANGE</name>
					<description/>
					<addressOffset>0x04C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000007F</resetMask>
					<fields>
						<field>
							<name>MODE</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWITCHMODE</name>
							<description/>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HIGHTHRESH</name>
							<description/>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LOWTHRESH</name>
							<description/>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VCOGAIN</name>
					<description/>
					<addressOffset>0x050</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0000001F</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>VCOGAIN</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AUXVCOTUNING</name>
					<description/>
					<addressOffset>0x054</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000007F</resetMask>
					<fields>
						<field>
							<name>AUXVCOTUNING</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AUXFREQ</name>
					<description/>
					<addressOffset>0x058</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000007F</resetMask>
					<fields>
						<field>
							<name>MMDDENOM</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AUXVCDACCTRL</name>
					<description/>
					<addressOffset>0x05C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000007</resetValue>
					<resetMask>0x0000001F</resetMask>
					<fields>
						<field>
							<name>VALUE</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EN</name>
							<description/>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHPDACCTRL</name>
					<description/>
					<addressOffset>0x060</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000001FF</resetMask>
					<fields>
						<field>
							<name>CHPDACVAL</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OVERRIDE</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAPCALCYCLECNT</name>
					<description/>
					<addressOffset>0x064</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000003FF</resetMask>
					<fields>
						<field>
							<name>CAPCALCYCLECNT</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IF</name>
					<description/>
					<addressOffset>0x070</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000001F7</resetMask>
					<fields>
						<field>
							<name>LOCKED</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>UNLOCKED</name>
							<description/>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CAPCALDONE</name>
							<description/>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VCOHIGH</name>
							<description/>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VCOLOW</name>
							<description/>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AUXCAPCALDONE</name>
							<description/>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AUXLOCKED</name>
							<description/>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AUXUNLOCKED</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFS</name>
					<description/>
					<addressOffset>0x074</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000001F7</resetMask>
					<fields>
						<field>
							<name>LOCKED</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>UNLOCKED</name>
							<description/>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CAPCALDONE</name>
							<description/>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VCOHIGH</name>
							<description/>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>VCOLOW</name>
							<description/>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AUXCAPCALDONE</name>
							<description/>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AUXLOCKED</name>
							<description/>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AUXUNLOCKED</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
