VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>CALCTRL</name>
					<description>Calibration Control Register</description>
					<addressOffset>0x050</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0F0F0177</resetMask>
					<fields>
						<field>
							<name>UPSEL</name>
							<description>Calibration Up-counter Select</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HFXO</name>
									<description>Select HFXO as up-counter</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXO</name>
									<description>Select LFXO as up-counter</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFRCO</name>
									<description>Select HFRCO as up-counter</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFRCO</name>
									<description>Select LFRCO as up-counter</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AUXHFRCO</name>
									<description>Select AUXHFRCO as up-counter</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRS</name>
									<description>Select PRS input selected by PRSUPSEL as up-counter</description>
									<value>0x00000005</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DOWNSEL</name>
							<description>Calibration Down-counter Select</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HFCLK</name>
									<description>Select HFCLK for down-counter</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFXO</name>
									<description>Select HFXO for down-counter</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXO</name>
									<description>Select LFXO for down-counter</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFRCO</name>
									<description>Select HFRCO for down-counter</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFRCO</name>
									<description>Select LFRCO for down-counter</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AUXHFRCO</name>
									<description>Select AUXHFRCO for down-counter</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRS</name>
									<description>Select PRS input selected by PRSDOWNSEL as down-counter</description>
									<value>0x00000006</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CONT</name>
							<description>Continuous Calibration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PRSUPSEL</name>
							<description>PRS Select for PRS Input When Selected in UPSEL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PRSCH0</name>
									<description>PRS Channel 0 selected as input</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH1</name>
									<description>PRS Channel 1 selected as input</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH2</name>
									<description>PRS Channel 2 selected as input</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH3</name>
									<description>PRS Channel 3 selected as input</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH4</name>
									<description>PRS Channel 4 selected as input</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH5</name>
									<description>PRS Channel 5 selected as input</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH6</name>
									<description>PRS Channel 6 selected as input</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH7</name>
									<description>PRS Channel 7 selected as input</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH8</name>
									<description>PRS Channel 8 selected as input</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH9</name>
									<description>PRS Channel 9 selected as input</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH10</name>
									<description>PRS Channel 10 selected as input</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH11</name>
									<description>PRS Channel 11 selected as input</description>
									<value>0x0000000B</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRSDOWNSEL</name>
							<description>PRS Select for PRS Input When Selected in DOWNSEL</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PRSCH0</name>
									<description>PRS Channel 0 selected as input</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH1</name>
									<description>PRS Channel 1 selected as input</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH2</name>
									<description>PRS Channel 2 selected as input</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH3</name>
									<description>PRS Channel 3 selected as input</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH4</name>
									<description>PRS Channel 4 selected as input</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH5</name>
									<description>PRS Channel 5 selected as input</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH6</name>
									<description>PRS Channel 6 selected as input</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH7</name>
									<description>PRS Channel 7 selected as input</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH8</name>
									<description>PRS Channel 8 selected as input</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH9</name>
									<description>PRS Channel 9 selected as input</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH10</name>
									<description>PRS Channel 10 selected as input</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRSCH11</name>
									<description>PRS Channel 11 selected as input</description>
									<value>0x0000000B</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CALCNT</name>
					<description>Calibration Counter Register</description>
					<addressOffset>0x054</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000FFFFF</resetMask>
					<fields>
						<field>
							<name>CALCNT</name>
							<description>Calibration Counter</description>
							<bitOffset>0</bitOffset>
							<bitWidth>20</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OSCENCMD</name>
					<description>Oscillator Enable/Disable Command Register</description>
					<addressOffset>0x060</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000003FF</resetMask>
					<fields>
						<field>
							<name>HFRCOEN</name>
							<description>HFRCO Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HFRCODIS</name>
							<description>HFRCO Disable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HFXOEN</name>
							<description>HFXO Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HFXODIS</name>
							<description>HFXO Disable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AUXHFRCOEN</name>
							<description>AUXHFRCO Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AUXHFRCODIS</name>
							<description>AUXHFRCO Disable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LFRCOEN</name>
							<description>LFRCO Enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LFRCODIS</name>
							<description>LFRCO Disable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LFXOEN</name>
							<description>LFXO Enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LFXODIS</name>
							<description>LFXO Disable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMD</name>
					<description>Command Register</description>
					<addressOffset>0x064</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000033</resetMask>
					<fields>
						<field>
							<name>CALSTART</name>
							<description>Calibration Start</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CALSTOP</name>
							<description>Calibration Stop</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HFXOPEAKDETSTART</name>
							<description>HFXO Peak Detection Start</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HFXOSHUNTOPTSTART</name>
							<description>HFXO Shunt Current Optimization Start</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DBGCLKSEL</name>
					<description>Debug Trace Clock Select</description>
					<addressOffset>0x070</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>DBG</name>
							<description>Debug Trace Clock</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>AUXHFRCO</name>
									<description>AUXHFRCO is the debug trace clock</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFCLK</name>
									<description>HFCLK is the debug trace clock</description>
									<value>0x00000001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HFCLKSEL</name>
					<description>High Frequency Clock Select Command Register</description>
					<addressOffset>0x074</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>HF</name>
							<description>HFCLK Select</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HFRCO</name>
									<description>Select HFRCO as HFCLK</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFXO</name>
									<description>Select HFXO as HFCLK</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFRCO</name>
									<description>Select LFRCO as HFCLK</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXO</name>
									<description>Select LFXO as HFCLK</description>
									<value>0x00000004</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>LFACLKSEL</name>
					<description>Low Frequency A Clock Select Register</description>
					<addressOffset>0x080</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>LFA</name>
							<description>Clock Select for LFA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>LFACLK is disabled</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFRCO</name>
									<description>LFRCO selected as LFACLK</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXO</name>
									<description>LFXO selected as LFACLK</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ULFRCO</name>
									<description>ULFRCO selected as LFACLK</description>
									<value>0x00000004</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>LFBCLKSEL</name>
					<description>Low Frequency B Clock Select Register</description>
					<addressOffset>0x084</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>LFB</name>
							<description>Clock Select for LFB</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>LFBCLK is disabled</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFRCO</name>
									<description>LFRCO selected as LFBCLK</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXO</name>
									<description>LFXO selected as LFBCLK</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFCLKLE</name>
									<description>HFCLK divided by two/four is selected as LFBCLK</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ULFRCO</name>
									<description>ULFRCO selected as LFBCLK</description>
									<value>0x00000004</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>LFECLKSEL</name>
					<description>Low Frequency E Clock Select Register</description>
					<addressOffset>0x088</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>LFE</name>
							<description>Clock Select for LFE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>LFECLK is disabled</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFRCO</name>
									<description>LFRCO selected as LFECLK</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXO</name>
									<description>LFXO selected as LFECLK</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ULFRCO</name>
									<description>ULFRCO selected as LFECLK</description>
									<value>0x00000004</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Status Register</description>
					<addressOffset>0x090</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00010003</resetValue>
					<resetMask>0x07E103FF</resetMask>
					<fields>
						<field>
							<name>HFRCOENS</name>
							<description>HFRCO Enable Status</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HFRCORDY</name>
							<description>HFRCO Ready</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HFXOENS</name>
							<description>HFXO Enable Status</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HFXORDY</name>
							<description>HFXO Ready</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AUXHFRCOENS</name>
							<description>AUXHFRCO Enable Status</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AUXHFRCORDY</name>
							<description>AUXHFRCO Ready</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LFRCOENS</name>
							<description>LFRCO Enable Status</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LFRCORDY</name>
							<description>LFRCO Ready</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LFXOENS</name>
							<description>LFXO Enable Status</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LFXORDY</name>
							<description>LFXO Ready</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CALRDY</name>
							<description>Calibration Ready</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HFXOREQ</name>
							<description>HFXO is Required By Hardware</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HFXOPEAKDETRDY</name>
							<description>HFXO Peak Detection Ready</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HFXOSHUNTOPTRDY</name>
							<description>HFXO Shunt Current Optimization Ready</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HFXOAMPHIGH</name>
							<description>HFXO Oscillation Amplitude is Too High</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HFXOAMPLOW</name>
							<description>HFXO Amplitude Tuning Value Too Low</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HFXOREGILOW</name>
							<description>HFXO Regulator Shunt Current Too Low</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
