VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>HFCLKSTATUS</name>
					<description>HFCLK Status Register</description>
					<addressOffset>0x094</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>SELECTED</name>
							<description>HFCLK Selected</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HFRCO</name>
									<description>HFRCO is selected as HFCLK clock source</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFXO</name>
									<description>HFXO is selected as HFCLK clock source</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFRCO</name>
									<description>LFRCO is selected as HFCLK clock source</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXO</name>
									<description>LFXO is selected as HFCLK clock source</description>
									<value>0x00000004</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HFXOTRIMSTATUS</name>
					<description>HFXO Trim Status</description>
					<addressOffset>0x09C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000500</resetValue>
					<resetMask>0x000007FF</resetMask>
					<fields>
						<field>
							<name>IBTRIMXOCORE</name>
							<description>Value of IBTRIMXOCORE Found By Automatic HFXO Peak Detection Algorithm</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>REGISH</name>
							<description>Value of REGISH Found By Automatic HFXO Shunt Current Optimization Algorithm</description>
							<bitOffset>7</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IF</name>
					<description>Interrupt Flag Register</description>
					<addressOffset>0x0A0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0x80007F7F</resetMask>
					<fields>
						<field>
							<name>HFRCORDY</name>
							<description>HFRCO Ready Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HFXORDY</name>
							<description>HFXO Ready Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LFRCORDY</name>
							<description>LFRCO Ready Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LFXORDY</name>
							<description>LFXO Ready Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AUXHFRCORDY</name>
							<description>AUXHFRCO Ready Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CALRDY</name>
							<description>Calibration Ready Interrupt Flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CALOF</name>
							<description>Calibration Overflow Interrupt Flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HFXODISERR</name>
							<description>HFXO Disable Error Interrupt Flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HFXOAUTOSW</name>
							<description>HFXO Automatic Switch Interrupt Flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HFXOPEAKDETERR</name>
							<description>HFXO Automatic Peak Detection Error Interrupt Flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HFXOPEAKDETRDY</name>
							<description>HFXO Automatic Peak Detection Ready Interrupt Flag</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HFXOSHUNTOPTRDY</name>
							<description>HFXO Automatic Shunt Current Optimization Ready Interrupt Flag</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HFRCODIS</name>
							<description>HFRCO Disable Interrupt Flag</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LFTIMEOUTERR</name>
							<description>Low Frequency Timeout Error Interrupt Flag</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CMUERR</name>
							<description>CMU Error Interrupt Flag</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFS</name>
					<description>Interrupt Flag Set Register</description>
					<addressOffset>0x0A4</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x80007F7F</resetMask>
					<fields>
						<field>
							<name>HFRCORDY</name>
							<description>Set HFRCORDY Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HFXORDY</name>
							<description>Set HFXORDY Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LFRCORDY</name>
							<description>Set LFRCORDY Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LFXORDY</name>
							<description>Set LFXORDY Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AUXHFRCORDY</name>
							<description>Set AUXHFRCORDY Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CALRDY</name>
							<description>Set CALRDY Interrupt Flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CALOF</name>
							<description>Set CALOF Interrupt Flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HFXODISERR</name>
							<description>Set HFXODISERR Interrupt Flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HFXOAUTOSW</name>
							<description>Set HFXOAUTOSW Interrupt Flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HFXOPEAKDETERR</name>
							<description>Set HFXOPEAKDETERR Interrupt Flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HFXOPEAKDETRDY</name>
							<description>Set HFXOPEAKDETRDY Interrupt Flag</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HFXOSHUNTOPTRDY</name>
							<description>Set HFXOSHUNTOPTRDY Interrupt Flag</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HFRCODIS</name>
							<description>Set HFRCODIS Interrupt Flag</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LFTIMEOUTERR</name>
							<description>Set LFTIMEOUTERR Interrupt Flag</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CMUERR</name>
							<description>Set CMUERR Interrupt Flag</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFC</name>
					<description>Interrupt Flag Clear Register</description>
					<addressOffset>0x0A8</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x80007F7F</resetMask>
					<fields>
						<field>
							<name>HFRCORDY</name>
							<description>Clear HFRCORDY Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HFXORDY</name>
							<description>Clear HFXORDY Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LFRCORDY</name>
							<description>Clear LFRCORDY Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LFXORDY</name>
							<description>Clear LFXORDY Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AUXHFRCORDY</name>
							<description>Clear AUXHFRCORDY Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CALRDY</name>
							<description>Clear CALRDY Interrupt Flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CALOF</name>
							<description>Clear CALOF Interrupt Flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HFXODISERR</name>
							<description>Clear HFXODISERR Interrupt Flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HFXOAUTOSW</name>
							<description>Clear HFXOAUTOSW Interrupt Flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HFXOPEAKDETERR</name>
							<description>Clear HFXOPEAKDETERR Interrupt Flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HFXOPEAKDETRDY</name>
							<description>Clear HFXOPEAKDETRDY Interrupt Flag</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HFXOSHUNTOPTRDY</name>
							<description>Clear HFXOSHUNTOPTRDY Interrupt Flag</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HFRCODIS</name>
							<description>Clear HFRCODIS Interrupt Flag</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LFTIMEOUTERR</name>
							<description>Clear LFTIMEOUTERR Interrupt Flag</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CMUERR</name>
							<description>Clear CMUERR Interrupt Flag</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IEN</name>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x0AC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x80007F7F</resetMask>
					<fields>
						<field>
							<name>HFRCORDY</name>
							<description>HFRCORDY Interrupt Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HFXORDY</name>
							<description>HFXORDY Interrupt Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LFRCORDY</name>
							<description>LFRCORDY Interrupt Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LFXORDY</name>
							<description>LFXORDY Interrupt Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUXHFRCORDY</name>
							<description>AUXHFRCORDY Interrupt Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CALRDY</name>
							<description>CALRDY Interrupt Enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOF</name>
							<description>CALOF Interrupt Enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HFXODISERR</name>
							<description>HFXODISERR Interrupt Enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HFXOAUTOSW</name>
							<description>HFXOAUTOSW Interrupt Enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HFXOPEAKDETERR</name>
							<description>HFXOPEAKDETERR Interrupt Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HFXOPEAKDETRDY</name>
							<description>HFXOPEAKDETRDY Interrupt Enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HFXOSHUNTOPTRDY</name>
							<description>HFXOSHUNTOPTRDY Interrupt Enable</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HFRCODIS</name>
							<description>HFRCODIS Interrupt Enable</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LFTIMEOUTERR</name>
							<description>LFTIMEOUTERR Interrupt Enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CMUERR</name>
							<description>CMUERR Interrupt Enable</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HFBUSCLKEN0</name>
					<description>High Frequency Bus Clock Enable Register 0</description>
					<addressOffset>0x0B0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003F</resetMask>
					<fields>
						<field>
							<name>LE</name>
							<description>Low Energy Peripheral Interface Clock Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CRYPTO</name>
							<description>Advanced Encryption Standard Accelerator Clock Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GPIO</name>
							<description>General purpose Input/Output Clock Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PRS</name>
							<description>Peripheral Reflex System Clock Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LDMA</name>
							<description>Linked Direct Memory Access Controller Clock Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GPCRC</name>
							<description>General Purpose CRC Clock Enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HFPERCLKEN0</name>
					<description>High Frequency Peripheral Clock Enable Register 0</description>
					<addressOffset>0x0C0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000003FF</resetMask>
					<fields>
						<field>
							<name>TIMER0</name>
							<description>Timer 0 Clock Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIMER1</name>
							<description>Timer 1 Clock Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>USART0</name>
							<description>Universal Synchronous/Asynchronous Receiver/Transmitter 0 Clock Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>USART1</name>
							<description>Universal Synchronous/Asynchronous Receiver/Transmitter 1 Clock Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ACMP0</name>
							<description>Analog Comparator 0 Clock Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ACMP1</name>
							<description>Analog Comparator 1 Clock Enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CRYOTIMER</name>
							<description>CRYOTIMER Clock Enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>I2C0</name>
							<description>I2C 0 Clock Enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ADC0</name>
							<description>Analog to Digital Converter 0 Clock Enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IDAC0</name>
							<description>Current Digital to Analog Converter 0 Clock Enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HFRADIOCLKEN0</name>
					<description>High Frequency Peripheral Clock Enable Register 0</description>
					<addressOffset>0x0C8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000003FF</resetMask>
					<fields>
						<field>
							<name>RADIOCLOCKS</name>
							<description>Radio clocks Clock Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LFACLKEN0</name>
					<description>Low Frequency a Clock Enable Register 0 (Async Reg)</description>
					<addressOffset>0x0E0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>LETIMER0</name>
							<description>Low Energy Timer 0 Clock Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LFBCLKEN0</name>
					<description>Low Frequency B Clock Enable Register 0 (Async Reg)</description>
					<addressOffset>0x0E8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>LEUART0</name>
							<description>Low Energy UART 0 Clock Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LFECLKEN0</name>
					<description>Low Frequency E Clock Enable Register 0 (Async Reg)</description>
					<addressOffset>0x0F0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>RTCC</name>
							<description>Real-Time Counter and Calendar Clock Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
