VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>LFBCLKENMASK0</name>
					<description/>
					<addressOffset>0x1BC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LFBCLKENMASK0</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LFECLKENMASK0</name>
					<description/>
					<addressOffset>0x1C4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LFECLKENMASK0</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PCNTCLKENMASK</name>
					<description/>
					<addressOffset>0x1CC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PCNTCLKENMASK</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TEST</name>
					<description/>
					<addressOffset>0x1D0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TEST</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TESTHFRCOCTRL</name>
					<description/>
					<addressOffset>0x1D4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TESTHFRCOCTRL</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TESTAUXHFRCOCTRL</name>
					<description/>
					<addressOffset>0x1D8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TESTAUXHFRCOCTRL</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TESTLFRCOCTRL</name>
					<description/>
					<addressOffset>0x1DC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TESTLFRCOCTRL</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TESTHFXOCTRL</name>
					<description/>
					<addressOffset>0x1E0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TESTHFXOCTRL</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TESTLFXOCTRL</name>
					<description/>
					<addressOffset>0x1E4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TESTLFXOCTRL</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>CMU_SET</name>
			<description>CMU</description>
			<baseAddress>0x460E4000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x00000400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CMU</name>
				<value>23</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>CMU Control Register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00300000</resetValue>
					<resetMask>0x001101EF</resetMask>
					<fields>
						<field>
							<name>CLKOUTSEL0</name>
							<description>Clock Output Select 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ULFRCO</name>
									<description>ULFRCO (directly from oscillator)</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFRCO</name>
									<description>LFRCO (directly from oscillator)</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXO</name>
									<description>LFXO (directly from oscillator)</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFXO</name>
									<description>HFXO (directly from oscillator)</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFEXPCLK</name>
									<description>HFEXPCLK</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ULFRCOQ</name>
									<description>ULFRCO (qualified)</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFRCOQ</name>
									<description>LFRCO (qualified)</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXOQ</name>
									<description>LFXO (qualified)</description>
									<value>0x0000000B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFRCOQ</name>
									<description>HFRCO (qualified)</description>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AUXHFRCOQ</name>
									<description>AUXHFRCO (qualified)</description>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFXOQ</name>
									<description>HFXO (qualified)</description>
									<value>0x0000000E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFSRCCLK</name>
									<description>HFSRCCLK</description>
									<value>0x0000000F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKOUTSEL1</name>
							<description>Clock Output Select 1</description>
							<bitOffset>5</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ULFRCO</name>
									<description>ULFRCO (directly from oscillator)</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFRCO</name>
									<description>LFRCO (directly from oscillator)</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXO</name>
									<description>LFXO (directly from oscillator)</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFXO</name>
									<description>HFXO (directly from oscillator)</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFEXPCLK</name>
									<description>HFEXPCLK</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ULFRCOQ</name>
									<description>ULFRCO (qualified)</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFRCOQ</name>
									<description>LFRCO (qualified)</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXOQ</name>
									<description>LFXO (qualified)</description>
									<value>0x0000000B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFRCOQ</name>
									<description>HFRCO (qualified)</description>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AUXHFRCOQ</name>
									<description>AUXHFRCO (qualified)</description>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFXOQ</name>
									<description>HFXO (qualified)</description>
									<value>0x0000000E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFSRCCLK</name>
									<description>HFSRCCLK</description>
									<value>0x0000000F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WSHFLE</name>
							<description>Wait State for High-Frequency LE Interface</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HFPERCLKEN</name>
							<description>HFPERCLK Enable</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HFRCOCTRL</name>
					<description>HFRCO Control Register</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xB1481F3C</resetValue>
					<resetMask>0xFFFF3F7F</resetMask>
					<fields>
						<field>
							<name>TUNING</name>
							<description>HFRCO Tuning Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FINETUNING</name>
							<description>HFRCO Fine Tuning Value</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FREQRANGE</name>
							<description>HFRCO Frequency Range</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CMPBIAS</name>
							<description>HFRCO Comparator Bias Current</description>
							<bitOffset>21</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LDOHP</name>
							<description>HFRCO LDO High Power Mode</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKDIV</name>
							<description>Locally Divide HFRCO Clock Output</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<description>Divide by 1.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<description>Divide by 2.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<description>Divide by 4.</description>
									<value>0x00000002</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FINETUNINGEN</name>
							<description>Enable Reference for Fine Tuning</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VREFTC</name>
							<description>HFRCO Temperature Coefficient Trim on Comparator Reference</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AUXHFRCOCTRL</name>
					<description>AUXHFRCO Control Register</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xB1481F3C</resetValue>
					<resetMask>0xFFFF3F7F</resetMask>
					<fields>
						<field>
							<name>TUNING</name>
							<description>AUXHFRCO Tuning Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FINETUNING</name>
							<description>AUXHFRCO Fine Tuning Value</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FREQRANGE</name>
							<description>AUXHFRCO Frequency Range</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CMPBIAS</name>
							<description>AUXHFRCO Comparator Bias Current</description>
							<bitOffset>21</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LDOHP</name>
							<description>AUXHFRCO LDO High Power Mode</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKDIV</name>
							<description>Locally Divide AUXHFRCO Clock Output</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<description>Divide by 1.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<description>Divide by 2.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<description>Divide by 4.</description>
									<value>0x00000002</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FINETUNINGEN</name>
							<description>Enable Reference for Fine Tuning</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VREFTC</name>
							<description>AUXHFRCO Temperature Coefficient Trim on Comparator Reference</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LFRCOCTRL</name>
					<description>LFRCO Control Register</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x81060100</resetValue>
					<resetMask>0xF30701FF</resetMask>
					<fields>
						<field>
							<name>TUNING</name>
							<description>LFRCO Tuning Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENVREF</name>
							<description>Enable Duty Cycling of Vref</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENCHOP</name>
							<description>Enable Comparator Chopping</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENDEM</name>
							<description>Enable Dynamic Element Matching</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIMEOUT</name>
							<description>LFRCO Timeout</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>2CYCLES</name>
									<description>Timeout period of 2 cycles</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16CYCLES</name>
									<description>Timeout period of 16 cycles</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32CYCLES</name>
									<description>Timeout period of 32 cycles</description>
									<value>0x00000002</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GMCCURTUNE</name>
							<description>Tuning of Gmc Current</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HFXOCTRL</name>
					<description>HFXO Control Register</description>
					<addressOffset>0x024</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x37000731</resetMask>
					<fields>
						<field>
							<name>MODE</name>
							<description>HFXO Mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PEAKDETSHUNTOPTMODE</name>
							<description>HFXO Automatic Peak Detection and Shunt Current Optimization Mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>AUTOCMD</name>
									<description>Automatic control of HFXO peak detection and shunt optimization sequences. CMU_CMD HFXOPEAKDETSTART and HFXOSHUNTOPTSTART can also be used.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CMD</name>
									<description>CMU_CMD HFXOPEAKDETSTART and HFXOSHUNTOPTSTART can be used to trigger peak detection and shunt optimization sequences.</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MANUAL</name>
									<description>CMU_HFXOSTEADYSTATECTRL IBTRIMXOCORE, REGISH, REGSELILOW, and PEAKDETEN are under full software control and are allowed to be changed once HFXO is ready.</description>
									<value>0x00000002</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOWPOWER</name>
							<description>Low Power Mode Control</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XTI2GND</name>
							<description>Clamp HFXTAL_N Pin to Ground When HFXO Oscillator is Off</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XTO2GND</name>
							<description>Clamp HFXTAL_P Pin to Ground When HFXO Oscillator is Off</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LFTIMEOUT</name>
							<description>HFXO Low Frequency Timeout</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0CYCLES</name>
									<description>Timeout period of 0 cycles (disabled)</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2CYCLES</name>
									<description>Timeout period of 2 cycles</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4CYCLES</name>
									<description>Timeout period of 4 cycles</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16CYCLES</name>
									<description>Timeout period of 16 cycles</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32CYCLES</name>
									<description>Timeout period of 32 cycles</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>64CYCLES</name>
									<description>Timeout period of 64 cycles</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1KCYCLES</name>
									<description>Timeout period of 1024 cycles</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4KCYCLES</name>
									<description>Timeout period of 4096 cycles</description>
									<value>0x00000007</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AUTOSTARTEM0EM1</name>
							<description>Automatically Start of HFXO Upon EM0/EM1 Entry From EM2/EM3</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AUTOSTARTSELEM0EM1</name>
							<description>Automatically Start and Select of HFXO Upon EM0/EM1 Entry From EM2/EM3</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HFXOCTRL1</name>
					<description>HFXO Control 1</description>
					<addressOffset>0x028</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000240</resetValue>
					<resetMask>0x00000277</resetMask>
					<fields>
						<field>
							<name>PEAKDETTHR</name>
							<description>Sets the Peak Detector amplitude detection threshold levels</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REGLVL</name>
							<description>Reserved for internal use. Do not change.</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XTIBIASEN</name>
							<description>Reserved for internal use. Do not change.</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
