VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>HFPRESC</name>
					<description>High Frequency Clock Prescaler Register</description>
					<addressOffset>0x100</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x01001F00</resetMask>
					<fields>
						<field>
							<name>PRESC</name>
							<description>HFCLK Prescaler</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NODIVISION</name>
									<value>0x00000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HFCLKLEPRESC</name>
							<description>HFCLKLE Prescaler</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV2</name>
									<description>HFCLKLE is HFBUSCLKLE divided by 2.</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<description>HFCLKLE is HFBUSCLKLE divided by 4.</description>
									<value>0x00000001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HFCOREPRESC</name>
					<description>High Frequency Core Clock Prescaler Register</description>
					<addressOffset>0x108</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0001FF00</resetMask>
					<fields>
						<field>
							<name>PRESC</name>
							<description>HFCORECLK Prescaler</description>
							<bitOffset>8</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NODIVISION</name>
									<value>0x00000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HFPERPRESC</name>
					<description>High Frequency Peripheral Clock Prescaler Register</description>
					<addressOffset>0x10C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0001FF00</resetMask>
					<fields>
						<field>
							<name>PRESC</name>
							<description>HFPERCLK Prescaler</description>
							<bitOffset>8</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NODIVISION</name>
									<value>0x00000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HFRADIOPRESC</name>
					<description>Radio Clock Prescaler Register</description>
					<addressOffset>0x110</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0001FF00</resetMask>
					<fields>
						<field>
							<name>PRESC</name>
							<description>HFPERCLK Prescaler</description>
							<bitOffset>8</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NODIVISION</name>
									<value>0x00000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HFEXPPRESC</name>
					<description>High Frequency Export Clock Prescaler Register</description>
					<addressOffset>0x114</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00001F00</resetMask>
					<fields>
						<field>
							<name>PRESC</name>
							<description>HFEXPCLK Prescaler</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NODIVISION</name>
									<value>0x00000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>LFAPRESC0</name>
					<description>Low Frequency a Prescaler Register 0 (Async Reg)</description>
					<addressOffset>0x120</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000000F</resetMask>
					<fields>
						<field>
							<name>LETIMER0</name>
							<description>Low Energy Timer 0 Prescaler</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<description>LFACLKLETIMER0 = LFACLK</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<description>LFACLKLETIMER0 = LFACLK/2</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<description>LFACLKLETIMER0 = LFACLK/4</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<description>LFACLKLETIMER0 = LFACLK/8</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<description>LFACLKLETIMER0 = LFACLK/16</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32</name>
									<description>LFACLKLETIMER0 = LFACLK/32</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV64</name>
									<description>LFACLKLETIMER0 = LFACLK/64</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV128</name>
									<description>LFACLKLETIMER0 = LFACLK/128</description>
									<value>0x00000007</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV256</name>
									<description>LFACLKLETIMER0 = LFACLK/256</description>
									<value>0x00000008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV512</name>
									<description>LFACLKLETIMER0 = LFACLK/512</description>
									<value>0x00000009</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV1024</name>
									<description>LFACLKLETIMER0 = LFACLK/1024</description>
									<value>0x0000000A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2048</name>
									<description>LFACLKLETIMER0 = LFACLK/2048</description>
									<value>0x0000000B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4096</name>
									<description>LFACLKLETIMER0 = LFACLK/4096</description>
									<value>0x0000000C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8192</name>
									<description>LFACLKLETIMER0 = LFACLK/8192</description>
									<value>0x0000000D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16384</name>
									<description>LFACLKLETIMER0 = LFACLK/16384</description>
									<value>0x0000000E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32768</name>
									<description>LFACLKLETIMER0 = LFACLK/32768</description>
									<value>0x0000000F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>LFBPRESC0</name>
					<description>Low Frequency B Prescaler Register 0 (Async Reg)</description>
					<addressOffset>0x128</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>LEUART0</name>
							<description>Low Energy UART 0 Prescaler</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<description>LFBCLKLEUART0 = LFBCLK</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<description>LFBCLKLEUART0 = LFBCLK/2</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<description>LFBCLKLEUART0 = LFBCLK/4</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<description>LFBCLKLEUART0 = LFBCLK/8</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>LFEPRESC0</name>
					<description>Low Frequency E Prescaler Register 0 (Async Reg)</description>
					<addressOffset>0x130</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000000F</resetMask>
					<fields>
						<field>
							<name>RTCC</name>
							<description>Real-Time Counter and Calendar Prescaler</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<description>LFECLKRTCC = LFECLK</description>
									<value>0x00000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYNCBUSY</name>
					<description>Synchronization Busy Register</description>
					<addressOffset>0x140</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x3F050055</resetMask>
					<fields>
						<field>
							<name>LFACLKEN0</name>
							<description>Low Frequency a Clock Enable 0 Busy</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LFAPRESC0</name>
							<description>Low Frequency a Prescaler 0 Busy</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LFBCLKEN0</name>
							<description>Low Frequency B Clock Enable 0 Busy</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LFBPRESC0</name>
							<description>Low Frequency B Prescaler 0 Busy</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LFECLKEN0</name>
							<description>Low Frequency E Clock Enable 0 Busy</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LFEPRESC0</name>
							<description>Low Frequency E Prescaler 0 Busy</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HFRCOBSY</name>
							<description>HFRCO Busy</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AUXHFRCOBSY</name>
							<description>AUXHFRCO Busy</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LFRCOBSY</name>
							<description>LFRCO Busy</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LFRCOVREFBSY</name>
							<description>LFRCO VREF Busy</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HFXOBSY</name>
							<description>HFXO Busy</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LFXOBSY</name>
							<description>LFXO Busy</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FREEZE</name>
					<description>Freeze Register</description>
					<addressOffset>0x144</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>REGFREEZE</name>
							<description>Register Update Freeze</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PCNTCTRL</name>
					<description>PCNT Control Register</description>
					<addressOffset>0x150</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>PCNT0CLKEN</name>
							<description>PCNT0 Clock Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PCNT0CLKSEL</name>
							<description>PCNT0 Clock Select</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LCDCTRL</name>
					<description>LCD Control Register</description>
					<addressOffset>0x154</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LCDCLK</name>
							<description>LCD clocks</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LVDSCTRL</name>
					<description>LVDSCTRL Control Register</description>
					<addressOffset>0x158</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LVDSCLK</name>
							<description>LVDS clocks</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ADCCTRL</name>
					<description>ADC Control Register</description>
					<addressOffset>0x15C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000130</resetMask>
					<fields>
						<field>
							<name>ADC0CLKSEL</name>
							<description>ADC0 Clock Select</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>ADC0 is not clocked</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AUXHFRCO</name>
									<description>AUXHFRCO is clocking ADC0</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFXO</name>
									<description>HFXO is clocking ADC0</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HFSRCCLK</name>
									<description>HFSRCCLK is clocking ADC0</description>
									<value>0x00000003</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC0CLKINV</name>
							<description>Invert Clock Selected By ADC0CLKSEL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ROUTEPEN</name>
					<description>I/O Routing Pin Enable Register</description>
					<addressOffset>0x170</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>CLKOUT0PEN</name>
							<description>CLKOUT0 Pin Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLKOUT1PEN</name>
							<description>CLKOUT1 Pin Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ROUTELOC0</name>
					<description>I/O Routing Location Register</description>
					<addressOffset>0x174</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00003F3F</resetMask>
					<fields>
						<field>
							<name>CLKOUT0LOC</name>
							<description>I/O Location</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOC0</name>
									<description>Location 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC1</name>
									<description>Location 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC2</name>
									<description>Location 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC3</name>
									<description>Location 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC4</name>
									<description>Location 4</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC5</name>
									<description>Location 5</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC6</name>
									<description>Location 6</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC7</name>
									<description>Location 7</description>
									<value>0x00000007</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKOUT1LOC</name>
							<description>I/O Location</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOC0</name>
									<description>Location 0</description>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC1</name>
									<description>Location 1</description>
									<value>0x00000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC2</name>
									<description>Location 2</description>
									<value>0x00000002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC3</name>
									<description>Location 3</description>
									<value>0x00000003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC4</name>
									<description>Location 4</description>
									<value>0x00000004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC5</name>
									<description>Location 5</description>
									<value>0x00000005</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC6</name>
									<description>Location 6</description>
									<value>0x00000006</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOC7</name>
									<description>Location 7</description>
									<value>0x00000007</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>LOCK</name>
					<description>Configuration Lock Register</description>
					<addressOffset>0x180</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>LOCKKEY</name>
							<description>Configuration Lock Key</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<value>0x00000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<value>0x00000001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>RFLOCK0</name>
					<description>RF LOCK Register</description>
					<addressOffset>0x188</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RFLOCK0</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HFBUSCLKENMASK0</name>
					<description/>
					<addressOffset>0x190</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HFBUSCLKENMASK0</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HFPERCLKENMASK0</name>
					<description/>
					<addressOffset>0x198</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HFPERCLKENMASK0</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HFRADIOCLKENMASK0</name>
					<description/>
					<addressOffset>0x1A4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HFRADIOCLKENMASK0</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LFACLKENMASK0</name>
					<description/>
					<addressOffset>0x1B4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LFACLKENMASK0</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
