VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PROTIMER_CLR</name>
			<description>PROTIMER</description>
			<baseAddress>0x44085000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x00000400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PROTIMER</name>
				<value>28</value>
			</interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description/>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x3FF33336</resetMask>
					<fields>
						<field>
							<name>DEBUGRUN</name>
							<description/>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMACLRACT</name>
							<description/>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OSMEN</name>
							<description>One-Shot Mode Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ZEROSTARTEN</name>
							<description>Start from zero enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PRECNTSRC</name>
							<description>Selects clock to Pre-counter</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BASECNTSRC</name>
							<description/>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WRAPCNTSRC</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOUT0SRC</name>
							<description/>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOUT0SYNCSRC</name>
							<description/>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOUT1SRC</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOUT1SYNCSRC</name>
							<description/>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOUT0MODE</name>
							<description>Repeat Mode</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOUT1MODE</name>
							<description>Repeat Mode</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMD</name>
					<description/>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000700F7</resetMask>
					<fields>
						<field>
							<name>START</name>
							<description>Start PROTIMER</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RTCSYNCSTART</name>
							<description>Start PROTIMER Synchronized with RTCC</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>STOP</name>
							<description/>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TOUT0START</name>
							<description/>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TOUT0STOP</name>
							<description/>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TOUT1START</name>
							<description/>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TOUT1STOP</name>
							<description/>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LBTSTART</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LBTSTOP</name>
							<description/>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRSCTRL</name>
					<description/>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000E0E0E</resetMask>
					<fields>
						<field>
							<name>STARTPRSEN</name>
							<description/>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STARTEDGE</name>
							<description/>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STOPPRSEN</name>
							<description/>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STOPEDGE</name>
							<description/>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTCCTRIGGERPRSEN</name>
							<description>Enable RTCC Trigger from PRS.</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTCCTRIGGEREDGE</name>
							<description/>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description/>
					<addressOffset>0x00C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00001FFF</resetMask>
					<fields>
						<field>
							<name>RUNNING</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LBTSYNC</name>
							<description/>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LBTRUNNING</name>
							<description/>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LBTPAUSED</name>
							<description/>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TOUT0RUNNING</name>
							<description/>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TOUT0SYNC</name>
							<description/>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TOUT1RUNNING</name>
							<description/>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TOUT1SYNC</name>
							<description/>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICV0</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICV1</name>
							<description/>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICV2</name>
							<description/>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICV3</name>
							<description/>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICV4</name>
							<description/>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRECNT</name>
					<description/>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>PRECNT</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BASECNT</name>
					<description/>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>BASECNT</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WRAPCNT</name>
					<description/>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WRAPCNT</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BASEPRE</name>
					<description/>
					<addressOffset>0x01C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRECNTV</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BASECNTV</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LWRAPCNT</name>
					<description/>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LWRAPCNT</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRECNTTOPADJ</name>
					<description/>
					<addressOffset>0x024</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>PRECNTTOPADJ</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRECNTTOP</name>
					<description/>
					<addressOffset>0x028</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00FFFF00</resetValue>
					<resetMask>0x00FFFFFF</resetMask>
					<fields>
						<field>
							<name>PRECNTTOPFRAC</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PRECNTTOP</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BASECNTTOP</name>
					<description/>
					<addressOffset>0x02C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0000FFFF</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>BASECNTTOP</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WRAPCNTTOP</name>
					<description/>
					<addressOffset>0x030</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WRAPCNTTOP</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TOUT0CNT</name>
					<description/>
					<addressOffset>0x034</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TOUT0PCNT</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOUT0CNT</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TOUT0CNTTOP</name>
					<description/>
					<addressOffset>0x038</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00FF00FF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TOUT0PCNTTOP</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOUT0CNTTOP</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TOUT0COMP</name>
					<description/>
					<addressOffset>0x03C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TOUT0PCNTCOMP</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOUT0CNTCOMP</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TOUT1CNT</name>
					<description/>
					<addressOffset>0x040</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TOUT1PCNT</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOUT1CNT</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TOUT1CNTTOP</name>
					<description/>
					<addressOffset>0x044</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TOUT1PCNTTOP</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOUT1CNTTOP</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TOUT1COMP</name>
					<description/>
					<addressOffset>0x048</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TOUT1PCNTCOMP</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOUT1CNTCOMP</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LBTCTRL</name>
					<description/>
					<addressOffset>0x04C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0F1F1FFF</resetMask>
					<fields>
						<field>
							<name>STARTEXP</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MAXEXP</name>
							<description/>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCADELAY</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCAREPEAT</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FIXEDBACKOFF</name>
							<description/>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RETRYLIMIT</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LBTPRSCTRL</name>
					<description/>
					<addressOffset>0x050</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x01010100</resetMask>
					<fields>
						<field>
							<name>LBTSTARTPRSEN</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LBTPAUSEPRSEN</name>
							<description>Enable LBT pause commands from PRS.</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LBTSTOPPRSEN</name>
							<description>Enable LBT stop commands from PRS.</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LBTSTATE</name>
					<description/>
					<addressOffset>0x054</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TOUT0PCNT</name>
							<description>TOUT0PCNT value to be saved</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOUT0CNT</name>
							<description>TOUT0CNT value to be saved</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RANDOM</name>
					<description/>
					<addressOffset>0x058</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>RANDOM</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
