VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>RXCTRL</name>
					<description/>
					<addressOffset>0x06C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x1F1F1F1F</resetMask>
					<fields>
						<field>
							<name>RXSETEVENT1</name>
							<description>First event that sets RX req signal</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Request is never set</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ALWAYS</name>
									<description>Does not wait for any particular event</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRECNTOF</name>
									<description>Pre counter overflow</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BASECNTOF</name>
									<description>Base counter overflow</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WRAPCNTOF</name>
									<description>Wrap counter overflow</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOUT0UF</name>
									<description>Timeout counter 0 underflow</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOUT1UF</name>
									<description>Timeout counter 1 underflow</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOUT0MATCH</name>
									<description>Timeout counter 0 match</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOUT1MATCH</name>
									<description>Timeout counter 1 match</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC0</name>
									<description>Channel 0 Capture/Compare event</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC1</name>
									<description>Channel 1 Capture/Compare event</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC2</name>
									<description>Channel 2 Capture/Compare event</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC3</name>
									<description>Channel 3 Capture/Compare event</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC4</name>
									<description>Channel 4 Capture/Compare event</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXDONE</name>
									<description>MOD indicated that TX completed</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXDONE</name>
									<description>FRC indicated that RX completed</description>
									<value>15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXORRXDONE</name>
									<description>MOD/FRC indicated that TX or RX completed</description>
									<value>16</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FDET0</name>
									<description>DEMOD indicated that syncword 0 was detected</description>
									<value>17</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FDET1</name>
									<description>DEMOD indicated that syncword 1 was detected</description>
									<value>18</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FDET0OR1</name>
									<description>DEMOD indicated that syncword 0 or 1 was detected</description>
									<value>19</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LBTSUCCESS</name>
									<description>LBT completed successfully</description>
									<value>20</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LBTRETRY</name>
									<description>LBT detected occupied channel and will try again</description>
									<value>21</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LBTFAILURE</name>
									<description>LBT could not start transmission</description>
									<value>22</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ANYLBT</name>
									<description>Any LBT event</description>
									<value>23</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCAACK</name>
									<description>A CCA measurement completed</description>
									<value>24</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCA</name>
									<description>A CCA measurement completed, and channel was clear</description>
									<value>25</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOTCCA</name>
									<description>A CCA measurement completed, and channel was busy</description>
									<value>26</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOUT0MATCHLBT</name>
									<description>Timeout counter 0 match occurred during LBT operation</description>
									<value>27</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXSETEVENT2</name>
							<description>Second event that sets RX req signal</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RXCLREVENT1</name>
							<description>First event that clears RX req signal</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RXCLREVENT2</name>
							<description>Second event that clears RX req signal</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXCTRL</name>
					<description/>
					<addressOffset>0x070</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00001F1F</resetMask>
					<fields>
						<field>
							<name>TXSETEVENT1</name>
							<description>First event that sets TX req signal</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Request is never set</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ALWAYS</name>
									<description>Does not wait for any particular event</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRECNTOF</name>
									<description>Pre counter overflow</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BASECNTOF</name>
									<description>Base counter overflow</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WRAPCNTOF</name>
									<description>Wrap counter overflow</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOUT0UF</name>
									<description>Timeout counter 0 underflow</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOUT1UF</name>
									<description>Timeout counter 1 underflow</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOUT0MATCH</name>
									<description>Timeout counter 0 match</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOUT1MATCH</name>
									<description>Timeout counter 1 match</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC0</name>
									<description>Channel 0 Capture/Compare event</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC1</name>
									<description>Channel 1 Capture/Compare event</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC2</name>
									<description>Channel 2 Capture/Compare event</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC3</name>
									<description>Channel 3 Capture/Compare event</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC4</name>
									<description>Channel 4 Capture/Compare event</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXDONE</name>
									<description>MOD indicated that TX completed</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXDONE</name>
									<description>FRC indicated that RX completed</description>
									<value>15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXORRXDONE</name>
									<description>MOD/FRC indicated that TX or RX completed</description>
									<value>16</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FDET0</name>
									<description>DEMOD indicated that syncword 0 was detected</description>
									<value>17</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FDET1</name>
									<description>DEMOD indicated that syncword 1 was detected</description>
									<value>18</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FDET0OR1</name>
									<description>DEMOD indicated that syncword 0 or 1 was detected</description>
									<value>19</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LBTSUCCESS</name>
									<description>LBT completed successfully</description>
									<value>20</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LBTRETRY</name>
									<description>LBT detected occupied channel and will try again</description>
									<value>21</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LBTFAILURE</name>
									<description>LBT could not start transmission</description>
									<value>22</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ANYLBT</name>
									<description>Any LBT event</description>
									<value>23</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCAACK</name>
									<description>A CCA measurement completed</description>
									<value>24</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCA</name>
									<description>A CCA measurement completed, and channel was clear</description>
									<value>25</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOTCCA</name>
									<description>A CCA measurement completed, and channel was busy</description>
									<value>26</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOUT0MATCHLBT</name>
									<description>Timeout counter 0 match occurred during LBT operation</description>
									<value>27</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXSETEVENT2</name>
							<description>Second event that sets TX req signal</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC0_CTRL</name>
					<description/>
					<addressOffset>0x074</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x07E07F7F</resetMask>
					<fields>
						<field>
							<name>ENABLE</name>
							<description>Channel Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCMODE</name>
							<description>Compare/Capture mode</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>COMPARE</name>
									<description>Compare mode selected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAPTURE</name>
									<description>Capture mode selected</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PREMATCHEN</name>
							<description>Enable PRECNT matching</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BASEMATCHEN</name>
							<description>Enable BASECNT matching</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WRAPMATCHEN</name>
							<description>Enable WRAPCNT matching</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OIST</name>
							<description>Output Initial State</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OUTINV</name>
							<description>Output Invert</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOA</name>
							<description>Match Output Action</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>No action on compare match</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle output on compare match in COMPARE mode.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear output on compare match in COMPARE mode.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set output on compare match in COMPARE mode.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OFOA</name>
							<description>Overflow Output Action</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>No action</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle output when the selected counter has an overflow event.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear output when the selected counter has an overflow event.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set output when the selected counter has an overflow event.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OFSEL</name>
							<description>Select counter for OFOA bits</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PRECNT</name>
									<description>Use PRECNT overflow</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BASECNT</name>
									<description>Use BASECNT overflow</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WRAPCNT</name>
									<description>Use WRAPCNT overflow</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRSCONF</name>
							<description>PRS Configuration</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PULSE</name>
									<description>Each CC event will generate a one HFRADIOCLK cycle high pulse</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL</name>
									<description>Should be used when OFSEL, OFOA or MOA are specified.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INSEL</name>
							<description>Capture input selection</description>
							<bitOffset>21</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PRS</name>
									<description>Use the selected PRS channel</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXDONE</name>
									<description>TX completed</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXDONE</name>
									<description>RX completed</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXORRXDONE</name>
									<description>TX or RX completed</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FRAMEDET0</name>
									<description>Demodulator found sync word 0</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FRAMEDET1</name>
									<description>Demodulator found sync word 1</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FDET0OR1</name>
									<description>Demodulator found sync word 0 or 1</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODSYNCSENT</name>
									<description>Modulator sync word sent</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXEOF</name>
									<description>RX at end of frame from demodulator</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRORTC0</name>
									<description>PRORTC capture/compare 0</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRORTC1</name>
									<description>PRORTC capture/compare 1</description>
									<value>10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ICEDGE</name>
							<description>Input Capture Edge Select</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISING</name>
									<description>Rising edges detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING</name>
									<description>Falling edges detected</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BOTH</name>
									<description>Both edges detected</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>No edge detection, signal is left as it is</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CC0_PRE</name>
					<description/>
					<addressOffset>0x078</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>PRE</name>
							<description>CC Channel PRE Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC0_BASE</name>
					<description/>
					<addressOffset>0x07C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>BASE</name>
							<description>CC Channel BASE Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC0_WRAP</name>
					<description/>
					<addressOffset>0x080</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WRAP</name>
							<description>CC Channel WRAP Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
