VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>CC3_CTRL</name>
					<description/>
					<addressOffset>0x0A4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x07E07F7F</resetMask>
					<fields>
						<field>
							<name>ENABLE</name>
							<description>Channel Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCMODE</name>
							<description>Compare/Capture mode</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>COMPARE</name>
									<description>Compare mode selected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAPTURE</name>
									<description>Capture mode selected</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PREMATCHEN</name>
							<description>Enable PRECNT matching</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BASEMATCHEN</name>
							<description>Enable BASECNT matching</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WRAPMATCHEN</name>
							<description>Enable WRAPCNT matching</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OIST</name>
							<description>Output Initial State</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OUTINV</name>
							<description>Output Invert</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOA</name>
							<description>Match Output Action</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>No action on compare match</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle output on compare match in COMPARE mode.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear output on compare match in COMPARE mode.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set output on compare match in COMPARE mode.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OFOA</name>
							<description>Overflow Output Action</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>No action</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle output when the selected counter has an overflow event.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear output when the selected counter has an overflow event.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set output when the selected counter has an overflow event.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OFSEL</name>
							<description>Select counter for OFOA bits</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PRECNT</name>
									<description>Use PRECNT overflow</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BASECNT</name>
									<description>Use BASECNT overflow</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WRAPCNT</name>
									<description>Use WRAPCNT overflow</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRSCONF</name>
							<description>PRS Configuration</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PULSE</name>
									<description>Each CC event will generate a one HFRADIOCLK cycle high pulse</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL</name>
									<description>Should be used when OFSEL, OFOA or MOA are specified.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INSEL</name>
							<description>Capture input selection</description>
							<bitOffset>21</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PRS</name>
									<description>Use the selected PRS channel</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXDONE</name>
									<description>TX completed</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXDONE</name>
									<description>RX completed</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXORRXDONE</name>
									<description>TX or RX completed</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FRAMEDET0</name>
									<description>Demodulator found sync word 0</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FRAMEDET1</name>
									<description>Demodulator found sync word 1</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FDET0OR1</name>
									<description>Demodulator found sync word 0 or 1</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODSYNCSENT</name>
									<description>Modulator sync word sent</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXEOF</name>
									<description>RX at end of frame from demodulator</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRORTC0</name>
									<description>PRORTC capture/compare 0</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRORTC1</name>
									<description>PRORTC capture/compare 1</description>
									<value>10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ICEDGE</name>
							<description>Input Capture Edge Select</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISING</name>
									<description>Rising edges detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING</name>
									<description>Falling edges detected</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BOTH</name>
									<description>Both edges detected</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>No edge detection, signal is left as it is</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CC3_PRE</name>
					<description/>
					<addressOffset>0x0A8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>PRE</name>
							<description>CC Channel PRE Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC3_BASE</name>
					<description/>
					<addressOffset>0x0AC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>BASE</name>
							<description>CC Channel BASE Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC3_WRAP</name>
					<description/>
					<addressOffset>0x0B0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WRAP</name>
							<description>CC Channel WRAP Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC4_CTRL</name>
					<description/>
					<addressOffset>0x0B4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x07E07F7F</resetMask>
					<fields>
						<field>
							<name>ENABLE</name>
							<description>Channel Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCMODE</name>
							<description>Compare/Capture mode</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>COMPARE</name>
									<description>Compare mode selected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAPTURE</name>
									<description>Capture mode selected</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PREMATCHEN</name>
							<description>Enable PRECNT matching</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BASEMATCHEN</name>
							<description>Enable BASECNT matching</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WRAPMATCHEN</name>
							<description>Enable WRAPCNT matching</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OIST</name>
							<description>Output Initial State</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OUTINV</name>
							<description>Output Invert</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOA</name>
							<description>Match Output Action</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>No action on compare match</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle output on compare match in COMPARE mode.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear output on compare match in COMPARE mode.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set output on compare match in COMPARE mode.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OFOA</name>
							<description>Overflow Output Action</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>No action</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle output when the selected counter has an overflow event.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear output when the selected counter has an overflow event.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set output when the selected counter has an overflow event.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OFSEL</name>
							<description>Select counter for OFOA bits</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PRECNT</name>
									<description>Use PRECNT overflow</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BASECNT</name>
									<description>Use BASECNT overflow</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WRAPCNT</name>
									<description>Use WRAPCNT overflow</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRSCONF</name>
							<description>PRS Configuration</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PULSE</name>
									<description>Each CC event will generate a one HFRADIOCLK cycle high pulse</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL</name>
									<description>Should be used when OFSEL, OFOA or MOA are specified.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INSEL</name>
							<description>Capture input selection</description>
							<bitOffset>21</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PRS</name>
									<description>Use the selected PRS channel</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXDONE</name>
									<description>TX completed</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXDONE</name>
									<description>RX completed</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXORRXDONE</name>
									<description>TX or RX completed</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FRAMEDET0</name>
									<description>Demodulator found sync word 0</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FRAMEDET1</name>
									<description>Demodulator found sync word 1</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FDET0OR1</name>
									<description>Demodulator found sync word 0 or 1</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODSYNCSENT</name>
									<description>Modulator sync word sent</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXEOF</name>
									<description>RX at end of frame from demodulator</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRORTC0</name>
									<description>PRORTC capture/compare 0</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRORTC1</name>
									<description>PRORTC capture/compare 1</description>
									<value>10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ICEDGE</name>
							<description>Input Capture Edge Select</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISING</name>
									<description>Rising edges detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING</name>
									<description>Falling edges detected</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BOTH</name>
									<description>Both edges detected</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>No edge detection, signal is left as it is</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CC4_PRE</name>
					<description/>
					<addressOffset>0x0B8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>PRE</name>
							<description>CC Channel PRE Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC4_BASE</name>
					<description/>
					<addressOffset>0x0BC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000FFFF</resetMask>
					<fields>
						<field>
							<name>BASE</name>
							<description>CC Channel BASE Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC4_WRAP</name>
					<description/>
					<addressOffset>0x0C0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WRAP</name>
							<description>CC Channel WRAP Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
