VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>BUFC</name>
			<description>Buffer controller</description>
			<baseAddress>0x40081000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x00000400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>BUFC</name>
				<value>7</value>
			</interrupt>
			<registers>
				<register>
					<name>BUF0_CTRL</name>
					<description/>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>SIZE</name>
							<description>Buffer Size</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SIZE64</name>
									<description>Sets Buffer size to 64 bytes</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE128</name>
									<description>Sets Buffer size to 128 bytes</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE256</name>
									<description>Sets Buffer size to 256 bytes</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE512</name>
									<description>Sets Buffer size to 512 bytes</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE1024</name>
									<description>Sets Buffer size to 1024 bytes</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE2048</name>
									<description>Sets Buffer size to 2048 bytes</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE4096</name>
									<description>Sets Buffer size to 4096 bytes</description>
									<value>6</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF0_ADDR</name>
					<description/>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00FFFFFF</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Buffer Address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF0_WRITEOFFSET</name>
					<description/>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00001FFF</resetMask>
					<fields>
						<field>
							<name>WRITEOFFSET</name>
							<description>Write Offset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF0_READOFFSET</name>
					<description/>
					<addressOffset>0x00C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00001FFF</resetMask>
					<fields>
						<field>
							<name>READOFFSET</name>
							<description>Read Offset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF0_WRITESTART</name>
					<description/>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WRITESTART</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF0_READDATA</name>
					<description/>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>READDATA</name>
							<description>Buffer Read Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF0_WRITEDATA</name>
					<description/>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>WRITEDATA</name>
							<description>Buffer Write Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF0_XWRITE</name>
					<description/>
					<addressOffset>0x01C</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>XORWRITEDATA</name>
							<description>Buffer XOR Write Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF0_STATUS</name>
					<description/>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00111FFF</resetMask>
					<fields>
						<field>
							<name>BYTES</name>
							<description>Number of Bytes in the Buffer</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>THRESHOLDFLAG</name>
							<description>Buffer Threshold Flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF0_THRESHOLDCTRL</name>
					<description/>
					<addressOffset>0x024</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00002FFF</resetMask>
					<fields>
						<field>
							<name>THRESHOLD</name>
							<description>Buffer Threshold Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>THRESHOLDMODE</name>
							<description>Buffer Threshold Mode</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LARGER</name>
									<description>THRESHOLDIF will be set if BYTES is larger than THRESHOLD</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LESSOREQUAL</name>
									<description>THRESHOLDIF will be set if BYTES is less than or equal to THRESHOLD</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF0_CMD</name>
					<description/>
					<addressOffset>0x028</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000000F</resetMask>
					<fields>
						<field>
							<name>CLEAR</name>
							<description>Buffer Clear</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PREFETCH</name>
							<description>Prefetch</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF1_CTRL</name>
					<description/>
					<addressOffset>0x030</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>SIZE</name>
							<description>Buffer Size</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SIZE64</name>
									<description>Sets Buffer size to 64 bytes</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE128</name>
									<description>Sets Buffer size to 128 bytes</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE256</name>
									<description>Sets Buffer size to 256 bytes</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE512</name>
									<description>Sets Buffer size to 512 bytes</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE1024</name>
									<description>Sets Buffer size to 1024 bytes</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE2048</name>
									<description>Sets Buffer size to 2048 bytes</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE4096</name>
									<description>Sets Buffer size to 4096 bytes</description>
									<value>6</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF1_ADDR</name>
					<description/>
					<addressOffset>0x034</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00FFFFFF</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Buffer Address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF1_WRITEOFFSET</name>
					<description/>
					<addressOffset>0x038</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00001FFF</resetMask>
					<fields>
						<field>
							<name>WRITEOFFSET</name>
							<description>Write Offset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF1_READOFFSET</name>
					<description/>
					<addressOffset>0x03C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00001FFF</resetMask>
					<fields>
						<field>
							<name>READOFFSET</name>
							<description>Read Offset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF1_WRITESTART</name>
					<description/>
					<addressOffset>0x040</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WRITESTART</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF1_READDATA</name>
					<description/>
					<addressOffset>0x044</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>READDATA</name>
							<description>Buffer Read Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF1_WRITEDATA</name>
					<description/>
					<addressOffset>0x048</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>WRITEDATA</name>
							<description>Buffer Write Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF1_XWRITE</name>
					<description/>
					<addressOffset>0x04C</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>XORWRITEDATA</name>
							<description>Buffer XOR Write Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF1_STATUS</name>
					<description/>
					<addressOffset>0x050</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00111FFF</resetMask>
					<fields>
						<field>
							<name>BYTES</name>
							<description>Number of Bytes in the Buffer</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>THRESHOLDFLAG</name>
							<description>Buffer Threshold Flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF1_THRESHOLDCTRL</name>
					<description/>
					<addressOffset>0x054</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00002FFF</resetMask>
					<fields>
						<field>
							<name>THRESHOLD</name>
							<description>Buffer Threshold Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>THRESHOLDMODE</name>
							<description>Buffer Threshold Mode</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LARGER</name>
									<description>THRESHOLDIF will be set if BYTES is larger than THRESHOLD</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LESSOREQUAL</name>
									<description>THRESHOLDIF will be set if BYTES is less than or equal to THRESHOLD</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF1_CMD</name>
					<description/>
					<addressOffset>0x058</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000000F</resetMask>
					<fields>
						<field>
							<name>CLEAR</name>
							<description>Buffer Clear</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PREFETCH</name>
							<description>Prefetch</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF2_CTRL</name>
					<description/>
					<addressOffset>0x060</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>SIZE</name>
							<description>Buffer Size</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SIZE64</name>
									<description>Sets Buffer size to 64 bytes</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE128</name>
									<description>Sets Buffer size to 128 bytes</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE256</name>
									<description>Sets Buffer size to 256 bytes</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE512</name>
									<description>Sets Buffer size to 512 bytes</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE1024</name>
									<description>Sets Buffer size to 1024 bytes</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE2048</name>
									<description>Sets Buffer size to 2048 bytes</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE4096</name>
									<description>Sets Buffer size to 4096 bytes</description>
									<value>6</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF2_ADDR</name>
					<description/>
					<addressOffset>0x064</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00FFFFFF</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Buffer Address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF2_WRITEOFFSET</name>
					<description/>
					<addressOffset>0x068</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00001FFF</resetMask>
					<fields>
						<field>
							<name>WRITEOFFSET</name>
							<description>Write Offset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF2_READOFFSET</name>
					<description/>
					<addressOffset>0x06C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00001FFF</resetMask>
					<fields>
						<field>
							<name>READOFFSET</name>
							<description>Read Offset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF2_WRITESTART</name>
					<description/>
					<addressOffset>0x070</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WRITESTART</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF2_READDATA</name>
					<description/>
					<addressOffset>0x074</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>READDATA</name>
							<description>Buffer Read Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF2_WRITEDATA</name>
					<description/>
					<addressOffset>0x078</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>WRITEDATA</name>
							<description>Buffer Write Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF2_XWRITE</name>
					<description/>
					<addressOffset>0x07C</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>XORWRITEDATA</name>
							<description>Buffer XOR Write Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF2_STATUS</name>
					<description/>
					<addressOffset>0x080</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00111FFF</resetMask>
					<fields>
						<field>
							<name>BYTES</name>
							<description>Number of Bytes in the Buffer</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>THRESHOLDFLAG</name>
							<description>Buffer Threshold Flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF2_THRESHOLDCTR</name>
					<description/>
					<addressOffset>0x084</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00002FFF</resetMask>
					<fields>
						<field>
							<name>THRESHOLD</name>
							<description>Buffer Threshold Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>THRESHOLDMODE</name>
							<description>Buffer Threshold Mode</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LARGER</name>
									<description>THRESHOLDIF will be set if BYTES is larger than THRESHOLD</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LESSOREQUAL</name>
									<description>THRESHOLDIF will be set if BYTES is less than or equal to THRESHOLD</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF2_CMD</name>
					<description/>
					<addressOffset>0x088</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000000F</resetMask>
					<fields>
						<field>
							<name>CLEAR</name>
							<description>Buffer Clear</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PREFETCH</name>
							<description>Prefetch</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
