VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>BUF3_CTRL</name>
					<description/>
					<addressOffset>0x090</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000007F</resetMask>
					<fields>
						<field>
							<name>SIZE</name>
							<description>Buffer Size</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SIZE64</name>
									<description>Sets Buffer size to 64 bytes</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE128</name>
									<description>Sets Buffer size to 128 bytes</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE256</name>
									<description>Sets Buffer size to 256 bytes</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE512</name>
									<description>Sets Buffer size to 512 bytes</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE1024</name>
									<description>Sets Buffer size to 1024 bytes</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE2048</name>
									<description>Sets Buffer size to 2048 bytes</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIZE4096</name>
									<description>Sets Buffer size to 4096 bytes</description>
									<value>6</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF3_ADDR</name>
					<description/>
					<addressOffset>0x094</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00FFFFFF</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Buffer Address</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF3_WRITEOFFSET</name>
					<description/>
					<addressOffset>0x098</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00001FFF</resetMask>
					<fields>
						<field>
							<name>WRITEOFFSET</name>
							<description>Write Offset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF3_READOFFSET</name>
					<description/>
					<addressOffset>0x09C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00001FFF</resetMask>
					<fields>
						<field>
							<name>READOFFSET</name>
							<description>Read Offset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF3_WRITESTART</name>
					<description/>
					<addressOffset>0x0A0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WRITESTART</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF3_READDATA</name>
					<description/>
					<addressOffset>0x0A4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>READDATA</name>
							<description>Buffer Read Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF3_WRITEDATA</name>
					<description/>
					<addressOffset>0x0A8</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>WRITEDATA</name>
							<description>Buffer Write Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF3_XWRITE</name>
					<description/>
					<addressOffset>0x0AC</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000FF</resetMask>
					<fields>
						<field>
							<name>XORWRITEDATA</name>
							<description>Buffer XOR Write Data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF3_STATUS</name>
					<description/>
					<addressOffset>0x0B0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00111FFF</resetMask>
					<fields>
						<field>
							<name>BYTES</name>
							<description>Number of Bytes in the Buffer</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>THRESHOLDFLAG</name>
							<description>Buffer Threshold Flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF3_THRESHOLDCTRL</name>
					<description/>
					<addressOffset>0x0B4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00002FFF</resetMask>
					<fields>
						<field>
							<name>THRESHOLD</name>
							<description>Buffer Threshold Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>THRESHOLDMODE</name>
							<description>Buffer Threshold Mode</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LARGER</name>
									<description>THRESHOLDIF will be set if BYTES is larger than THRESHOLD</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LESSOREQUAL</name>
									<description>THRESHOLDIF will be set if BYTES is less than or equal to THRESHOLD</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF3_CMD</name>
					<description/>
					<addressOffset>0x0B8</addressOffset>
					<size>32</size>
					<access>
						write-only
						write-only
					</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000000F</resetMask>
					<fields>
						<field>
							<name>CLEAR</name>
							<description>Buffer Clear</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PREFETCH</name>
							<description>Prefetch</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IF</name>
					<description/>
					<addressOffset>0x0E0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x8F0F0F0F</resetMask>
					<fields>
						<field>
							<name>BUF0OF</name>
							<description>Buffer 0 Overflow</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF0UF</name>
							<description>Buffer 0 Underflow</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF0THR</name>
							<description>Buffer 0 Threshold Event</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF0CORR</name>
							<description>Buffer 0 Corrupt</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF1OF</name>
							<description>Buffer 1 Overflow</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF1UF</name>
							<description>Buffer 1 Underflow</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF1THR</name>
							<description>Buffer 2 Threshold Event</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF1CORR</name>
							<description>Buffer 1 Corrupt</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF2OF</name>
							<description>Buffer 2 Overflow</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF2UF</name>
							<description>Buffer 2 Underflow</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF2THR</name>
							<description>Buffer 2 Threshold Event</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF2CORR</name>
							<description>Buffer 2 Corrupt</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF3OF</name>
							<description>Buffer 3 Overflow</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF3UF</name>
							<description>Buffer 3 Underflow</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF3THR</name>
							<description>Buffer 3 Threshold Event</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF3CORR</name>
							<description>Buffer 3 Corrupt</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUSERROR</name>
							<description>Bus Error</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFS</name>
					<description/>
					<addressOffset>0x0E4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x8F0F0F0F</resetMask>
					<fields>
						<field>
							<name>BUF0OF</name>
							<description>Buffer 0 Overflow</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF0UF</name>
							<description>Buffer 0 Underflow</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF0THR</name>
							<description>Buffer 0 Threshold Event</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF0CORR</name>
							<description>Buffer 0 Corrupt</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF1OF</name>
							<description>Buffer 1 Overflow</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF1UF</name>
							<description>Buffer 1 Underflow</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF1THR</name>
							<description>Buffer 2 Threshold Event</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF1CORR</name>
							<description>Buffer 1 Corrupt</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF2OF</name>
							<description>Buffer 2 Overflow</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF2UF</name>
							<description>Buffer 2 Underflow</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF2THR</name>
							<description>Buffer 2 Threshold Event</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF2CORR</name>
							<description>Buffer 2 Corrupt</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF3OF</name>
							<description>Buffer 3 Overflow</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF3UF</name>
							<description>Buffer 3 Underflow</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF3THR</name>
							<description>Buffer 3 Threshold Event</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF3CORR</name>
							<description>Buffer 3 Corrupt</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUSERROR</name>
							<description>Bus Error</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IFC</name>
					<description/>
					<addressOffset>0x0E8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x8F0F0F0F</resetMask>
					<fields>
						<field>
							<name>BUF0OF</name>
							<description>Buffer 0 Overflow</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF0UF</name>
							<description>Buffer 0 Underflow</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF0THR</name>
							<description>Buffer 0 Threshold Event</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF0CORR</name>
							<description>Buffer 0 Corrupt</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF1OF</name>
							<description>Buffer 1 Overflow</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF1UF</name>
							<description>Buffer 1 Underflow</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF1THR</name>
							<description>Buffer 2 Threshold Event</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF1CORR</name>
							<description>Buffer 1 Corrupt</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF2OF</name>
							<description>Buffer 2 Overflow</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF2UF</name>
							<description>Buffer 2 Underflow</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF2THR</name>
							<description>Buffer 2 Threshold Event</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF2CORR</name>
							<description>Buffer 2 Corrupt</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF3OF</name>
							<description>Buffer 3 Overflow</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF3UF</name>
							<description>Buffer 3 Underflow</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF3THR</name>
							<description>Buffer 3 Threshold Event</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF3CORR</name>
							<description>Buffer 3 Corrupt</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUSERROR</name>
							<description>Bus Error</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IEN</name>
					<description/>
					<addressOffset>0x0EC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x8F0F0F0F</resetMask>
					<fields>
						<field>
							<name>BUF0OF</name>
							<description>Buffer 0 Overflow</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF0UF</name>
							<description>Buffer 0 Underflow</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF0THR</name>
							<description>Buffer 0 Threshold Event</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF0CORR</name>
							<description>Buffer 0 Corrupt</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF1OF</name>
							<description>Buffer 1 Overflow</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF1UF</name>
							<description>Buffer 1 Underflow</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF1THR</name>
							<description>Buffer 2 Threshold Event</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF1CORR</name>
							<description>Buffer 1 Corrupt</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF2OF</name>
							<description>Buffer 2 Overflow</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF2UF</name>
							<description>Buffer 2 Underflow</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF2THR</name>
							<description>Buffer 2 Threshold Event</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF2CORR</name>
							<description>Buffer 2 Corrupt</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF3OF</name>
							<description>Buffer 3 Overflow</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF3UF</name>
							<description>Buffer 3 Underflow</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF3THR</name>
							<description>Buffer 3 Threshold Event</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUF3CORR</name>
							<description>Buffer 3 Corrupt</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BUSERROR</name>
							<description>Bus Error</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
