VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>DEVINFO</name>
			<description>DEVINFO</description>
			<baseAddress>0x0FE08000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x00000400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CAL</name>
					<description/>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>CRC</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TEMP</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MODULEINFO</name>
					<description/>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>HWREV</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ANTENNA</name>
							<description/>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUMBER</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TYPE</name>
							<description/>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LFXO</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EXPRESS</name>
							<description/>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LFXOCALVAL</name>
							<description/>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HFXOCALVAL</name>
							<description/>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RESERVED1</name>
							<description/>
							<bitOffset>20</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MODXOCAL</name>
					<description/>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>HFXOCTUNE</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LFXOTUNING</name>
							<description/>
							<bitOffset>9</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTINFO</name>
					<description/>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>TYPE</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CONNECTION</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>REV</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EUI48L</name>
					<description/>
					<addressOffset>0x028</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>UNIQUEID</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OUI48L</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EUI48H</name>
					<description/>
					<addressOffset>0x02C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>OUI48H</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CUSTOMINFO</name>
					<description/>
					<addressOffset>0x030</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>PARTNO</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MEMINFO</name>
					<description/>
					<addressOffset>0x034</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>TEMPGRADE</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PKGTYPE</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PINCOUNT</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FLASH_PAGE_SIZE</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UNIQUEL</name>
					<description/>
					<addressOffset>0x040</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>UNIQUEL</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UNIQUEH</name>
					<description/>
					<addressOffset>0x044</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>UNIQUEH</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MSIZE</name>
					<description/>
					<addressOffset>0x048</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>FLASH</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SRAM</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PART</name>
					<description/>
					<addressOffset>0x04C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>DEVICE_NUMBER</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DEVICE_FAMILY</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PROD_REV</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVINFOREV</name>
					<description/>
					<addressOffset>0x050</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>DEVINFOREV</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EMUTEMP</name>
					<description/>
					<addressOffset>0x054</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>EMUTEMPROOM</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0CAL0</name>
					<description/>
					<addressOffset>0x060</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>OFFSET1V25</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>NEGSEOFFSET1V25</name>
							<description/>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GAIN1V25</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OFFSET2V5</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>NEGSEOFFSET2V5</name>
							<description/>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GAIN2V5</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0CAL1</name>
					<description/>
					<addressOffset>0x064</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>OFFSETVDD</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>NEGSEOFFSETVDD</name>
							<description/>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GAINVDD</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OFFSET5VDIFF</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>NEGSEOFFSET5VDIFF</name>
							<description/>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GAIN5VDIFF</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0CAL2</name>
					<description/>
					<addressOffset>0x068</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>OFFSET2XVDD</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>NEGSEOFFSET2XVDD</name>
							<description/>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0CAL3</name>
					<description/>
					<addressOffset>0x06C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>TEMPREAD1V25</name>
							<description/>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HFRCOCAL0</name>
					<description/>
					<addressOffset>0x080</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>TUNING</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FINETUNING</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FREQRANGE</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CMPBIAS</name>
							<description/>
							<bitOffset>21</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LDOHP</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLKDIV</name>
							<description/>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FINETUNINGEN</name>
							<description/>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VREFTC</name>
							<description/>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HFRCOCAL3</name>
					<description/>
					<addressOffset>0x08C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>TUNING</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FINETUNING</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FREQRANGE</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CMPBIAS</name>
							<description/>
							<bitOffset>21</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LDOHP</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLKDIV</name>
							<description/>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FINETUNINGEN</name>
							<description/>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VREFTC</name>
							<description/>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HFRCOCAL6</name>
					<description/>
					<addressOffset>0x098</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>TUNING</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FINETUNING</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FREQRANGE</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CMPBIAS</name>
							<description/>
							<bitOffset>21</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LDOHP</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLKDIV</name>
							<description/>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FINETUNINGEN</name>
							<description/>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VREFTC</name>
							<description/>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HFRCOCAL7</name>
					<description/>
					<addressOffset>0x09C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>TUNING</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FINETUNING</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FREQRANGE</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CMPBIAS</name>
							<description/>
							<bitOffset>21</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LDOHP</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLKDIV</name>
							<description/>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FINETUNINGEN</name>
							<description/>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VREFTC</name>
							<description/>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HFRCOCAL8</name>
					<description/>
					<addressOffset>0x0A0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>TUNING</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FINETUNING</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FREQRANGE</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CMPBIAS</name>
							<description/>
							<bitOffset>21</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LDOHP</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLKDIV</name>
							<description/>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FINETUNINGEN</name>
							<description/>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VREFTC</name>
							<description/>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HFRCOCAL10</name>
					<description/>
					<addressOffset>0x0A8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>TUNING</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FINETUNING</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FREQRANGE</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CMPBIAS</name>
							<description/>
							<bitOffset>21</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LDOHP</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLKDIV</name>
							<description/>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FINETUNINGEN</name>
							<description/>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VREFTC</name>
							<description/>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HFRCOCAL11</name>
					<description/>
					<addressOffset>0x0AC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>TUNING</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FINETUNING</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FREQRANGE</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CMPBIAS</name>
							<description/>
							<bitOffset>21</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LDOHP</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLKDIV</name>
							<description/>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FINETUNINGEN</name>
							<description/>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VREFTC</name>
							<description/>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
