VDowbensky/efr32_baremetal/rail12/EFR32FG1V131F256GM48_updated_setclr.svd
				<register>
					<name>DCDCLPVCTRL1</name>
					<description/>
					<addressOffset>0x170</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>1V2LPATT0LPCMPBIAS2</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>1V8LPATT0LPCMPBIAS2</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>1V2LPATT0LPCMPBIAS3</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>1V8LPATT0LPCMPBIAS3</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCDCLPVCTRL2</name>
					<description/>
					<addressOffset>0x174</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>1V8LPATT1LPCMPBIAS0</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>3V0LPATT1LPCMPBIAS0</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>1V8LPATT1LPCMPBIAS1</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>3V0LPATT1LPCMPBIAS1</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCDCLPVCTRL3</name>
					<description/>
					<addressOffset>0x178</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>1V8LPATT1LPCMPBIAS2</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>3V0LPATT1LPCMPBIAS2</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>1V8LPATT1LPCMPBIAS3</name>
							<description/>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>3V0LPATT1LPCMPBIAS3</name>
							<description/>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCDCLPCMPHYSSEL0</name>
					<description/>
					<addressOffset>0x17C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>LPCMPHYSSELLPATT0</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LPCMPHYSSELLPATT1</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCDCLPCMPHYSSEL1</name>
					<description/>
					<addressOffset>0x180</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>LPCMPHYSSELLPCMPBIAS0</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LPCMPHYSSELLPCMPBIAS1</name>
							<description/>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LPCMPHYSSELLPCMPBIAS2</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LPCMPHYSSELLPCMPBIAS3</name>
							<description/>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
	</peripherals>
	<!--vendorExtions is _required_ to pass through Schema validation-->
	<vendorExtensions>
		<name>Copyright 2020 Silicon Laboratories, Inc.</name>
		<flashBaseAddress>0x00000000</flashBaseAddress>
		<flashSize>0x00040000</flashSize>
		<flashAccessTypes>rx</flashAccessTypes>
		<sramBaseAddress>0x20000000</sramBaseAddress>
		<sramSize>0x00008000</sramSize>
		<sramAccessTypes>rwx</sramAccessTypes>
	</vendorExtensions>
</device>
